#pragma once

// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid

// Size 0x48
struct TrackedEncounterStateChangedTelemetryEvent
{
public:
	struct FString                                               TrackedEncounterId;                                // 0x0(0x10)
	struct FString                                               SubjectName;                                       // 0x10(0x10)
	float                                                        TimeStamp;                                         // 0x20(0x4)
	char                                                         OldState;                                          // 0x24(0x1)
	char                                                         NewState;                                          // 0x25(0x1)
	char                                                         PlayersEngaged;                                    // 0x26(0x1)
	char                                                         CrewsEngaged;                                      // 0x27(0x1)
	struct Vector                                                Location;                                          // 0x28(0xc)
	char                                                         pad0x4_PEUUH[0x4];                                 // 0x34(0x4)
	struct FString                                               RegionName;                                        // 0x38(0x10)
};


// Size 0x1
struct PlayerEnteredTrackedEncounterDiscoveredEvent
{
public:
	char                                                         pad0x1_LX3AB[0x1];                                 // 0x0(0x1)
};


// Size 0x14
struct TrackedEncounterFeatureToggledIslandName
{
public:
	struct FName                                                 IslandName;                                        // 0x0(0x8)
	struct FeatureFlag                                           FeatureToggle;                                     // 0x8(0xc)
};


// Size 0x38
struct TrackedEncounterEvent
{
public:
	char                                                         pad0x10_CIM39[0x10];                               // 0x0(0x10)
	class UClass*                                                TrackedEncounterClassId;                           // 0x10(0x8)
	class TrackedEncounter*                                      TrackedEncounter;                                  // 0x18(0x8)
	char                                                         pad0x18_VYNKU[0x18];                               // 0x20(0x18)
};


// Size 0x48
struct TrackedEncounterDespawnedTelemetryEvent
{
public:
	struct FString                                               TrackedEncounterId;                                // 0x0(0x10)
	struct FString                                               SubjectName;                                       // 0x10(0x10)
	float                                                        EncounterDuration;                                 // 0x20(0x4)
	char                                                         DespawnReason;                                     // 0x24(0x1)
	char                                                         pad0x3_DZM7T[0x3];                                 // 0x25(0x3)
	struct Vector                                                Location;                                          // 0x28(0xc)
	char                                                         pad0x4_VEHX0[0x4];                                 // 0x34(0x4)
	struct FString                                               RegionName;                                        // 0x38(0x10)
};


// Size 0x18
struct TrackedEncounterWeightedIslandNamesGroup
{
public:
	TArray<struct TrackedEncounterFeatureToggledIslandName>      IslandNames;                                       // 0x0(0x10)
	float                                                        Weight;                                            // 0x10(0x4)
	char                                                         pad0x4_5RTAO[0x4];                                 // 0x14(0x4)
};


