#pragma once

// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid

#include "TrackedEncounters_Structs.h"


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class TrackedEncountersEventServiceInterface: public Interface
{
public:
};


// Size 0x40 (Full Size[0x68] - InheritedSize[0x28]
class TrackedEncounter: public Object
{
public:
	class AIFixedWavesSpawner*                                   Spawner;                                           // 0x28(0x8)
	class AIProximityPlayerTracker*                              ProximityPlayerTracker;                            // 0x30(0x8)
	char                                                         pad0x30_WSUCC[0x30];                               // 0x38(0x30)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class SandboxPerformanceConstraintSharedResource_TrackedEncounters: public SandboxPerformanceConstraintSharedResourceType
{
public:
};


// Size 0x198 (Full Size[0x538] - InheritedSize[0x3a0]
class TrackedEncountersEventService: public Actor
{
public:
	char                                                         pad0x10_J0NFX[0x10];                               // 0x3a0(0x10)
	class TrackedEncountersEventServiceParams*                   TrackedEncounterServiceParams;                     // 0x3b0(0x8)
	char                                                         pad0xb8_F5WN9[0xb8];                               // 0x3b8(0xb8)
	struct TrackedEncounterEvent                                 ActiveTrackedEncounterEvent;                       // 0x470(0x38)
	char                                                         pad0x90_OSK8U[0x90];                               // 0x4a8(0x90)
};


// Size 0x8 (Full Size[0x50] - InheritedSize[0x48]
class TrackedEncounterParams: public GameEventParams
{
public:
	class AIFixedWavesSpawner*                                   Spawner;                                           // 0x48(0x8)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class SandboxPerformanceConstraintActivity_TrackedEncounters: public SandboxPerformanceConstraintActivityType
{
public:
};


// Size 0x18 (Full Size[0x40] - InheritedSize[0x28]
class TrackedEncountersEventServiceParams: public DataAsset
{
public:
	class UClass*                                                TrackedEncounterClassId;                           // 0x28(0x8)
	class EnvQuery*                                              EncounterSpawnLocationEQSQuery;                    // 0x30(0x8)
	class TrackedEncounterParams*                                TrackedEncounterParams;                            // 0x38(0x8)
};


