#pragma once

// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid

#include "TrackedEncounters_Structs.h"


// Size 0x1b0 (Full Size[0x550] - InheritedSize[0x3a0]
class TrackedEncountersEventService: public Actor
{
public:
	char                                                         pad0x10_2RBE5[0x10];                               // 0x3a0(0x10)
	class TrackedEncountersEventServiceParams*                   TrackedEncounterServiceParams;                     // 0x3b0(0x8)
	char                                                         pad0x198_FSP65[0x198];                             // 0x3b8(0x198)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class GameEventAIEncounterDebugFunctionLibrary: public BlueprintFunctionLibrary
{
public:
};


// Size 0x8 (Full Size[0x68] - InheritedSize[0x60]
class ReduceTrackedEncounterTaleService: public TaleQuestService
{
public:
	char                                                         pad0x8_IB8IZ[0x8];                                 // 0x60(0x8)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class ReduceTrackedEncounterTaleServiceDesc: public TaleQuestServiceDesc
{
public:
};


// Size 0x118 (Full Size[0x160] - InheritedSize[0x48]
class TrackedEncounterParams: public GameEventParams
{
public:
	class AIFixedWavesSpawner*                                   Spawner;                                           // 0x48(0x8)
	TArray<struct TrackedEncounterWeightedIslandNamesGroup>      WeightedIslandNameGroups;                          // 0x50(0x10)
	float                                                        IslandReselectionCooldownTime;                     // 0x60(0x4)
	struct FName                                                 NamedPointsGroup;                                  // 0x64(0x8)
	char                                                         pad0x4_1OLXO[0x4];                                 // 0x6c(0x4)
	class UClass*                                                LootAIClassIdSpawnCriteria;                        // 0x70(0x8)
	class LootSpawnParamsDataAsset*                              LootDataAsset;                                     // 0x78(0x8)
	float                                                        EventSignalHeightOffset;                           // 0xa0(0x4)
	char                                                         pad0x4_ZU3FR[0x4];                                 // 0xa4(0x4)
	float                                                        DioramaYawOffset;                                  // 0xc8(0x4)
	char                                                         pad0x4_2Y3ZR[0x4];                                 // 0xcc(0x4)
	class UClass*                                                DioramaLocationSourceActor;                        // 0xd0(0x8)
	class AIDioramaDesc*                                         DioramaDesc;                                       // 0xd8(0x8)
	TArray<class SceneDialogueData*>                             DioramaDialogue;                                   // 0xe0(0x10)
	class UClass*                                                InteractableMusicZone;                             // 0xf0(0x8)
	TArray<class Class*>                                         HealthMusicZones;                                  // 0xf8(0x10)
	class UClass*                                                ParamDrivenMusicZone;                              // 0x108(0x8)
	TArray<struct Name>                                          WwiseSwitchValues;                                 // 0x110(0x10)
	struct FName                                                 WwiseSwitchGroup;                                  // 0x120(0x8)
	class UClass*                                                DeathMusicZone;                                    // 0x128(0x8)
	float                                                        NotificationUpdateInterval;                        // 0x130(0x4)
	float                                                        ShowBannerRadius;                                  // 0x134(0x4)
	class GameEventBannerDataAsset*                              EnteredBanner;                                     // 0x138(0x8)
	class GameEventBannerDataAsset*                              CompleteBanner;                                    // 0x140(0x8)
	float                                                        DiscoverRadius;                                    // 0x148(0x4)
	float                                                        ExpirationTime;                                    // 0x14c(0x4)
	float                                                        ExpirationCheckUpdateInterval;                     // 0x150(0x4)
	float                                                        DespawnTimeAfterComplete;                          // 0x154(0x4)
	float                                                        IslandReservationRadius;                           // 0x158(0x4)
	char                                                         pad0x4_6XEW7[0x4];                                 // 0x15c(0x4)
};


// Size 0x48 (Full Size[0x3e8] - InheritedSize[0x3a0]
class TrackedEncounter: public Actor
{
public:
	char                                                         pad0x8_MUPHL[0x8];                                 // 0x3a0(0x8)
	class TrackedEncounterParams*                                Params;                                            // 0x3a8(0x8)
	class AIFixedWavesSpawner*                                   Spawner;                                           // 0x3b0(0x8)
	class AIProximityPlayerTracker*                              ProximityPlayerTracker;                            // 0x3b8(0x8)
	class AIItemSpawnComponent*                                  LootItemSpawnComponent;                            // 0x3c0(0x8)
	class UClass*                                                AIClassToTriggerLoot;                              // 0x3c8(0x8)
	class AIDioramaLocationSourceActor*                          DioramaLocationSource;                             // 0x3d0(0x8)
	class AIDioramaController*                                   AIDioramaController;                               // 0x3d8(0x8)
	class Actor*                                                 ActiveMusicZone;                                   // 0x3e0(0x8)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class SPC_Activity_TrackedEncounters: public SandboxPerformanceConstraintActivityType
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class TrackedEncountersEventServiceInterface: public Interface
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class EnvQueryContext_AllGameEventAIEncounterOccupiedLocations: public EnvQueryContext
{
public:
};


// Size 0x20 (Full Size[0x48] - InheritedSize[0x28]
class TrackedEncountersEventServiceParams: public DataAsset
{
public:
	class UClass*                                                TrackedEncounterClassId;                           // 0x28(0x8)
	class EnvQuery*                                              EncounterSpawnLocationEQSQuery;                    // 0x30(0x8)
	class TrackedEncounterParams*                                TrackedEncounterParams;                            // 0x38(0x8)
	char                                                         MaxNumberOfEvents;                                 // 0x40(0x1)
	char                                                         pad0x3_492DK[0x3];                                 // 0x41(0x3)
	float                                                        ReduceEventsUpdateInterval;                        // 0x44(0x4)
};


