// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0xa8 (Full Size[0x470] - InheritedSize[0x3c8]
class ShimmerActor: public Actor
{
public:
};


// Size 0x40 (Full Size[0x68] - InheritedSize[0x28]
class TreasuryWaveDataAsset: public DataAsset
{
public:
	TArray<class AIProgressiveWavesSpawner*>                     Waves1Player;                                      // 0x28(0x10)
	TArray<class AIProgressiveWavesSpawner*>                     Waves2Player;                                      // 0x38(0x10)
	TArray<class AIProgressiveWavesSpawner*>                     Waves3Player;                                      // 0x48(0x10)
	TArray<class AIProgressiveWavesSpawner*>                     Waves4Player;                                      // 0x58(0x10)
};


// Size 0x130 (Full Size[0x4f8] - InheritedSize[0x3c8]
class TreasuryRoom: public Actor
{
public:
	char                                                         pad0x8_JVHOB[0x8];                                 // 0x3c8(0x8)
	Class BoxComponent*                                          RoomAreaComponent;                                 // 0x3d0(0x8)
	float                                                        TreasuryInactiveDurationMinSeconds;                // 0x3d8(0x4)
	float                                                        TreasuryInactiveDurationMaxSeconds;                // 0x3dc(0x4)
	float                                                        RoomFailureDurationSeconds;                        // 0x3e0(0x4)
	float                                                        WaveDelaySeconds;                                  // 0x3e4(0x4)
	float                                                        EncounterDelaySeconds;                             // 0x3e8(0x4)
	float                                                        VaultDoorAnimDurationSeconds;                      // 0x3ec(0x4)
	float                                                        VaultDoorOpenDurationSeconds;                      // 0x3f0(0x4)
	int                                                          MinWavesInEncounter;                               // 0x3f4(0x4)
	int                                                          MaxWavesInEncounter;                               // 0x3f8(0x4)
	int                                                          MaxEncounters;                                     // 0x3fc(0x4)
	TArray<struct WaveEncounters>                                WaveEncounters;                                    // 0x400(0x10)
	Class Actor*                                                 FloodMechanismActor;                               // 0x410(0x8)
	Class Actor*                                                 FloodTriggerActor;                                 // 0x418(0x8)
	Class Actor*                                                 DrainMechanismActor;                               // 0x420(0x8)
	Class Actor*                                                 DrainTriggerActor;                                 // 0x428(0x8)
	Class Actor*                                                 VaultMechanismActor;                               // 0x430(0x8)
	Class Actor*                                                 VaultTriggerActor;                                 // 0x438(0x8)
	class                                                        VaultLootSpawner;                                  // 0x440(0x8)
	Class Actor*                                                 VaultLootSpawnLocationActor;                       // 0x448(0x8)
	TArray<class Actor*>                                         OverlappingActors;                                 // 0x470(0x10)
	TArray<Weakclass CachedParticipantControllers>               CachedParticipantControllers;                      // 0x480(0x10)
	Class Actor*                                                 VaultLootSpawnerActor;                             // 0x490(0x8)
	Struct PlayerStat                                            VaultOpenStat;                                     // 0x498(0x4)
	char                                                         pad0x4_0B81T[0x4];                                 // 0x49c(0x4)
	Class MechanismActionComponent*                              FloodMechanismComponent;                           // 0x4a0(0x8)
	Class MechanismActionComponent*                              DrainMechanismComponent;                           // 0x4a8(0x8)
	Class MechanismActionComponent*                              VaultMechanismComponent;                           // 0x4b0(0x8)
	char                                                         pad0x40_SWZCM[0x40];                               // 0x4b8(0x40)
};


}