#pragma once

// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid

#include "TreasuryFramework_Structs.h"


// Size 0x8 (Full Size[0x418] - InheritedSize[0x410]
class SunkenKingdomShrineDeepSeaRegion: public DeepSeaRegion
{
public:
	char                                                         pad0x8_D9IYI[0x8];                                 // 0x410(0x8)
};


// Size 0xb0 (Full Size[0x588] - InheritedSize[0x4d8]
class SunkenKingdomShrineEventRoom: public EventRoom
{
public:
	char                                                         pad0x10_NLTIR[0x10];                               // 0x4d8(0x10)
	class Actor*                                                 EntranceActor;                                     // 0x4e8(0x8)
	class GameEventOnDemandAvailabilityHandler*                  GameEventOnDemandAvailabilityHandler;              // 0x4f0(0x8)
	struct StringAssetReference                                  AvailabilityParamsAssetFileLocation;               // 0x4f8(0x10)
	class ObjectProximityResetComponent*                         PuzzleResetComponent;                              // 0x508(0x8)
	class GameEventItemSpawnSelectorComponent*                   ItemSpawnSelectorComponent;                        // 0x510(0x8)
	char                                                         pad0x70_1XXEN[0x70];                               // 0x518(0x70)
};


// Size 0x248 (Full Size[0x5e8] - InheritedSize[0x3a0]
class TreasuryRoom: public Actor
{
public:
	char                                                         pad0x20_9LJDR[0x20];                               // 0x3a0(0x20)
	class BoxComponent*                                          RoomAreaComponent;                                 // 0x3c0(0x8)
	float                                                        TreasuryInactiveDurationMinSeconds;                // 0x3c8(0x4)
	float                                                        TreasuryInactiveDurationMaxSeconds;                // 0x3cc(0x4)
	float                                                        RoomFailureDurationSeconds;                        // 0x3d0(0x4)
	float                                                        WaveDelaySeconds;                                  // 0x3d4(0x4)
	float                                                        EncounterDelaySeconds;                             // 0x3d8(0x4)
	float                                                        VaultDoorAnimDurationSeconds;                      // 0x3dc(0x4)
	float                                                        VaultDoorOpenDurationSeconds;                      // 0x3e0(0x4)
	int                                                          MinWavesInEncounter;                               // 0x3e4(0x4)
	int                                                          MaxWavesInEncounter;                               // 0x3e8(0x4)
	int                                                          MaxEncounters;                                     // 0x3ec(0x4)
	TArray<struct TreasuryWaveEncounter>                         WaveEncounters;                                    // 0x3f0(0x10)
	struct FText                                                 OnTreasuryRoomCompleteEmergentBannerText;          // 0x400(0x38)
	struct StringAssetReference                                  SunkenTreasuryAvailabilityParamsAssetFileLocation; // 0x438(0x10)
	class Actor*                                                 FloodMechanismActor;                               // 0x448(0x8)
	class Actor*                                                 FloodTriggerActor;                                 // 0x450(0x8)
	class Actor*                                                 DrainMechanismActor;                               // 0x458(0x8)
	class Actor*                                                 DrainTriggerActor;                                 // 0x460(0x8)
	class Actor*                                                 VaultMechanismActor;                               // 0x468(0x8)
	class Actor*                                                 VaultTriggerActor;                                 // 0x470(0x8)
	class UClass*                                                VaultLootSpawner;                                  // 0x478(0x8)
	class Actor*                                                 VaultLootSpawnLocationActor;                       // 0x480(0x8)
	class Actor*                                                 EntranceSirenWindowActor;                          // 0x488(0x8)
	class GameEventOnDemandAvailabilityHandler*                  GameEventOnDemandAvailabilityHandler;              // 0x4b0(0x8)
	TArray<class Actor*>                                         OverlappingActors;                                 // 0x4b8(0x10)
	TArray<uintptr_t>                                            CachedParticipantControllers;                      // 0x4c8(0x10)
	class Actor*                                                 VaultLootSpawnerActor;                             // 0x4d8(0x8)
	struct PlayerStat                                            VaultOpenStat;                                     // 0x4e0(0x4)
	char                                                         pad0x4_M0CDB[0x4];                                 // 0x4e4(0x4)
	class MechanismActionComponent*                              FloodMechanismComponent;                           // 0x4e8(0x8)
	class MechanismActionComponent*                              DrainMechanismComponent;                           // 0x4f0(0x8)
	class MechanismActionComponent*                              VaultMechanismComponent;                           // 0x4f8(0x8)
	struct ObjectMessagingDispatcher                             EventDispatcher;                                   // 0x530(0xa0)
	char                                                         pad0x18_XBI47[0x18];                               // 0x5d0(0x18)
};


// Size 0x8 (Full Size[0x418] - InheritedSize[0x410]
class SunkenKingdomTreasuryDeepSeaRegion: public DeepSeaRegion
{
public:
	char                                                         pad0x8_V30PM[0x8];                                 // 0x410(0x8)
};


// Size 0x30 (Full Size[0x4f0] - InheritedSize[0x4c0]
class SunkenKingdomShrineFinalRewardSpawnComponent: public ItemSpawnComponent
{
public:
	char                                                         pad0x30_UECYB[0x30];                               // 0x4c0(0x30)
};


// Size 0xa8 (Full Size[0x448] - InheritedSize[0x3a0]
class ShimmerActor: public Actor
{
public:
	char                                                         pad0xa8_4TBL7[0xa8];                               // 0x3a0(0xa8)
};


// Size 0x40 (Full Size[0x68] - InheritedSize[0x28]
class TreasuryWaveDataAsset: public DataAsset
{
public:
	TArray<class AIProgressiveWavesSpawner*>                     Waves1Player;                                      // 0x28(0x10)
	TArray<class AIProgressiveWavesSpawner*>                     Waves2Player;                                      // 0x38(0x10)
	TArray<class AIProgressiveWavesSpawner*>                     Waves3Player;                                      // 0x48(0x10)
	TArray<class AIProgressiveWavesSpawner*>                     Waves4Player;                                      // 0x58(0x10)
};


