// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x48
struct TreasuryWaveEncounter
{
public:
	byte                                                         EncounterType;                                     // 0x0(0x1)
	char                                                         pad0x7_71RLG[0x7];                                 // 0x1(0x7)
	class SpawnAIWaveMechanismAction*                            SpawnerMechanism;                                  // 0x8(0x8)
	class Actor*                                                 MechanismTrigger;                                  // 0x10(0x8)
	class SpawnAIWaveMechanismAction*                            SpawnerMechanismVaultMaster;                       // 0x18(0x8)
	class Actor*                                                 MechanismTriggerVaultMaster;                       // 0x20(0x8)
	class TreasuryWaveDataAsset*                                 Waves;                                             // 0x28(0x8)
	class TreasuryWaveDataAsset*                                 FinalWaves;                                        // 0x30(0x8)
	class TreasuryWaveDataAsset*                                 FinalWavesVaultMaster;                             // 0x38(0x8)
	bool                                                         NeedsRoomFlooded;                                  // 0x40(0x1)
	char                                                         pad0x7_SB91A[0x7];                                 // 0x41(0x7)
};


// Size 0x1c
struct TreasuryWaveTracker
{
public:
	char                                                         pad0x1c_UUEMV[0x1c];                               // 0x0(0x1c)
};


// Size 0x1
struct EventTreasuryRoomInactive
{
public:
	char                                                         pad0x1_5LN81[0x1];                                 // 0x0(0x1)
};


// Size 0x1
struct EventTreasuryRoomActive
{
public:
	char                                                         pad0x1_4B3V0[0x1];                                 // 0x0(0x1)
};


}