#pragma once

// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid

// Size 0x48
struct TreasuryWaveEncounter
{
public:
	char                                                         EncounterType;                                     // 0x0(0x1)
	class SpawnAIWaveMechanismAction*                            SpawnerMechanism;                                  // 0x8(0x8)
	class Actor*                                                 MechanismTrigger;                                  // 0x10(0x8)
	class SpawnAIWaveMechanismAction*                            SpawnerMechanismVaultMaster;                       // 0x18(0x8)
	class Actor*                                                 MechanismTriggerVaultMaster;                       // 0x20(0x8)
	class TreasuryWaveDataAsset*                                 Waves;                                             // 0x28(0x8)
	class TreasuryWaveDataAsset*                                 FinalWaves;                                        // 0x30(0x8)
	class TreasuryWaveDataAsset*                                 FinalWavesVaultMaster;                             // 0x38(0x8)
	bool                                                         NeedsRoomFlooded;                                  // 0x40(0x1)
};


// Size 0x10
struct EventTreasuryRoomFlooded
{
public:
	class Actor*                                                 Treasury;                                          // 0x8(0x8)
};


