// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x28
struct ChestEntitlementTrinketItem
{
public:
	Struct FString                                               ItemDesc;                                          // 0x0(0x10)
	int                                                          PlacedValue;                                       // 0x10(0x4)
	int                                                          PlacedThreshold;                                   // 0x14(0x4)
	Struct FString                                               OwnerGamerTag;                                     // 0x18(0x10)
};


// Size 0x10
struct TrinketLoadout
{
public:
	TArray<Struct TrinketLoadoutEntry>                           TrinketEntries;                                    // 0x0(0x10)
};


// Size 0x18
struct TrinketLoadoutEntry
{
public:
	class                                                        Trinket;                                           // 0x0(0x8)
	Struct FString                                               TrinketOwnerPlayerXuid;                            // 0x8(0x10)
};


// Size 0x38
struct EquipTrinketOnServerLoadoutRpc
{
public:
	Struct NetSubObjectPtr                                       TrinketLoadoutComponent;                           // 0x10(0x14)
	class                                                        TrinketToEquip;                                    // 0x28(0x8)
	int                                                          LocationIndex;                                     // 0x30(0x4)
};


// Size 0x28
struct RemoveInteractingPlayerFromTrinketMountpointRpc
{
public:
	Struct NetSubObjectPtr                                       TrinketMountpointManager;                          // 0x10(0x14)
	int                                                          MountpointIndex;                                   // 0x24(0x4)
};


// Size 0x30
struct UnequipAllTrinketsOfClassOnServerLoadoutRpc
{
public:
	Struct NetSubObjectPtr                                       TrinketLoadoutComponent;                           // 0x10(0x14)
	class                                                        TrinketToUnequip;                                  // 0x28(0x8)
};


// Size 0x10
struct TrinketLoadoutUpdatedEvent
{
public:
};


// Size 0x20
struct TrinketLoadoutModelEntry
{
public:
	struct FName                                                 EntitlementId;                                     // 0x0(0x8)
	int                                                          LocationIndex;                                     // 0x8(0x4)
	Struct FString                                               UserId;                                            // 0x10(0x10)
};


// Size 0x10
struct TrinketLoadoutModel
{
public:
	TArray<Struct TrinketLoadoutModelEntry>                      Trinkets;                                          // 0x0(0x10)
};


// Size 0x10
struct EventTrinketSetReady
{
public:
};


// Size 0x1
struct RequestTrinketChestItemInfoEvent
{
public:
};


// Size 0x10
struct RequestTrinketLoadoutUIEvent
{
public:
	TArray<Str Categories>                                       Categories;                                        // 0x0(0x10)
};


// Size 0x10
struct RequestTrinketEntitlementsUIEvent
{
public:
	Struct FString                                               TrinketCategory;                                   // 0x0(0x10)
};


// Size 0x10
struct RequestUnequipTrinketsOfClassUIEvent
{
public:
	Struct FString                                               TrinketDesc;                                       // 0x0(0x10)
};


}