// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x20
struct ContextualTutorialPromptDesc
{
public:
	class                                                        PromptActorClass;                                  // 0x0(0x8)
	class                                                        AccessKey;                                         // 0x8(0x8)
	struct FName                                                 FeatureName;                                       // 0x10(0x8)
	int                                                          MustBeUnderCount;                                  // 0x18(0x4)
};


// Size 0x1
struct EventTutorialTypeDecided
{
public:
	byte                                                         TutorialType;                                      // 0x0(0x1)
};


// Size 0x18
struct BeachNPCSpawnFlowNetworkEvent
{
public:
	bool                                                         HasTaleCheckpointVoyage;                           // 0x10(0x1)
};


// Size 0x30
struct HasTutorialStarterBegunCondition
{
public:
	byte                                                         TutorialStarterType;                               // 0x28(0x1)
};


// Size 0x28
struct TutorialStepEndedTelemetryEvent
{
public:
	Struct FString                                               SequenceName;                                      // 0x0(0x10)
	Struct FString                                               StepName;                                          // 0x10(0x10)
	bool                                                         StepCompleted;                                     // 0x20(0x1)
	bool                                                         IsFinalStep;                                       // 0x21(0x1)
};


// Size 0x1
struct TutorialShowTutorialLegendaryTavernStrangerEvent
{
public:
};


}