#pragma once

// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid

// Size 0x28
struct TutorialStepEndedTelemetryEvent
{
public:
	struct FString                                               SequenceName;                                      // 0x0(0x10)
	struct FString                                               StepName;                                          // 0x10(0x10)
	bool                                                         StepCompleted;                                     // 0x20(0x1)
	bool                                                         IsFinalStep;                                       // 0x21(0x1)
};


// Size 0x1
struct EventTutorialTypeDecided
{
public:
	char                                                         TutorialType;                                      // 0x0(0x1)
};


// Size 0x30
struct HasTutorialStarterBegunCondition
{
public:
	char                                                         TutorialStarterType;                               // 0x28(0x1)
};


// Size 0x20
struct BeachNPCSpawnFlowNetworkEvent
{
public:
	bool                                                         HasTaleCheckpointVoyage;                           // 0x18(0x1)
};


// Size 0x38
struct IntroductionToSOTIntroAnimatic
{
public:
	class UClass*                                                ShipSize;                                          // 0x0(0x8)
	struct FirstPersonAnimaticSettings                           IntroAnimationSettings;                            // 0x8(0x2c)
};


// Size 0x38
struct ContextualTutorialPromptDesc
{
public:
	assetclass                                                   PromptActorClass;                                  // 0x0(0x20)
	class UClass*                                                AccessKey;                                         // 0x20(0x8)
	struct FeatureFlag                                           Feature;                                           // 0x28(0xc)
	int                                                          MustBeUnderCount;                                  // 0x34(0x4)
};


