// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x0
class CaptaincyTutorialDesc: public EntitlementDesc
{
public:
};


// Size 0xb8
class CompanyTutorialVoyageProgress: public Object
{
public:
	class                                                        AssignedVoyageProposalDescClass;                   // 0x28(0x8)
	class                                                        AssignedTaleRankDescClass;                         // 0x30(0x8)
};


// Size 0x58
class ContextualTutorialComponent: public ActorComponent
{
public:
	TArray<Struct ContextualTutorialPromptDesc>                  ContextualTutorialClasses;                         // 0xc8(0x10)
	TArray<class SpawnedPromptActors*>                           SpawnedPromptActors;                               // 0xd8(0x10)
};


// Size 0x8
class HasTutorialStarterBegunNPCDialogConditional: public NPCDialogConditional
{
public:
	byte                                                         TutorialStarterType;                               // 0x30(0x1)
};


// Size 0x0
class OnboardingStatusInterface: public Interface
{
public:
};


// Size 0x8
class Tutorial2019Component: public ActorComponent
{
public:
	bool                                                         IsEnabledByServer;                                 // 0xc8(0x1)
	bool                                                         IsInTutorialTale;                                  // 0xc9(0x1)
};


// Size 0x8
class Tutorial2019ContextualDelegatingComponent: public Tutorial2019Component
{
public:
	Class ContextualTutorialComponent*                           ContextualTutorialComponent;                       // 0xd0(0x8)
};


// Size 0x0
class Tutorial2019FunctionLibrary: public BlueprintFunctionLibrary
{
public:
};


// Size 0x0
class TutorialHelpersBlueprintLibrary: public BlueprintFunctionLibrary
{
public:
};


// Size 0x0
class TutorialManagerInterface: public Interface
{
public:
};


// Size 0x68
class TutorialManager: public ActorComponent
{
public:
	class                                                        CompanyOnboardingStarterClass;                     // 0xd0(0x8)
	class                                                        MaidenVoyageStarterClass;                          // 0xd8(0x8)
	class                                                        BeachNPCSpawnFlowStarterClass;                     // 0xe0(0x8)
	class                                                        CaptaincyStarterClass;                             // 0xe8(0x8)
	class                                                        CaptaincyNewShipStarterClass;                      // 0xf0(0x8)
	class                                                        CaptaincyWithBeachNPCSpawnStarterClass;            // 0xf8(0x8)
	class                                                        SelectedTutorialClass;                             // 0x100(0x8)
	Class TutorialStarter*                                       SelectedTutorial;                                  // 0x108(0x8)
	byte                                                         TutorialType;                                      // 0x110(0x1)
	bool                                                         HasEverPlayedFirstPersonAnimation;                 // 0x111(0x1)
	bool                                                         HasStartedTutorial;                                // 0x112(0x1)
	bool                                                         HasReceivedEntitlements;                           // 0x113(0x1)
	bool                                                         HasPosessedPawn;                                   // 0x114(0x1)
	bool                                                         HasPlayerFinshedSpawning;                          // 0x115(0x1)
	bool                                                         IsPlayerWaitingForCaptaincySessionResponse;        // 0x116(0x1)
};


// Size 0x38
class TutorialStarter: public Object
{
public:
	Class AthenaPlayerController*                                AthenaPlayerController;                            // 0x28(0x8)
	bool                                                         ShouldPlayIntroAnimatic;                           // 0x30(0x1)
	bool                                                         ShouldDisableAllIntroBehaviour;                    // 0x31(0x1)
	Struct FirstPersonAnimaticSettings                           IntroAnimationSettings;                            // 0x34(0x2c)
};


// Size 0x0
class BeachNPCSpawnFlowStarter: public TutorialStarter
{
public:
};


// Size 0x98
class CaptaincyStarter: public TutorialStarter
{
public:
	Class VoyageDescDataAsset*                                   TutorialTale;                                      // 0x60(0x8)
	bool                                                         CheckIfShipNeverSetSail;                           // 0x68(0x1)
	bool                                                         CheckIfPlayerInOutpost;                            // 0x69(0x1)
	bool                                                         CheckIfPlayerIsInCaptain;                          // 0x6a(0x1)
	class                                                        CheckIfEntitlementIsOwned;                         // 0x70(0x8)
	bool                                                         CheckIfCaptainingANewShip;                         // 0x78(0x1)
	struct FName                                                 FeatureToggle;                                     // 0x7c(0x8)
	bool                                                         CheckIfPlayerHasMadeAttempts;                      // 0x84(0x1)
	class                                                        PromptCounterKey;                                  // 0x88(0x8)
	int                                                          MaxAttemptCount;                                   // 0x90(0x4)
};


// Size 0x0
class CompanyOnboardingStarter: public TutorialStarter
{
public:
};


// Size 0x0
class MaidenVoyageStarter: public TutorialStarter
{
public:
};


}