#pragma once

// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid

// Size 0x78 (Full Size[0xa0] - InheritedSize[0x28]
class UdpMessagingSettings: public Object
{
public:
	bool                                                         EnableTransport;                                   // 0x28(0x1)
	char                                                         pad0x7_SX9VV[0x7];                                 // 0x29(0x7)
	struct FString                                               UnicastEndpoint;                                   // 0x30(0x10)
	struct FString                                               MulticastEndpoint;                                 // 0x40(0x10)
	char                                                         MulticastTimeToLive;                               // 0x50(0x1)
	char                                                         pad0x7_LJ3Y7[0x7];                                 // 0x51(0x7)
	TArray<String>                                               StaticEndpoints;                                   // 0x58(0x10)
	bool                                                         EnableTunnel;                                      // 0x68(0x1)
	char                                                         pad0x7_9BUN1[0x7];                                 // 0x69(0x7)
	struct FString                                               TunnelUnicastEndpoint;                             // 0x70(0x10)
	struct FString                                               TunnelMulticastEndpoint;                           // 0x80(0x10)
	TArray<String>                                               RemoteTunnelEndpoints;                             // 0x90(0x10)
};


