#pragma once

// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid



// Size 0x8
struct SlateChildSize
{
public:
	float                                                        Value;                                             // 0x0(0x4)
	char                                                         SizeRule;                                          // 0x4(0x1)
};


// Size 0x10
struct NamedSlotBinding
{
public:
	struct FName                                                 Name;                                              // 0x0(0x8)
	class Widget*                                                Content;                                           // 0x8(0x8)
};


// Size 0x38
struct DelegateRuntimeBinding
{
public:
	struct FString                                               ObjectName;                                        // 0x0(0x10)
	struct FName                                                 PropertyName;                                      // 0x10(0x8)
	struct FName                                                 FunctionName;                                      // 0x18(0x8)
	struct                                                       SourcePath;                                        // 0x20(0x10)
	char                                                         Kind;                                              // 0x30(0x1)
};


// Size 0x20
struct PropertyPathSegment
{
public:
	struct FName                                                 Name;                                              // 0x0(0x8)
	int                                                          ArrayIndex;                                        // 0x8(0x4)
	class Struct*                                                Struct;                                            // 0x10(0x8)
	class Field*                                                 Field;                                             // 0x18(0x8)
};


// Size 0x24
struct WidgetAnimationBinding
{
public:
	struct FName                                                 WidgetName;                                        // 0x0(0x8)
	struct FName                                                 SlotWidgetName;                                    // 0x8(0x8)
	struct                                                       AnimationGuid;                                     // 0x10(0x10)
	bool                                                         bIsRootWidget;                                     // 0x20(0x1)
};


// Size 0x1c
struct WidgetTransform
{
public:
	struct                                                       Translation;                                       // 0x0(0x8)
	struct                                                       Scale;                                             // 0x8(0x8)
	struct                                                       Shear;                                             // 0x10(0x8)
	float                                                        Angle;                                             // 0x18(0x4)
};


// Size 0x58
struct MovieSceneWidgetMaterialSectionTemplate
{
public:
	TArray<struct Name>                                          BrushPropertyNamePath;                             // 0x48(0x10)
};


// Size 0x28
struct AnchorData
{
public:
	struct                                                       Offsets;                                           // 0x0(0x10)
	struct                                                       Anchors;                                           // 0x10(0x10)
	struct                                                       Alignment;                                         // 0x20(0x8)
};


// Size 0x14
struct WidgetNavigationData
{
public:
	char                                                         Rule;                                              // 0x0(0x1)
	struct FName                                                 WidgetToFocus;                                     // 0x4(0x8)
};


// Size 0x218
struct MovieSceneMarginSectionTemplate
{
public:
	struct                                                       PropertyData;                                      // 0x18(0x20)
	struct                                                       TopCurve;                                          // 0x38(0x78)
	struct                                                       LeftCurve;                                         // 0xb0(0x78)
	struct                                                       RightCurve;                                        // 0x128(0x78)
	struct                                                       BottomCurve;                                       // 0x1a0(0x78)
};


// Size 0x380
struct MovieScene2DTransformSectionTemplate
{
public:
	struct                                                       PropertyData;                                      // 0x18(0x20)
	struct                                                       Translation;                                       // 0x38(0x78)
	struct                                                       Rotation;                                          // 0x128(0x78)
	struct                                                       Scale;                                             // 0x1a0(0x78)
	struct                                                       Shear;                                             // 0x290(0x78)
};


// Size 0x10
struct DynamicPropertyPath
{
public:
	TArray<struct PropertyPathSegment>                           Segments;                                          // 0x0(0x10)
};


