// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x20 (Full Size[0x48] - InheritedSize[0x28]
class AsyncTaskDownloadImage: public BlueprintAsyncActionBase
{
public:
};


// Size 0x60 (Full Size[0x88] - InheritedSize[0x28]
class DragDropOperation: public Object
{
public:
	Struct FString                                               Tag;                                               // 0x28(0x10)
	Class Object*                                                payload;                                           // 0x38(0x8)
	Class Widget*                                                DefaultDragVisual;                                 // 0x40(0x8)
	byte                                                         Pivot;                                             // 0x48(0x1)
	char                                                         pad0x3_QFJUM[0x3];                                 // 0x49(0x3)
	Struct Vector2D                                              Offset;                                            // 0x4c(0x8)
	char                                                         pad0x4_UC5T2[0x4];                                 // 0x54(0x4)
	char                                                         pad0x38_UU9F4[0x38];                               // 0x56(0x38)
};


// Size 0x350 (Full Size[0x3e8] - InheritedSize[0x98]
class MovieScene2DTransformSection: public MovieSceneSection
{
public:
	char                                                         pad0x8_5448H[0x8];                                 // 0x98(0x8)
	Struct RichCurve                                             Translation;                                       // 0xa0(0x78)
	char                                                         pad0x78_S7RIH[0x78];                               // 0x118(0x78)
	Struct RichCurve                                             Rotation;                                          // 0x190(0x78)
	Struct RichCurve                                             Scale;                                             // 0x208(0x78)
	char                                                         pad0x78_ZGY2C[0x78];                               // 0x280(0x78)
	Struct RichCurve                                             Shear;                                             // 0x2f8(0x78)
	char                                                         pad0x168_OFBGL[0x168];                             // 0x36e(0x168)
};


// Size 0x0 (Full Size[0xb0] - InheritedSize[0xb0]
class MovieScene2DTransformTrack: public MovieScenePropertyTrack
{
public:
};


// Size 0x1e8 (Full Size[0x280] - InheritedSize[0x98]
class MovieSceneMarginSection: public MovieSceneSection
{
public:
	char                                                         pad0x8_V8ESB[0x8];                                 // 0x98(0x8)
	Struct RichCurve                                             TopCurve;                                          // 0xa0(0x78)
	Struct RichCurve                                             LeftCurve;                                         // 0x118(0x78)
	Struct RichCurve                                             RightCurve;                                        // 0x190(0x78)
	Struct RichCurve                                             BottomCurve;                                       // 0x208(0x78)
};


// Size 0x0 (Full Size[0xb0] - InheritedSize[0xb0]
class MovieSceneMarginTrack: public MovieScenePropertyTrack
{
public:
};


// Size 0x18 (Full Size[0xb0] - InheritedSize[0x98]
class MovieSceneWidgetMaterialTrack: public MovieSceneMaterialTrack
{
public:
	TArray<Struct FName>                                         BrushPropertyNamePath;                             // 0x98(0x10)
	struct FName                                                 TrackName;                                         // 0xa8(0x8)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class NamedSlotInterface: public Interface
{
public:
};


// Size 0x20 (Full Size[0x48] - InheritedSize[0x28]
class PropertyBinding: public Object
{
public:
	char                                                         pad0x8_KNRSW[0x8];                                 // 0x28(0x8)
	Struct DynamicPropertyPath                                   SourcePath;                                        // 0x30(0x10)
	struct FName                                                 DestinationProperty;                               // 0x40(0x8)
};


// Size 0x0 (Full Size[0x48] - InheritedSize[0x48]
class BoolBinding: public PropertyBinding
{
public:
};


// Size 0x8 (Full Size[0x50] - InheritedSize[0x48]
class BrushBinding: public PropertyBinding
{
public:
};


// Size 0x8 (Full Size[0x50] - InheritedSize[0x48]
class CheckedStateBinding: public PropertyBinding
{
public:
};


// Size 0x8 (Full Size[0x50] - InheritedSize[0x48]
class ColorBinding: public PropertyBinding
{
public:
};


// Size 0x0 (Full Size[0x48] - InheritedSize[0x48]
class FloatBinding: public PropertyBinding
{
public:
};


// Size 0x0 (Full Size[0x48] - InheritedSize[0x48]
class Int32Binding: public PropertyBinding
{
public:
};


// Size 0x0 (Full Size[0x48] - InheritedSize[0x48]
class MouseCursorBinding: public PropertyBinding
{
public:
};


// Size 0x8 (Full Size[0x50] - InheritedSize[0x48]
class TextBinding: public PropertyBinding
{
public:
};


// Size 0x0 (Full Size[0x48] - InheritedSize[0x48]
class VisibilityBinding: public PropertyBinding
{
public:
};


// Size 0x0 (Full Size[0x48] - InheritedSize[0x48]
class WidgetBinding: public PropertyBinding
{
public:
};


// Size 0x8 (Full Size[0x30] - InheritedSize[0x28]
class RichTextBlockDecorator: public Object
{
public:
	bool                                                         bReveal;                                           // 0x28(0x1)
	char                                                         pad0x3_BGCHG[0x3];                                 // 0x29(0x3)
	int                                                          RevealedIndex;                                     // 0x2c(0x4)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class SlateBlueprintLibrary: public BlueprintFunctionLibrary
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class Visual: public Object
{
public:
};


// Size 0x110 (Full Size[0x138] - InheritedSize[0x28]
class Widget: public Visual
{
public:
	bool                                                         bIsVariable;                                       // 0x28(0x1)
	bool                                                         bCreatedByConstructionScript;                      // 0x29(0x1)
	char                                                         pad0x6_26N9S[0x6];                                 // 0x2a(0x6)
	Class PanelSlot*                                             Slot;                                              // 0x30(0x8)
	bool                                                         bIsEnabled;                                        // 0x38(0x1)
	char                                                         pad0x3_V4BEB[0x3];                                 // 0x39(0x3)
	Struct FText                                                 ToolTipText;                                       // 0x50(0x38)
	Class Widget*                                                ToolTipWidget;                                     // 0x98(0x8)
	byte                                                         Visiblity;                                         // 0xb0(0x1)
	byte                                                         Visibility;                                        // 0xb1(0x1)
	char                                                         pad0x2_3Z38V[0x2];                                 // 0xb2(0x2)
	bool                                                         bOverride_Cursor;                                  // 0xc4(0x1)
	char                                                         pad0x3_C69M5[0x3];                                 // 0xc5(0x3)
	byte                                                         Cursor;                                            // 0xc8(0x1)
	bool                                                         bIsVolatile;                                       // 0xc9(0x1)
	char                                                         pad0x2_Y55C2[0x2];                                 // 0xca(0x2)
	Struct WidgetTransform                                       RenderTransform;                                   // 0xcc(0x1c)
	Struct Vector2D                                              RenderTransformPivot;                              // 0xe8(0x8)
	Class WidgetNavigation*                                      Navigation;                                        // 0xf0(0x8)
	char                                                         pad0x30_XKNNR[0x30];                               // 0xf8(0x30)
	TArray<class PropertyBinding*>                               NativeBindings;                                    // 0x128(0x10)
};


// Size 0xf8 (Full Size[0x230] - InheritedSize[0x138]
class UserWidget: public Widget
{
public:
	char                                                         pad0x8_RU66H[0x8];                                 // 0x138(0x8)
	Struct LinearColor                                           ColorAndOpacity;                                   // 0x140(0x10)
	Struct SlateColor                                            ForegroundColor;                                   // 0x160(0x30)
	bool                                                         bSupportsKeyboardFocus;                            // 0x1a0(0x1)
	char                                                         pad0x7_J0ZX8[0x7];                                 // 0x1a1(0x7)
	Class WidgetTree*                                            WidgetTree;                                        // 0x1a8(0x8)
	TArray<class UMGSequencePlayer*>                             ActiveSequencePlayers;                             // 0x1b0(0x10)
	TArray<class UMGSequencePlayer*>                             StoppedSequencePlayers;                            // 0x1c0(0x10)
	TArray<Struct NamedSlotBinding>                              NamedSlotBindings;                                 // 0x1d0(0x10)
	char                                                         pad0x70_0DS9H[0x70];                               // 0x1de(0x70)
};


// Size 0x5a0 (Full Size[0x5c8] - InheritedSize[0x28]
class UMGSequencePlayer: public Object
{
public:
	char                                                         pad0x368_N5PRU[0x368];                             // 0x28(0x368)
	Class WidgetAnimation*                                       Animation;                                         // 0x390(0x8)
	char                                                         pad0x240_K7EV9[0x240];                             // 0x396(0x240)
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class PanelSlot: public Visual
{
public:
	Class PanelWidget*                                           Parent;                                            // 0x28(0x8)
	Class Widget*                                                Content;                                           // 0x30(0x8)
};


// Size 0x30 (Full Size[0x68] - InheritedSize[0x38]
class BorderSlot: public PanelSlot
{
public:
	Struct Margin                                                Padding;                                           // 0x38(0x10)
	byte                                                         HorizontalAlignment;                               // 0x48(0x1)
	byte                                                         VerticalAlignment;                                 // 0x49(0x1)
	char                                                         pad0x20_7FGFJ[0x20];                               // 0x48(0x20)
};


// Size 0x30 (Full Size[0x68] - InheritedSize[0x38]
class ButtonSlot: public PanelSlot
{
public:
	Struct Margin                                                Padding;                                           // 0x38(0x10)
	byte                                                         HorizontalAlignment;                               // 0x48(0x1)
	byte                                                         VerticalAlignment;                                 // 0x49(0x1)
	char                                                         pad0x20_50DOY[0x20];                               // 0x48(0x20)
};


// Size 0x38 (Full Size[0x70] - InheritedSize[0x38]
class CanvasPanelSlot: public PanelSlot
{
public:
	Struct AnchorData                                            LayoutData;                                        // 0x38(0x28)
	bool                                                         bAutoSize;                                         // 0x60(0x1)
	char                                                         pad0x3_3ZRMY[0x3];                                 // 0x61(0x3)
	int                                                          ZOrder;                                            // 0x64(0x4)
	char                                                         pad0x10_YCUQL[0x10];                               // 0x66(0x10)
};


// Size 0x28 (Full Size[0x60] - InheritedSize[0x38]
class GridSlot: public PanelSlot
{
public:
	byte                                                         HorizontalAlignment;                               // 0x38(0x1)
	byte                                                         VerticalAlignment;                                 // 0x39(0x1)
	char                                                         pad0x2_TZKVV[0x2];                                 // 0x3a(0x2)
	int                                                          Row;                                               // 0x3c(0x4)
	int                                                          RowSpan;                                           // 0x40(0x4)
	int                                                          Column;                                            // 0x44(0x4)
	int                                                          ColumnSpan;                                        // 0x48(0x4)
	int                                                          Layer;                                             // 0x4c(0x4)
	Struct Vector2D                                              Nudge;                                             // 0x50(0x8)
	char                                                         pad0x18_HRRHQ[0x18];                               // 0x56(0x18)
};


// Size 0x28 (Full Size[0x60] - InheritedSize[0x38]
class HorizontalBoxSlot: public PanelSlot
{
public:
	Struct Margin                                                Padding;                                           // 0x38(0x10)
	Struct SlateChildSize                                        Size;                                              // 0x48(0x8)
	byte                                                         HorizontalAlignment;                               // 0x50(0x1)
	byte                                                         VerticalAlignment;                                 // 0x51(0x1)
	char                                                         pad0x10_RYBUL[0x10];                               // 0x50(0x10)
};


// Size 0x20 (Full Size[0x58] - InheritedSize[0x38]
class OverlaySlot: public PanelSlot
{
public:
	Struct Margin                                                Padding;                                           // 0x38(0x10)
	byte                                                         HorizontalAlignment;                               // 0x48(0x1)
	byte                                                         VerticalAlignment;                                 // 0x49(0x1)
	char                                                         pad0x10_7T6QZ[0x10];                               // 0x48(0x10)
};


// Size 0x18 (Full Size[0x50] - InheritedSize[0x38]
class SafeZoneSlot: public PanelSlot
{
public:
	bool                                                         bIsTitleSafe;                                      // 0x38(0x1)
	byte                                                         HAlign;                                            // 0x39(0x1)
	byte                                                         VAlign;                                            // 0x3a(0x1)
	char                                                         pad0x1_GG481[0x1];                                 // 0x3b(0x1)
	Struct Margin                                                Padding;                                           // 0x3c(0x10)
	char                                                         pad0x24_KHF71[0x24];                               // 0x4a(0x24)
};


// Size 0x30 (Full Size[0x68] - InheritedSize[0x38]
class ScaleBoxSlot: public PanelSlot
{
public:
	Struct Margin                                                Padding;                                           // 0x38(0x10)
	byte                                                         HorizontalAlignment;                               // 0x48(0x1)
	byte                                                         VerticalAlignment;                                 // 0x49(0x1)
	char                                                         pad0x20_X2CSF[0x20];                               // 0x48(0x20)
};


// Size 0x20 (Full Size[0x58] - InheritedSize[0x38]
class ScrollBoxSlot: public PanelSlot
{
public:
	Struct Margin                                                Padding;                                           // 0x38(0x10)
	byte                                                         HorizontalAlignment;                               // 0x48(0x1)
	char                                                         pad0x11_6C9OU[0x11];                               // 0x47(0x11)
};


// Size 0x30 (Full Size[0x68] - InheritedSize[0x38]
class SizeBoxSlot: public PanelSlot
{
public:
	Struct Margin                                                Padding;                                           // 0x38(0x10)
	byte                                                         HorizontalAlignment;                               // 0x48(0x1)
	byte                                                         VerticalAlignment;                                 // 0x49(0x1)
	char                                                         pad0x20_SUJHA[0x20];                               // 0x48(0x20)
};


// Size 0x18 (Full Size[0x50] - InheritedSize[0x38]
class UniformGridSlot: public PanelSlot
{
public:
	byte                                                         HorizontalAlignment;                               // 0x38(0x1)
	byte                                                         VerticalAlignment;                                 // 0x39(0x1)
	char                                                         pad0x2_XZYDT[0x2];                                 // 0x3a(0x2)
	int                                                          Row;                                               // 0x3c(0x4)
	int                                                          Column;                                            // 0x40(0x4)
	char                                                         pad0x14_ZUMJO[0x14];                               // 0x42(0x14)
};


// Size 0x28 (Full Size[0x60] - InheritedSize[0x38]
class VerticalBoxSlot: public PanelSlot
{
public:
	Struct Margin                                                Padding;                                           // 0x38(0x10)
	Struct SlateChildSize                                        Size;                                              // 0x48(0x8)
	byte                                                         HorizontalAlignment;                               // 0x50(0x1)
	byte                                                         VerticalAlignment;                                 // 0x51(0x1)
	char                                                         pad0x10_0JZ71[0x10];                               // 0x50(0x10)
};


// Size 0x20 (Full Size[0x58] - InheritedSize[0x38]
class WidgetSwitcherSlot: public PanelSlot
{
public:
	Struct Margin                                                Padding;                                           // 0x38(0x10)
	byte                                                         HorizontalAlignment;                               // 0x48(0x1)
	byte                                                         VerticalAlignment;                                 // 0x49(0x1)
	char                                                         pad0x10_NQO8V[0x10];                               // 0x48(0x10)
};


// Size 0x28 (Full Size[0x60] - InheritedSize[0x38]
class WrapBoxSlot: public PanelSlot
{
public:
	Struct Margin                                                Padding;                                           // 0x38(0x10)
	bool                                                         bFillEmptySpace;                                   // 0x48(0x1)
	char                                                         pad0x3_HGMVD[0x3];                                 // 0x49(0x3)
	float                                                        FillSpanWhenLessThan;                              // 0x4c(0x4)
	byte                                                         HorizontalAlignment;                               // 0x50(0x1)
	byte                                                         VerticalAlignment;                                 // 0x51(0x1)
	char                                                         pad0x10_48YCS[0x10];                               // 0x50(0x10)
};


// Size 0xc0 (Full Size[0x1f8] - InheritedSize[0x138]
class CircularThrobber: public Widget
{
public:
	int                                                          NumberOfPieces;                                    // 0x138(0x4)
	float                                                        Period;                                            // 0x13c(0x4)
	float                                                        Radius;                                            // 0x140(0x4)
	char                                                         pad0x4_GT6SB[0x4];                                 // 0x144(0x4)
	Class SlateBrushAsset*                                       PieceImage;                                        // 0x148(0x8)
	Struct SlateBrush                                            Image;                                             // 0x150(0x90)
	char                                                         pad0x138_6Y4MC[0x138];                             // 0x1de(0x138)
};


// Size 0x38 (Full Size[0x170] - InheritedSize[0x138]
class ComboBox: public Widget
{
public:
	TArray<class Object*>                                        Items;                                             // 0x138(0x10)
	char                                                         pad0x48_5EPP8[0x48];                               // 0x146(0x48)
};


// Size 0x4e8 (Full Size[0x620] - InheritedSize[0x138]
class ComboBoxString: public Widget
{
public:
	TArray<Str DefaultOptions>                                   DefaultOptions;                                    // 0x138(0x10)
	Struct FString                                               SelectedOption;                                    // 0x148(0x10)
	Struct ComboBoxStyle                                         WidgetStyle;                                       // 0x158(0x428)
	Struct Margin                                                ContentPadding;                                    // 0x580(0x10)
	float                                                        MaxListHeight;                                     // 0x590(0x4)
	bool                                                         HasDownArrow;                                      // 0x594(0x1)
	char                                                         pad0x3_7JXXO[0x3];                                 // 0x595(0x3)
	char                                                         pad0x8e_M47XR[0x8e];                               // 0x596(0x8e)
};


// Size 0x390 (Full Size[0x4c8] - InheritedSize[0x138]
class EditableText: public Widget
{
public:
	Struct FText                                                 Text;                                              // 0x138(0x38)
	Struct FText                                                 HintText;                                          // 0x180(0x38)
	Struct EditableTextStyle                                     WidgetStyle;                                       // 0x1c8(0x228)
	Class SlateWidgetStyleAsset*                                 Style;                                             // 0x3f0(0x8)
	Class SlateBrushAsset*                                       BackgroundImageSelected;                           // 0x3f8(0x8)
	Class SlateBrushAsset*                                       BackgroundImageComposing;                          // 0x400(0x8)
	Class SlateBrushAsset*                                       CaretImage;                                        // 0x408(0x8)
	Struct SlateFontInfo                                         Font;                                              // 0x410(0x40)
	Struct SlateColor                                            ColorAndOpacity;                                   // 0x450(0x30)
	bool                                                         IsReadOnly;                                        // 0x480(0x1)
	bool                                                         IsPassword;                                        // 0x481(0x1)
	char                                                         pad0x2_G7V1M[0x2];                                 // 0x482(0x2)
	float                                                        MinimumDesiredWidth;                               // 0x484(0x4)
	bool                                                         IsCaretMovedWhenGainFocus;                         // 0x488(0x1)
	bool                                                         SelectAllTextWhenFocused;                          // 0x489(0x1)
	bool                                                         RevertTextOnEscape;                                // 0x48a(0x1)
	bool                                                         ClearKeyboardFocusOnCommit;                        // 0x48b(0x1)
	bool                                                         SelectAllTextOnCommit;                             // 0x48c(0x1)
	char                                                         pad0x3_MP278[0x3];                                 // 0x48d(0x3)
	char                                                         pad0x3e_14D5J[0x3e];                               // 0x48e(0x3e)
};


// Size 0x9c0 (Full Size[0xaf8] - InheritedSize[0x138]
class EditableTextBox: public Widget
{
public:
	Struct FText                                                 Text;                                              // 0x138(0x38)
	Struct EditableTextBoxStyle                                  WidgetStyle;                                       // 0x180(0x860)
	Class SlateWidgetStyleAsset*                                 Style;                                             // 0x9e0(0x8)
	Struct FText                                                 HintText;                                          // 0x9e8(0x38)
	Struct SlateFontInfo                                         Font;                                              // 0xa30(0x40)
	Struct LinearColor                                           ForegroundColor;                                   // 0xa70(0x10)
	Struct LinearColor                                           BackgroundColor;                                   // 0xa80(0x10)
	Struct LinearColor                                           ReadOnlyForegroundColor;                           // 0xa90(0x10)
	bool                                                         IsReadOnly;                                        // 0xaa0(0x1)
	bool                                                         IsPassword;                                        // 0xaa1(0x1)
	char                                                         pad0x2_ET162[0x2];                                 // 0xaa2(0x2)
	float                                                        MinimumDesiredWidth;                               // 0xaa4(0x4)
	Struct Margin                                                Padding;                                           // 0xaa8(0x10)
	bool                                                         IsCaretMovedWhenGainFocus;                         // 0xab8(0x1)
	bool                                                         SelectAllTextWhenFocused;                          // 0xab9(0x1)
	bool                                                         RevertTextOnEscape;                                // 0xaba(0x1)
	bool                                                         ClearKeyboardFocusOnCommit;                        // 0xabb(0x1)
	bool                                                         SelectAllTextOnCommit;                             // 0xabc(0x1)
	char                                                         pad0x3_DBFZK[0x3];                                 // 0xabd(0x3)
	char                                                         pad0x3e_9MP1W[0x3e];                               // 0xabe(0x3e)
};


// Size 0x58 (Full Size[0x190] - InheritedSize[0x138]
class ExpandableArea: public Widget
{
public:
	char                                                         pad0x8_05UDY[0x8];                                 // 0x138(0x8)
	bool                                                         bIsExpanded;                                       // 0x140(0x1)
	char                                                         pad0x3_JXG42[0x3];                                 // 0x141(0x3)
	float                                                        MaxHeight;                                         // 0x144(0x4)
	Struct Margin                                                AreaPadding;                                       // 0x148(0x10)
	Class Widget*                                                HeaderContent;                                     // 0x168(0x8)
	Class Widget*                                                BodyContent;                                       // 0x170(0x8)
	char                                                         pad0x28_WAPUD[0x28];                               // 0x176(0x28)
};


// Size 0xf0 (Full Size[0x228] - InheritedSize[0x138]
class Image: public Widget
{
public:
	Class SlateBrushAsset*                                       Image;                                             // 0x138(0x8)
	Struct SlateBrush                                            Brush;                                             // 0x140(0x90)
	Struct LinearColor                                           ColorAndOpacity;                                   // 0x1e0(0x10)
	char                                                         pad0x58_YDCQW[0x58];                               // 0x1ee(0x58)
};


// Size 0x218 (Full Size[0x350] - InheritedSize[0x138]
class MultiLineEditableText: public Widget
{
public:
	Struct FText                                                 Text;                                              // 0x138(0x38)
	Struct TextBlockStyle                                        WidgetStyle;                                       // 0x170(0x160)
	byte                                                         Justification;                                     // 0x2d0(0x1)
	bool                                                         bAutoWrapText;                                     // 0x2d1(0x1)
	char                                                         pad0x2_J2T43[0x2];                                 // 0x2d2(0x2)
	float                                                        WrapTextAt;                                        // 0x2d4(0x4)
	Struct SlateFontInfo                                         Font;                                              // 0x2d8(0x40)
	char                                                         pad0xb8_EWLRF[0xb8];                               // 0x316(0xb8)
};


// Size 0xab0 (Full Size[0xbe8] - InheritedSize[0x138]
class MultiLineEditableTextBox: public Widget
{
public:
	Struct FText                                                 Text;                                              // 0x138(0x38)
	Struct EditableTextBoxStyle                                  WidgetStyle;                                       // 0x170(0x860)
	Struct TextBlockStyle                                        TextStyle;                                         // 0x9d0(0x160)
	Class SlateWidgetStyleAsset*                                 Style;                                             // 0xb30(0x8)
	byte                                                         Justification;                                     // 0xb38(0x1)
	bool                                                         bAutoWrapText;                                     // 0xb39(0x1)
	char                                                         pad0x2_VBORY[0x2];                                 // 0xb3a(0x2)
	float                                                        WrapTextAt;                                        // 0xb3c(0x4)
	Struct SlateFontInfo                                         Font;                                              // 0xb40(0x40)
	Struct LinearColor                                           ForegroundColor;                                   // 0xb80(0x10)
	Struct LinearColor                                           BackgroundColor;                                   // 0xb90(0x10)
	Struct LinearColor                                           ReadOnlyForegroundColor;                           // 0xba0(0x10)
	char                                                         pad0x58_LVIFQ[0x58];                               // 0xbae(0x58)
};


// Size 0x18 (Full Size[0x150] - InheritedSize[0x138]
class NativeWidgetHost: public Widget
{
public:
};


// Size 0x18 (Full Size[0x150] - InheritedSize[0x138]
class PanelWidget: public Widget
{
public:
	TArray<class PanelSlot*>                                     Slots;                                             // 0x138(0x10)
	char                                                         pad0x28_N6X4G[0x28];                               // 0x146(0x28)
};


// Size 0x18 (Full Size[0x168] - InheritedSize[0x150]
class CanvasPanel: public PanelWidget
{
public:
};


// Size 0x0 (Full Size[0x150] - InheritedSize[0x150]
class ContentWidget: public PanelWidget
{
public:
};


// Size 0x160 (Full Size[0x2b0] - InheritedSize[0x150]
class Border: public ContentWidget
{
public:
	Struct LinearColor                                           ContentColorAndOpacity;                            // 0x150(0x10)
	Struct Margin                                                Padding;                                           // 0x170(0x10)
	byte                                                         HorizontalAlignment;                               // 0x180(0x1)
	byte                                                         VerticalAlignment;                                 // 0x181(0x1)
	char                                                         pad0x6_ZK0E3[0x6];                                 // 0x182(0x6)
	Struct SlateBrush                                            Background;                                        // 0x188(0x90)
	Struct LinearColor                                           BrushColor;                                        // 0x228(0x10)
	bool                                                         bShowEffectWhenDisabled;                           // 0x248(0x1)
	char                                                         pad0x3_JOEO1[0x3];                                 // 0x249(0x3)
	Class SlateBrushAsset*                                       Brush;                                             // 0x2a8(0x8)
};


// Size 0x320 (Full Size[0x470] - InheritedSize[0x150]
class Button: public ContentWidget
{
public:
	Class SlateWidgetStyleAsset*                                 Style;                                             // 0x150(0x8)
	Struct ButtonStyle                                           WidgetStyle;                                       // 0x158(0x2a8)
	Struct LinearColor                                           ColorAndOpacity;                                   // 0x400(0x10)
	Struct LinearColor                                           BackgroundColor;                                   // 0x410(0x10)
	byte                                                         ClickMethod;                                       // 0x420(0x1)
	byte                                                         TouchMethod;                                       // 0x421(0x1)
	bool                                                         IsFocusable;                                       // 0x422(0x1)
	char                                                         pad0x5_YLXLV[0x5];                                 // 0x423(0x5)
	char                                                         pad0x52_1WZO3[0x52];                               // 0x426(0x52)
};


// Size 0x6c8 (Full Size[0x818] - InheritedSize[0x150]
class CheckBox: public ContentWidget
{
public:
	byte                                                         CheckedState;                                      // 0x150(0x1)
	char                                                         pad0x3_Q1LCG[0x3];                                 // 0x151(0x3)
	Struct CheckBoxStyle                                         WidgetStyle;                                       // 0x168(0x5f0)
	Class SlateWidgetStyleAsset*                                 Style;                                             // 0x758(0x8)
	Class SlateBrushAsset*                                       UncheckedImage;                                    // 0x760(0x8)
	Class SlateBrushAsset*                                       UncheckedHoveredImage;                             // 0x768(0x8)
	Class SlateBrushAsset*                                       UncheckedPressedImage;                             // 0x770(0x8)
	Class SlateBrushAsset*                                       CheckedImage;                                      // 0x778(0x8)
	Class SlateBrushAsset*                                       CheckedHoveredImage;                               // 0x780(0x8)
	Class SlateBrushAsset*                                       CheckedPressedImage;                               // 0x788(0x8)
	Class SlateBrushAsset*                                       UndeterminedImage;                                 // 0x790(0x8)
	Class SlateBrushAsset*                                       UndeterminedHoveredImage;                          // 0x798(0x8)
	Class SlateBrushAsset*                                       UndeterminedPressedImage;                          // 0x7a0(0x8)
	byte                                                         HorizontalAlignment;                               // 0x7a8(0x1)
	char                                                         pad0x3_3MVZF[0x3];                                 // 0x7a9(0x3)
	Struct Margin                                                Padding;                                           // 0x7ac(0x10)
	char                                                         pad0x4_LYLKG[0x4];                                 // 0x7bc(0x4)
	Struct SlateColor                                            BorderBackgroundColor;                             // 0x7c0(0x30)
	char                                                         pad0x88_16M79[0x88];                               // 0x7ee(0x88)
};


// Size 0x20 (Full Size[0x170] - InheritedSize[0x150]
class InvalidationBox: public ContentWidget
{
public:
	bool                                                         CacheRelativeTransforms;                           // 0x150(0x1)
	char                                                         pad0x21_PPFR9[0x21];                               // 0x14f(0x21)
};


// Size 0x48 (Full Size[0x198] - InheritedSize[0x150]
class MenuAnchor: public ContentWidget
{
public:
	class                                                        MenuClass;                                         // 0x150(0x8)
	byte                                                         Placement;                                         // 0x168(0x1)
	char                                                         pad0x7_DDVMK[0x7];                                 // 0x169(0x7)
	char                                                         pad0x36_J30ZH[0x36];                               // 0x16e(0x36)
};


// Size 0x18 (Full Size[0x168] - InheritedSize[0x150]
class NamedSlot: public ContentWidget
{
public:
};


// Size 0x18 (Full Size[0x168] - InheritedSize[0x150]
class SafeZone: public ContentWidget
{
public:
};


// Size 0x20 (Full Size[0x170] - InheritedSize[0x150]
class ScaleBox: public ContentWidget
{
public:
	byte                                                         StretchDirection;                                  // 0x150(0x1)
	byte                                                         Stretch;                                           // 0x151(0x1)
	char                                                         pad0x2_K2MCI[0x2];                                 // 0x152(0x2)
	float                                                        UserSpecifiedScale;                                // 0x154(0x4)
	char                                                         pad0x20_6FYO7[0x20];                               // 0x156(0x20)
};


// Size 0x38 (Full Size[0x188] - InheritedSize[0x150]
class SizeBox: public ContentWidget
{
public:
	bool                                                         bOverride_WidthOverride;                           // 0x150(0x1)
	bool                                                         bOverride_HeightOverride;                          // 0x150(0x1)
	bool                                                         bOverride_MinDesiredWidth;                         // 0x150(0x1)
	bool                                                         bOverride_MinDesiredHeight;                        // 0x150(0x1)
	bool                                                         bOverride_MaxDesiredWidth;                         // 0x150(0x1)
	bool                                                         bOverride_MaxDesiredHeight;                        // 0x150(0x1)
	char                                                         pad0x3_MQS9K[0x3];                                 // 0x151(0x3)
	float                                                        WidthOverride;                                     // 0x154(0x4)
	float                                                        HeightOverride;                                    // 0x158(0x4)
	float                                                        MinDesiredWidth;                                   // 0x15c(0x4)
	float                                                        MinDesiredHeight;                                  // 0x160(0x4)
	float                                                        MaxDesiredWidth;                                   // 0x164(0x4)
	float                                                        MaxDesiredHeight;                                  // 0x168(0x4)
	char                                                         pad0x24_C71GM[0x24];                               // 0x16a(0x24)
};


// Size 0x40 (Full Size[0x190] - InheritedSize[0x150]
class Viewport: public ContentWidget
{
public:
	Struct LinearColor                                           BackgroundColor;                                   // 0x150(0x10)
	char                                                         pad0x50_AI8IO[0x50];                               // 0x15e(0x50)
};


// Size 0x38 (Full Size[0x188] - InheritedSize[0x150]
class GridPanel: public PanelWidget
{
public:
	TArray<Float ColumnFill>                                     ColumnFill;                                        // 0x150(0x10)
	TArray<Float RowFill>                                        RowFill;                                           // 0x160(0x10)
	char                                                         pad0x38_XAE52[0x38];                               // 0x16e(0x38)
};


// Size 0x18 (Full Size[0x168] - InheritedSize[0x150]
class HorizontalBox: public PanelWidget
{
public:
};


// Size 0x18 (Full Size[0x168] - InheritedSize[0x150]
class Overlay: public PanelWidget
{
public:
};


// Size 0x7a0 (Full Size[0x8f0] - InheritedSize[0x150]
class ScrollBox: public PanelWidget
{
public:
	Struct ScrollBoxStyle                                        WidgetStyle;                                       // 0x150(0x248)
	Struct ScrollBarStyle                                        WidgetBarStyle;                                    // 0x398(0x518)
	Class SlateWidgetStyleAsset*                                 Style;                                             // 0x8b0(0x8)
	Class SlateWidgetStyleAsset*                                 BarStyle;                                          // 0x8b8(0x8)
	byte                                                         Orientation;                                       // 0x8c0(0x1)
	byte                                                         ScrollBarVisibility;                               // 0x8c1(0x1)
	byte                                                         ConsumeMouseWheel;                                 // 0x8c2(0x1)
	char                                                         pad0x1_1330K[0x1];                                 // 0x8c3(0x1)
	Struct Vector2D                                              ScrollbarThickness;                                // 0x8c4(0x8)
	bool                                                         AlwaysShowScrollbar;                               // 0x8cc(0x1)
	char                                                         pad0x25_84Z01[0x25];                               // 0x8cb(0x25)
};


// Size 0x30 (Full Size[0x180] - InheritedSize[0x150]
class UniformGridPanel: public PanelWidget
{
public:
	Struct Margin                                                SlotPadding;                                       // 0x150(0x10)
	float                                                        MinDesiredSlotWidth;                               // 0x160(0x4)
	float                                                        MinDesiredSlotHeight;                              // 0x164(0x4)
	char                                                         pad0x20_WH3A0[0x20];                               // 0x166(0x20)
};


// Size 0x18 (Full Size[0x168] - InheritedSize[0x150]
class VerticalBox: public PanelWidget
{
public:
};


// Size 0x20 (Full Size[0x170] - InheritedSize[0x150]
class WidgetSwitcher: public PanelWidget
{
public:
	int                                                          ActiveWidgetIndex;                                 // 0x150(0x4)
	char                                                         pad0x24_5VXQK[0x24];                               // 0x152(0x24)
};


// Size 0x20 (Full Size[0x170] - InheritedSize[0x150]
class WrapBox: public PanelWidget
{
public:
	Struct Vector2D                                              InnerSlotPadding;                                  // 0x150(0x8)
	char                                                         pad0x28_9S1R5[0x28];                               // 0x156(0x28)
};


// Size 0x228 (Full Size[0x360] - InheritedSize[0x138]
class ProgressBar: public Widget
{
public:
	Struct ProgressBarStyle                                      WidgetStyle;                                       // 0x138(0x1b8)
	Class SlateWidgetStyleAsset*                                 Style;                                             // 0x2f0(0x8)
	Class SlateBrushAsset*                                       BackgroundImage;                                   // 0x2f8(0x8)
	Class SlateBrushAsset*                                       FillImage;                                         // 0x300(0x8)
	Class SlateBrushAsset*                                       MarqueeImage;                                      // 0x308(0x8)
	float                                                        Percent;                                           // 0x310(0x4)
	byte                                                         BarFillType;                                       // 0x314(0x1)
	bool                                                         bIsMarquee;                                        // 0x315(0x1)
	char                                                         pad0x2_C2A4E[0x2];                                 // 0x316(0x2)
	Struct LinearColor                                           FillColorAndOpacity;                               // 0x328(0x10)
	char                                                         pad0x48_WUVJ8[0x48];                               // 0x336(0x48)
};


// Size 0x240 (Full Size[0x378] - InheritedSize[0x138]
class RichTextBlock: public Widget
{
public:
	Struct FText                                                 Text;                                              // 0x138(0x38)
	Struct SlateFontInfo                                         Font;                                              // 0x180(0x40)
	Struct LinearColor                                           Color;                                             // 0x1c0(0x10)
	byte                                                         Justification;                                     // 0x1d0(0x1)
	bool                                                         AutoWrapText;                                      // 0x1d1(0x1)
	char                                                         pad0x2_HWPMY[0x2];                                 // 0x1d2(0x2)
	float                                                        WrapTextAt;                                        // 0x1d4(0x4)
	Struct Margin                                                Margin;                                            // 0x1d8(0x10)
	float                                                        LineHeightPercentage;                              // 0x1e8(0x4)
	char                                                         pad0x4_G4L08[0x4];                                 // 0x1ec(0x4)
	TArray<class RichTextBlockDecorator*>                        Decorators;                                        // 0x1f0(0x10)
	char                                                         pad0x198_L22IW[0x198];                             // 0x1fe(0x198)
};


// Size 0x548 (Full Size[0x680] - InheritedSize[0x138]
class ScrollBar: public Widget
{
public:
	Struct ScrollBarStyle                                        WidgetStyle;                                       // 0x138(0x518)
	Class SlateWidgetStyleAsset*                                 Style;                                             // 0x650(0x8)
	bool                                                         bAlwaysShowScrollbar;                              // 0x658(0x1)
	byte                                                         Orientation;                                       // 0x659(0x1)
	char                                                         pad0x2_3RPSS[0x2];                                 // 0x65a(0x2)
	Struct Vector2D                                              Thickness;                                         // 0x65c(0x8)
	char                                                         pad0x2c_HXEPV[0x2c];                               // 0x662(0x2c)
};


// Size 0x2d0 (Full Size[0x408] - InheritedSize[0x138]
class Slider: public Widget
{
public:
	float                                                        Value;                                             // 0x138(0x4)
	Struct SliderStyle                                           WidgetStyle;                                       // 0x150(0x248)
	byte                                                         Orientation;                                       // 0x398(0x1)
	char                                                         pad0x3_691SF[0x3];                                 // 0x399(0x3)
	Struct LinearColor                                           SliderBarColor;                                    // 0x39c(0x10)
	Struct LinearColor                                           SliderHandleColor;                                 // 0x3ac(0x10)
	bool                                                         IndentHandle;                                      // 0x3bc(0x1)
	bool                                                         Locked;                                            // 0x3bd(0x1)
	char                                                         pad0x2_DQRMO[0x2];                                 // 0x3be(0x2)
	char                                                         pad0x4c_TAXVK[0x4c];                               // 0x3be(0x4c)
};


// Size 0x20 (Full Size[0x158] - InheritedSize[0x138]
class Spacer: public Widget
{
public:
	Struct Vector2D                                              Size;                                              // 0x138(0x8)
	char                                                         pad0x28_K55K4[0x28];                               // 0x13e(0x28)
};


// Size 0x428 (Full Size[0x560] - InheritedSize[0x138]
class SpinBox: public Widget
{
public:
	float                                                        Value;                                             // 0x138(0x4)
	Struct SpinBoxStyle                                          WidgetStyle;                                       // 0x150(0x318)
	Class SlateWidgetStyleAsset*                                 Style;                                             // 0x468(0x8)
	float                                                        Delta;                                             // 0x470(0x4)
	float                                                        SliderExponent;                                    // 0x474(0x4)
	Struct SlateFontInfo                                         Font;                                              // 0x478(0x40)
	float                                                        MinDesiredWidth;                                   // 0x4b8(0x4)
	bool                                                         ClearKeyboardFocusOnCommit;                        // 0x4bc(0x1)
	bool                                                         SelectAllTextOnCommit;                             // 0x4bd(0x1)
	char                                                         pad0x2_8UK95[0x2];                                 // 0x4be(0x2)
	Struct SlateColor                                            ForegroundColor;                                   // 0x4c0(0x30)
	bool                                                         bOverride_MinValue;                                // 0x530(0x1)
	bool                                                         bOverride_MaxValue;                                // 0x530(0x1)
	bool                                                         bOverride_MinSliderValue;                          // 0x530(0x1)
	bool                                                         bOverride_MaxSliderValue;                          // 0x530(0x1)
	char                                                         pad0x3_XMURI[0x3];                                 // 0x531(0x3)
	float                                                        MinValue;                                          // 0x534(0x4)
	float                                                        MaxValue;                                          // 0x538(0x4)
	float                                                        MinSliderValue;                                    // 0x53c(0x4)
	float                                                        MaxSliderValue;                                    // 0x540(0x4)
	char                                                         pad0x24_0MFW7[0x24];                               // 0x542(0x24)
};


// Size 0x0 (Full Size[0x138] - InheritedSize[0x138]
class TableViewBase: public Widget
{
public:
};


// Size 0x48 (Full Size[0x180] - InheritedSize[0x138]
class ListView: public TableViewBase
{
public:
	float                                                        ItemHeight;                                        // 0x138(0x4)
	char                                                         pad0x4_G4ZQC[0x4];                                 // 0x13c(0x4)
	TArray<class Object*>                                        Items;                                             // 0x140(0x10)
	byte                                                         SelectionMode;                                     // 0x150(0x1)
	char                                                         pad0x3_O591A[0x3];                                 // 0x151(0x3)
	char                                                         pad0x32_FW8SI[0x32];                               // 0x152(0x32)
};


// Size 0x48 (Full Size[0x180] - InheritedSize[0x138]
class TileView: public TableViewBase
{
public:
	float                                                        ItemWidth;                                         // 0x138(0x4)
	float                                                        ItemHeight;                                        // 0x13c(0x4)
	TArray<class Object*>                                        Items;                                             // 0x140(0x10)
	byte                                                         SelectionMode;                                     // 0x150(0x1)
	char                                                         pad0x3_KAPWO[0x3];                                 // 0x151(0x3)
	char                                                         pad0x32_D62EA[0x32];                               // 0x152(0x32)
};


// Size 0x130 (Full Size[0x268] - InheritedSize[0x138]
class TextBlock: public Widget
{
public:
	Class SlateWidgetStyleAsset*                                 Style;                                             // 0x138(0x8)
	Struct FText                                                 Text;                                              // 0x140(0x38)
	Struct SlateColor                                            ColorAndOpacity;                                   // 0x188(0x30)
	Struct SlateFontInfo                                         Font;                                              // 0x1c8(0x40)
	Struct Vector2D                                              ShadowOffset;                                      // 0x208(0x8)
	Struct LinearColor                                           ShadowColorAndOpacity;                             // 0x210(0x10)
	byte                                                         Justification;                                     // 0x230(0x1)
	bool                                                         AutoWrapText;                                      // 0x231(0x1)
	char                                                         pad0x2_MUHDD[0x2];                                 // 0x232(0x2)
	float                                                        WrapTextAt;                                        // 0x234(0x4)
	float                                                        MinDesiredWidth;                                   // 0x238(0x4)
	Struct Margin                                                Margin;                                            // 0x23c(0x10)
	float                                                        LineHeightPercentage;                              // 0x24c(0x4)
	char                                                         pad0x20_3TNI8[0x20];                               // 0x24e(0x20)
};


// Size 0xb8 (Full Size[0x1f0] - InheritedSize[0x138]
class Throbber: public Widget
{
public:
	int                                                          NumberOfPieces;                                    // 0x138(0x4)
	bool                                                         bAnimateHorizontally;                              // 0x13c(0x1)
	bool                                                         bAnimateVertically;                                // 0x13d(0x1)
	bool                                                         bAnimateOpacity;                                   // 0x13e(0x1)
	char                                                         pad0x1_1H0SJ[0x1];                                 // 0x13f(0x1)
	Class SlateBrushAsset*                                       PieceImage;                                        // 0x140(0x8)
	Struct SlateBrush                                            Image;                                             // 0x148(0x90)
	char                                                         pad0x138_7Y632[0x138];                             // 0x1d6(0x138)
};


// Size 0x38 (Full Size[0x2e0] - InheritedSize[0x2a8]
class WidgetAnimation: public MovieSceneSequence
{
public:
	char                                                         pad0x20_V8R0Q[0x20];                               // 0x2a8(0x20)
	Class MovieScene*                                            MovieScene;                                        // 0x2c8(0x8)
	TArray<Struct WidgetAnimationBinding>                        AnimationBindings;                                 // 0x2d0(0x10)
};


// Size 0x38 (Full Size[0x260] - InheritedSize[0x228]
class WidgetBlueprintGeneratedClass: public BlueprintGeneratedClass
{
public:
	Class WidgetTree*                                            WidgetTree;                                        // 0x228(0x8)
	TArray<Struct DelegateRuntimeBinding>                        Bindings;                                          // 0x230(0x10)
	TArray<class WidgetAnimation*>                               Animations;                                        // 0x240(0x10)
	TArray<Struct FName>                                         NamedSlots;                                        // 0x250(0x10)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class WidgetBlueprintLibrary: public BlueprintFunctionLibrary
{
public:
};


// Size 0xf0 (Full Size[0x6b0] - InheritedSize[0x5c0]
class WidgetComponent: public PrimitiveComponent
{
public:
	byte                                                         Space;                                             // 0x5b8(0x1)
	char                                                         pad0x7_FBY0G[0x7];                                 // 0x5b9(0x7)
	class                                                        WidgetClass;                                       // 0x5c0(0x8)
	Struct IntPoint                                              DrawSize;                                          // 0x5c8(0x8)
	Struct Vector2D                                              Pivot;                                             // 0x5d0(0x8)
	float                                                        MaxInteractionDistance;                            // 0x5d8(0x4)
	char                                                         pad0x4_IKUYW[0x4];                                 // 0x5dc(0x4)
	Class LocalPlayer*                                           OwnerPlayer;                                       // 0x5e0(0x8)
	Struct LinearColor                                           BackgroundColor;                                   // 0x5e8(0x10)
	byte                                                         BlendMode;                                         // 0x5f8(0x1)
	bool                                                         bIsOpaque;                                         // 0x5f9(0x1)
	bool                                                         bIsTwoSided;                                       // 0x5fa(0x1)
	char                                                         pad0x1_N0AA1[0x1];                                 // 0x5fb(0x1)
	float                                                        ParabolaDistortion;                                // 0x5fc(0x4)
	bool                                                         TickWhenOffscreen;                                 // 0x600(0x1)
	char                                                         pad0x7_PMR0O[0x7];                                 // 0x601(0x7)
	Class UserWidget*                                            Widget;                                            // 0x608(0x8)
	Class BodySetup*                                             BodySetup;                                         // 0x610(0x8)
	Class MaterialInterface*                                     TranslucentMaterial;                               // 0x618(0x8)
	Class MaterialInterface*                                     TranslucentMaterial_OneSided;                      // 0x620(0x8)
	Class MaterialInterface*                                     OpaqueMaterial;                                    // 0x628(0x8)
	Class MaterialInterface*                                     OpaqueMaterial_OneSided;                           // 0x630(0x8)
	Class MaterialInterface*                                     MaskedMaterial;                                    // 0x638(0x8)
	Class MaterialInterface*                                     MaskedMaterial_OneSided;                           // 0x640(0x8)
	Class TextureRenderTarget2D*                                 RenderTarget;                                      // 0x648(0x8)
	Class MaterialInstanceDynamic*                               MaterialInstance;                                  // 0x650(0x8)
	bool                                                         bUseLegacyRotation;                                // 0x658(0x1)
	bool                                                         bAddedToScreen;                                    // 0x659(0x1)
	char                                                         pad0x58_YW217[0x58];                               // 0x658(0x58)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class WidgetLayoutLibrary: public BlueprintFunctionLibrary
{
public:
};


// Size 0x78 (Full Size[0xa0] - InheritedSize[0x28]
class WidgetNavigation: public Object
{
public:
	Struct WidgetNavigationData                                  Up;                                                // 0x28(0x14)
	Struct WidgetNavigationData                                  Down;                                              // 0x3c(0x14)
	Struct WidgetNavigationData                                  Left;                                              // 0x50(0x14)
	Struct WidgetNavigationData                                  Right;                                             // 0x64(0x14)
	Struct WidgetNavigationData                                  Next;                                              // 0x78(0x14)
	Struct WidgetNavigationData                                  Previous;                                          // 0x8c(0x14)
};


// Size 0x18 (Full Size[0x40] - InheritedSize[0x28]
class WidgetTree: public Object
{
public:
	Class Widget*                                                RootWidget;                                        // 0x28(0x8)
	TArray<class Widget*>                                        AllWidgets;                                        // 0x30(0x10)
};


}