// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x20 (Full Size[0x48] - InheritedSize[0x28]
class AsyncTaskDownloadImage: public BlueprintAsyncActionBase
{
public:
	char                                                         pad0x20_SWR9M[0x20];                               // 0x28(0x20)
};


// Size 0x60 (Full Size[0x88] - InheritedSize[0x28]
class DragDropOperation: public Object
{
public:
	struct FString                                               Tag;                                               // 0x28(0x10)
	class Object*                                                payload;                                           // 0x38(0x8)
	class Widget*                                                DefaultDragVisual;                                 // 0x40(0x8)
	byte                                                         Pivot;                                             // 0x48(0x1)
	char                                                         pad0x3_JGKJP[0x3];                                 // 0x49(0x3)
	struct Vector2D                                              Offset;                                            // 0x4c(0x8)
	char                                                         pad0x4_Y52O5[0x4];                                 // 0x54(0x4)
	char                                                         pad0x30_I6M62[0x30];                               // 0x58(0x30)
};


// Size 0x350 (Full Size[0x3e8] - InheritedSize[0x98]
class MovieScene2DTransformSection: public MovieSceneSection
{
public:
	char                                                         pad0x8_LG23Y[0x8];                                 // 0x98(0x8)
	struct RichCurve                                             Translation;                                       // 0xa0(0x78)
	char                                                         pad0x78_R3FZW[0x78];                               // 0x118(0x78)
	struct RichCurve                                             Rotation;                                          // 0x190(0x78)
	struct RichCurve                                             Scale;                                             // 0x208(0x78)
	char                                                         pad0x78_D7LID[0x78];                               // 0x280(0x78)
	struct RichCurve                                             Shear;                                             // 0x2f8(0x78)
	char                                                         pad0x78_RJO2C[0x78];                               // 0x370(0x78)
};


// Size 0x0 (Full Size[0xb0] - InheritedSize[0xb0]
class MovieScene2DTransformTrack: public MovieScenePropertyTrack
{
public:
};


// Size 0x1e8 (Full Size[0x280] - InheritedSize[0x98]
class MovieSceneMarginSection: public MovieSceneSection
{
public:
	char                                                         pad0x8_EYAPC[0x8];                                 // 0x98(0x8)
	struct RichCurve                                             TopCurve;                                          // 0xa0(0x78)
	struct RichCurve                                             LeftCurve;                                         // 0x118(0x78)
	struct RichCurve                                             RightCurve;                                        // 0x190(0x78)
	struct RichCurve                                             BottomCurve;                                       // 0x208(0x78)
};


// Size 0x0 (Full Size[0xb0] - InheritedSize[0xb0]
class MovieSceneMarginTrack: public MovieScenePropertyTrack
{
public:
};


// Size 0x18 (Full Size[0xb0] - InheritedSize[0x98]
class MovieSceneWidgetMaterialTrack: public MovieSceneMaterialTrack
{
public:
	TArray<struct FName>                                         BrushPropertyNamePath;                             // 0x98(0x10)
	struct FName                                                 TrackName;                                         // 0xa8(0x8)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class NamedSlotInterface: public Interface
{
public:
};


// Size 0x20 (Full Size[0x48] - InheritedSize[0x28]
class PropertyBinding: public Object
{
public:
	char                                                         pad0x8_AVM5Q[0x8];                                 // 0x28(0x8)
	struct DynamicPropertyPath                                   SourcePath;                                        // 0x30(0x10)
	struct FName                                                 DestinationProperty;                               // 0x40(0x8)
};


// Size 0x0 (Full Size[0x48] - InheritedSize[0x48]
class BoolBinding: public PropertyBinding
{
public:
};


// Size 0x8 (Full Size[0x50] - InheritedSize[0x48]
class BrushBinding: public PropertyBinding
{
public:
	char                                                         pad0x8_8I68W[0x8];                                 // 0x48(0x8)
};


// Size 0x8 (Full Size[0x50] - InheritedSize[0x48]
class CheckedStateBinding: public PropertyBinding
{
public:
	char                                                         pad0x8_VU94W[0x8];                                 // 0x48(0x8)
};


// Size 0x8 (Full Size[0x50] - InheritedSize[0x48]
class ColorBinding: public PropertyBinding
{
public:
	char                                                         pad0x8_GQMTA[0x8];                                 // 0x48(0x8)
};


// Size 0x0 (Full Size[0x48] - InheritedSize[0x48]
class FloatBinding: public PropertyBinding
{
public:
};


// Size 0x0 (Full Size[0x48] - InheritedSize[0x48]
class Int32Binding: public PropertyBinding
{
public:
};


// Size 0x0 (Full Size[0x48] - InheritedSize[0x48]
class MouseCursorBinding: public PropertyBinding
{
public:
};


// Size 0x8 (Full Size[0x50] - InheritedSize[0x48]
class TextBinding: public PropertyBinding
{
public:
	char                                                         pad0x8_R6ES6[0x8];                                 // 0x48(0x8)
};


// Size 0x0 (Full Size[0x48] - InheritedSize[0x48]
class VisibilityBinding: public PropertyBinding
{
public:
};


// Size 0x0 (Full Size[0x48] - InheritedSize[0x48]
class WidgetBinding: public PropertyBinding
{
public:
};


// Size 0x8 (Full Size[0x30] - InheritedSize[0x28]
class RichTextBlockDecorator: public Object
{
public:
	bool                                                         bReveal;                                           // 0x28(0x1)
	char                                                         pad0x3_CPESO[0x3];                                 // 0x29(0x3)
	int                                                          RevealedIndex;                                     // 0x2c(0x4)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class SlateBlueprintLibrary: public BlueprintFunctionLibrary
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class Visual: public Object
{
public:
};


// Size 0x110 (Full Size[0x138] - InheritedSize[0x28]
class Widget: public Visual
{
public:
	bool                                                         bIsVariable;                                       // 0x28(0x1)
	bool                                                         bCreatedByConstructionScript;                      // 0x29(0x1)
	char                                                         pad0x6_HKO8X[0x6];                                 // 0x2a(0x6)
	class PanelSlot*                                             Slot;                                              // 0x30(0x8)
	bool                                                         bIsEnabled;                                        // 0x38(0x1)
	char                                                         pad0x3_I2J6A[0x3];                                 // 0x39(0x3)
	struct FText                                                 ToolTipText;                                       // 0x50(0x38)
	class Widget*                                                ToolTipWidget;                                     // 0x98(0x8)
	byte                                                         Visiblity;                                         // 0xb0(0x1)
	byte                                                         Visibility;                                        // 0xb1(0x1)
	char                                                         pad0x2_YRXXB[0x2];                                 // 0xb2(0x2)
	bool                                                         bOverride_Cursor;                                  // 0xc4(0x1)
	char                                                         pad0x3_SDD9P[0x3];                                 // 0xc5(0x3)
	byte                                                         Cursor;                                            // 0xc8(0x1)
	bool                                                         bIsVolatile;                                       // 0xc9(0x1)
	char                                                         pad0x2_EVMH7[0x2];                                 // 0xca(0x2)
	struct WidgetTransform                                       RenderTransform;                                   // 0xcc(0x1c)
	struct Vector2D                                              RenderTransformPivot;                              // 0xe8(0x8)
	class WidgetNavigation*                                      Navigation;                                        // 0xf0(0x8)
	char                                                         pad0x30_GBJPX[0x30];                               // 0xf8(0x30)
	TArray<class PropertyBinding*>                               NativeBindings;                                    // 0x128(0x10)
};


// Size 0xf8 (Full Size[0x230] - InheritedSize[0x138]
class UserWidget: public Widget
{
public:
	char                                                         pad0x8_69YJG[0x8];                                 // 0x138(0x8)
	struct LinearColor                                           ColorAndOpacity;                                   // 0x140(0x10)
	struct SlateColor                                            ForegroundColor;                                   // 0x160(0x30)
	bool                                                         bSupportsKeyboardFocus;                            // 0x1a0(0x1)
	char                                                         pad0x7_UO2WL[0x7];                                 // 0x1a1(0x7)
	class WidgetTree*                                            WidgetTree;                                        // 0x1a8(0x8)
	TArray<class UMGSequencePlayer*>                             ActiveSequencePlayers;                             // 0x1b0(0x10)
	TArray<class UMGSequencePlayer*>                             StoppedSequencePlayers;                            // 0x1c0(0x10)
	TArray<struct NamedSlotBinding>                              NamedSlotBindings;                                 // 0x1d0(0x10)
	char                                                         pad0x50_TU993[0x50];                               // 0x1e0(0x50)
};


// Size 0x5a0 (Full Size[0x5c8] - InheritedSize[0x28]
class UMGSequencePlayer: public Object
{
public:
	char                                                         pad0x368_OX1JH[0x368];                             // 0x28(0x368)
	class WidgetAnimation*                                       Animation;                                         // 0x390(0x8)
	char                                                         pad0x230_TEKZ7[0x230];                             // 0x398(0x230)
};


// Size 0x10 (Full Size[0x38] - InheritedSize[0x28]
class PanelSlot: public Visual
{
public:
	class PanelWidget*                                           Parent;                                            // 0x28(0x8)
	class Widget*                                                Content;                                           // 0x30(0x8)
};


// Size 0x30 (Full Size[0x68] - InheritedSize[0x38]
class BorderSlot: public PanelSlot
{
public:
	struct Margin                                                Padding;                                           // 0x38(0x10)
	byte                                                         HorizontalAlignment;                               // 0x48(0x1)
	byte                                                         VerticalAlignment;                                 // 0x49(0x1)
	char                                                         pad0x1e_33HL3[0x1e];                               // 0x4a(0x1e)
};


// Size 0x30 (Full Size[0x68] - InheritedSize[0x38]
class ButtonSlot: public PanelSlot
{
public:
	struct Margin                                                Padding;                                           // 0x38(0x10)
	byte                                                         HorizontalAlignment;                               // 0x48(0x1)
	byte                                                         VerticalAlignment;                                 // 0x49(0x1)
	char                                                         pad0x1e_IYVB2[0x1e];                               // 0x4a(0x1e)
};


// Size 0x38 (Full Size[0x70] - InheritedSize[0x38]
class CanvasPanelSlot: public PanelSlot
{
public:
	struct AnchorData                                            LayoutData;                                        // 0x38(0x28)
	bool                                                         bAutoSize;                                         // 0x60(0x1)
	char                                                         pad0x3_0TTCL[0x3];                                 // 0x61(0x3)
	int                                                          ZOrder;                                            // 0x64(0x4)
	char                                                         pad0x8_6G29I[0x8];                                 // 0x68(0x8)
};


// Size 0x28 (Full Size[0x60] - InheritedSize[0x38]
class GridSlot: public PanelSlot
{
public:
	byte                                                         HorizontalAlignment;                               // 0x38(0x1)
	byte                                                         VerticalAlignment;                                 // 0x39(0x1)
	char                                                         pad0x2_Y16L2[0x2];                                 // 0x3a(0x2)
	int                                                          Row;                                               // 0x3c(0x4)
	int                                                          RowSpan;                                           // 0x40(0x4)
	int                                                          Column;                                            // 0x44(0x4)
	int                                                          ColumnSpan;                                        // 0x48(0x4)
	int                                                          Layer;                                             // 0x4c(0x4)
	struct Vector2D                                              Nudge;                                             // 0x50(0x8)
	char                                                         pad0x8_J2LPH[0x8];                                 // 0x58(0x8)
};


// Size 0x28 (Full Size[0x60] - InheritedSize[0x38]
class HorizontalBoxSlot: public PanelSlot
{
public:
	struct Margin                                                Padding;                                           // 0x38(0x10)
	struct SlateChildSize                                        Size;                                              // 0x48(0x8)
	byte                                                         HorizontalAlignment;                               // 0x50(0x1)
	byte                                                         VerticalAlignment;                                 // 0x51(0x1)
	char                                                         pad0xe_K2IXF[0xe];                                 // 0x52(0xe)
};


// Size 0x20 (Full Size[0x58] - InheritedSize[0x38]
class OverlaySlot: public PanelSlot
{
public:
	struct Margin                                                Padding;                                           // 0x38(0x10)
	byte                                                         HorizontalAlignment;                               // 0x48(0x1)
	byte                                                         VerticalAlignment;                                 // 0x49(0x1)
	char                                                         pad0xe_XL0PW[0xe];                                 // 0x4a(0xe)
};


// Size 0x18 (Full Size[0x50] - InheritedSize[0x38]
class SafeZoneSlot: public PanelSlot
{
public:
	bool                                                         bIsTitleSafe;                                      // 0x38(0x1)
	byte                                                         HAlign;                                            // 0x39(0x1)
	byte                                                         VAlign;                                            // 0x3a(0x1)
	char                                                         pad0x1_NWFRK[0x1];                                 // 0x3b(0x1)
	struct Margin                                                Padding;                                           // 0x3c(0x10)
	char                                                         pad0x4_OXH5P[0x4];                                 // 0x4c(0x4)
};


// Size 0x30 (Full Size[0x68] - InheritedSize[0x38]
class ScaleBoxSlot: public PanelSlot
{
public:
	struct Margin                                                Padding;                                           // 0x38(0x10)
	byte                                                         HorizontalAlignment;                               // 0x48(0x1)
	byte                                                         VerticalAlignment;                                 // 0x49(0x1)
	char                                                         pad0x1e_7NMCZ[0x1e];                               // 0x4a(0x1e)
};


// Size 0x20 (Full Size[0x58] - InheritedSize[0x38]
class ScrollBoxSlot: public PanelSlot
{
public:
	struct Margin                                                Padding;                                           // 0x38(0x10)
	byte                                                         HorizontalAlignment;                               // 0x48(0x1)
	char                                                         pad0xf_PWL5E[0xf];                                 // 0x49(0xf)
};


// Size 0x30 (Full Size[0x68] - InheritedSize[0x38]
class SizeBoxSlot: public PanelSlot
{
public:
	struct Margin                                                Padding;                                           // 0x38(0x10)
	byte                                                         HorizontalAlignment;                               // 0x48(0x1)
	byte                                                         VerticalAlignment;                                 // 0x49(0x1)
	char                                                         pad0x1e_4J5UM[0x1e];                               // 0x4a(0x1e)
};


// Size 0x18 (Full Size[0x50] - InheritedSize[0x38]
class UniformGridSlot: public PanelSlot
{
public:
	byte                                                         HorizontalAlignment;                               // 0x38(0x1)
	byte                                                         VerticalAlignment;                                 // 0x39(0x1)
	char                                                         pad0x2_URMAH[0x2];                                 // 0x3a(0x2)
	int                                                          Row;                                               // 0x3c(0x4)
	int                                                          Column;                                            // 0x40(0x4)
	char                                                         pad0xc_UO7QP[0xc];                                 // 0x44(0xc)
};


// Size 0x28 (Full Size[0x60] - InheritedSize[0x38]
class VerticalBoxSlot: public PanelSlot
{
public:
	struct Margin                                                Padding;                                           // 0x38(0x10)
	struct SlateChildSize                                        Size;                                              // 0x48(0x8)
	byte                                                         HorizontalAlignment;                               // 0x50(0x1)
	byte                                                         VerticalAlignment;                                 // 0x51(0x1)
	char                                                         pad0xe_BICD5[0xe];                                 // 0x52(0xe)
};


// Size 0x20 (Full Size[0x58] - InheritedSize[0x38]
class WidgetSwitcherSlot: public PanelSlot
{
public:
	struct Margin                                                Padding;                                           // 0x38(0x10)
	byte                                                         HorizontalAlignment;                               // 0x48(0x1)
	byte                                                         VerticalAlignment;                                 // 0x49(0x1)
	char                                                         pad0xe_NR01I[0xe];                                 // 0x4a(0xe)
};


// Size 0x28 (Full Size[0x60] - InheritedSize[0x38]
class WrapBoxSlot: public PanelSlot
{
public:
	struct Margin                                                Padding;                                           // 0x38(0x10)
	bool                                                         bFillEmptySpace;                                   // 0x48(0x1)
	char                                                         pad0x3_SUYSP[0x3];                                 // 0x49(0x3)
	float                                                        FillSpanWhenLessThan;                              // 0x4c(0x4)
	byte                                                         HorizontalAlignment;                               // 0x50(0x1)
	byte                                                         VerticalAlignment;                                 // 0x51(0x1)
	char                                                         pad0xe_NXRU0[0xe];                                 // 0x52(0xe)
};


// Size 0xc0 (Full Size[0x1f8] - InheritedSize[0x138]
class CircularThrobber: public Widget
{
public:
	int                                                          NumberOfPieces;                                    // 0x138(0x4)
	float                                                        Period;                                            // 0x13c(0x4)
	float                                                        Radius;                                            // 0x140(0x4)
	char                                                         pad0x4_LIR00[0x4];                                 // 0x144(0x4)
	class SlateBrushAsset*                                       PieceImage;                                        // 0x148(0x8)
	struct SlateBrush                                            Image;                                             // 0x150(0x90)
	char                                                         pad0x18_H5YXA[0x18];                               // 0x1e0(0x18)
};


// Size 0x38 (Full Size[0x170] - InheritedSize[0x138]
class ComboBox: public Widget
{
public:
	TArray<class Object*>                                        Items;                                             // 0x138(0x10)
	char                                                         pad0x28_MXXU4[0x28];                               // 0x148(0x28)
};


// Size 0x4e8 (Full Size[0x620] - InheritedSize[0x138]
class ComboBoxString: public Widget
{
public:
	TArray<Str DefaultOptions>                                   DefaultOptions;                                    // 0x138(0x10)
	struct FString                                               SelectedOption;                                    // 0x148(0x10)
	struct ComboBoxStyle                                         WidgetStyle;                                       // 0x158(0x428)
	struct Margin                                                ContentPadding;                                    // 0x580(0x10)
	float                                                        MaxListHeight;                                     // 0x590(0x4)
	bool                                                         HasDownArrow;                                      // 0x594(0x1)
	char                                                         pad0x3_NV3HP[0x3];                                 // 0x595(0x3)
	char                                                         pad0x88_CM4NT[0x88];                               // 0x598(0x88)
};


// Size 0x390 (Full Size[0x4c8] - InheritedSize[0x138]
class EditableText: public Widget
{
public:
	struct FText                                                 Text;                                              // 0x138(0x38)
	struct FText                                                 HintText;                                          // 0x180(0x38)
	struct EditableTextStyle                                     WidgetStyle;                                       // 0x1c8(0x228)
	class SlateWidgetStyleAsset*                                 Style;                                             // 0x3f0(0x8)
	class SlateBrushAsset*                                       BackgroundImageSelected;                           // 0x3f8(0x8)
	class SlateBrushAsset*                                       BackgroundImageComposing;                          // 0x400(0x8)
	class SlateBrushAsset*                                       CaretImage;                                        // 0x408(0x8)
	struct SlateFontInfo                                         Font;                                              // 0x410(0x40)
	struct SlateColor                                            ColorAndOpacity;                                   // 0x450(0x30)
	bool                                                         IsReadOnly;                                        // 0x480(0x1)
	bool                                                         IsPassword;                                        // 0x481(0x1)
	char                                                         pad0x2_U95S7[0x2];                                 // 0x482(0x2)
	float                                                        MinimumDesiredWidth;                               // 0x484(0x4)
	bool                                                         IsCaretMovedWhenGainFocus;                         // 0x488(0x1)
	bool                                                         SelectAllTextWhenFocused;                          // 0x489(0x1)
	bool                                                         RevertTextOnEscape;                                // 0x48a(0x1)
	bool                                                         ClearKeyboardFocusOnCommit;                        // 0x48b(0x1)
	bool                                                         SelectAllTextOnCommit;                             // 0x48c(0x1)
	char                                                         pad0x3_E0EUG[0x3];                                 // 0x48d(0x3)
	char                                                         pad0x38_CZRK0[0x38];                               // 0x490(0x38)
};


// Size 0x9c0 (Full Size[0xaf8] - InheritedSize[0x138]
class EditableTextBox: public Widget
{
public:
	struct FText                                                 Text;                                              // 0x138(0x38)
	struct EditableTextBoxStyle                                  WidgetStyle;                                       // 0x180(0x860)
	class SlateWidgetStyleAsset*                                 Style;                                             // 0x9e0(0x8)
	struct FText                                                 HintText;                                          // 0x9e8(0x38)
	struct SlateFontInfo                                         Font;                                              // 0xa30(0x40)
	struct LinearColor                                           ForegroundColor;                                   // 0xa70(0x10)
	struct LinearColor                                           BackgroundColor;                                   // 0xa80(0x10)
	struct LinearColor                                           ReadOnlyForegroundColor;                           // 0xa90(0x10)
	bool                                                         IsReadOnly;                                        // 0xaa0(0x1)
	bool                                                         IsPassword;                                        // 0xaa1(0x1)
	char                                                         pad0x2_74CZI[0x2];                                 // 0xaa2(0x2)
	float                                                        MinimumDesiredWidth;                               // 0xaa4(0x4)
	struct Margin                                                Padding;                                           // 0xaa8(0x10)
	bool                                                         IsCaretMovedWhenGainFocus;                         // 0xab8(0x1)
	bool                                                         SelectAllTextWhenFocused;                          // 0xab9(0x1)
	bool                                                         RevertTextOnEscape;                                // 0xaba(0x1)
	bool                                                         ClearKeyboardFocusOnCommit;                        // 0xabb(0x1)
	bool                                                         SelectAllTextOnCommit;                             // 0xabc(0x1)
	char                                                         pad0x3_CR0XO[0x3];                                 // 0xabd(0x3)
	char                                                         pad0x38_DNEA5[0x38];                               // 0xac0(0x38)
};


// Size 0x58 (Full Size[0x190] - InheritedSize[0x138]
class ExpandableArea: public Widget
{
public:
	char                                                         pad0x8_5XY2B[0x8];                                 // 0x138(0x8)
	bool                                                         bIsExpanded;                                       // 0x140(0x1)
	char                                                         pad0x3_Z5LHX[0x3];                                 // 0x141(0x3)
	float                                                        MaxHeight;                                         // 0x144(0x4)
	struct Margin                                                AreaPadding;                                       // 0x148(0x10)
	class Widget*                                                HeaderContent;                                     // 0x168(0x8)
	class Widget*                                                BodyContent;                                       // 0x170(0x8)
	char                                                         pad0x18_OJXLJ[0x18];                               // 0x178(0x18)
};


// Size 0xf0 (Full Size[0x228] - InheritedSize[0x138]
class Image: public Widget
{
public:
	class SlateBrushAsset*                                       Image;                                             // 0x138(0x8)
	struct SlateBrush                                            Brush;                                             // 0x140(0x90)
	struct LinearColor                                           ColorAndOpacity;                                   // 0x1e0(0x10)
	char                                                         pad0x38_YP041[0x38];                               // 0x1f0(0x38)
};


// Size 0x218 (Full Size[0x350] - InheritedSize[0x138]
class MultiLineEditableText: public Widget
{
public:
	struct FText                                                 Text;                                              // 0x138(0x38)
	struct TextBlockStyle                                        WidgetStyle;                                       // 0x170(0x160)
	byte                                                         Justification;                                     // 0x2d0(0x1)
	bool                                                         bAutoWrapText;                                     // 0x2d1(0x1)
	char                                                         pad0x2_XSOKR[0x2];                                 // 0x2d2(0x2)
	float                                                        WrapTextAt;                                        // 0x2d4(0x4)
	struct SlateFontInfo                                         Font;                                              // 0x2d8(0x40)
	char                                                         pad0x38_DWQRT[0x38];                               // 0x318(0x38)
};


// Size 0xab0 (Full Size[0xbe8] - InheritedSize[0x138]
class MultiLineEditableTextBox: public Widget
{
public:
	struct FText                                                 Text;                                              // 0x138(0x38)
	struct EditableTextBoxStyle                                  WidgetStyle;                                       // 0x170(0x860)
	struct TextBlockStyle                                        TextStyle;                                         // 0x9d0(0x160)
	class SlateWidgetStyleAsset*                                 Style;                                             // 0xb30(0x8)
	byte                                                         Justification;                                     // 0xb38(0x1)
	bool                                                         bAutoWrapText;                                     // 0xb39(0x1)
	char                                                         pad0x2_RX214[0x2];                                 // 0xb3a(0x2)
	float                                                        WrapTextAt;                                        // 0xb3c(0x4)
	struct SlateFontInfo                                         Font;                                              // 0xb40(0x40)
	struct LinearColor                                           ForegroundColor;                                   // 0xb80(0x10)
	struct LinearColor                                           BackgroundColor;                                   // 0xb90(0x10)
	struct LinearColor                                           ReadOnlyForegroundColor;                           // 0xba0(0x10)
	char                                                         pad0x38_9BW82[0x38];                               // 0xbb0(0x38)
};


// Size 0x18 (Full Size[0x150] - InheritedSize[0x138]
class NativeWidgetHost: public Widget
{
public:
	char                                                         pad0x18_CLD11[0x18];                               // 0x138(0x18)
};


// Size 0x18 (Full Size[0x150] - InheritedSize[0x138]
class PanelWidget: public Widget
{
public:
	TArray<class PanelSlot*>                                     Slots;                                             // 0x138(0x10)
	char                                                         pad0x8_HG84E[0x8];                                 // 0x148(0x8)
};


// Size 0x18 (Full Size[0x168] - InheritedSize[0x150]
class CanvasPanel: public PanelWidget
{
public:
	char                                                         pad0x18_XCZOJ[0x18];                               // 0x150(0x18)
};


// Size 0x0 (Full Size[0x150] - InheritedSize[0x150]
class ContentWidget: public PanelWidget
{
public:
};


// Size 0x160 (Full Size[0x2b0] - InheritedSize[0x150]
class Border: public ContentWidget
{
public:
	struct LinearColor                                           ContentColorAndOpacity;                            // 0x150(0x10)
	struct Margin                                                Padding;                                           // 0x170(0x10)
	byte                                                         HorizontalAlignment;                               // 0x180(0x1)
	byte                                                         VerticalAlignment;                                 // 0x181(0x1)
	char                                                         pad0x6_RBKN7[0x6];                                 // 0x182(0x6)
	struct SlateBrush                                            Background;                                        // 0x188(0x90)
	struct LinearColor                                           BrushColor;                                        // 0x228(0x10)
	bool                                                         bShowEffectWhenDisabled;                           // 0x248(0x1)
	char                                                         pad0x3_AGI8A[0x3];                                 // 0x249(0x3)
	class SlateBrushAsset*                                       Brush;                                             // 0x2a8(0x8)
};


// Size 0x320 (Full Size[0x470] - InheritedSize[0x150]
class Button: public ContentWidget
{
public:
	class SlateWidgetStyleAsset*                                 Style;                                             // 0x150(0x8)
	struct ButtonStyle                                           WidgetStyle;                                       // 0x158(0x2a8)
	struct LinearColor                                           ColorAndOpacity;                                   // 0x400(0x10)
	struct LinearColor                                           BackgroundColor;                                   // 0x410(0x10)
	byte                                                         ClickMethod;                                       // 0x420(0x1)
	byte                                                         TouchMethod;                                       // 0x421(0x1)
	bool                                                         IsFocusable;                                       // 0x422(0x1)
	char                                                         pad0x5_UYMHF[0x5];                                 // 0x423(0x5)
	char                                                         pad0x48_CU1CI[0x48];                               // 0x428(0x48)
};


// Size 0x6c8 (Full Size[0x818] - InheritedSize[0x150]
class CheckBox: public ContentWidget
{
public:
	byte                                                         CheckedState;                                      // 0x150(0x1)
	char                                                         pad0x3_QV21C[0x3];                                 // 0x151(0x3)
	struct CheckBoxStyle                                         WidgetStyle;                                       // 0x168(0x5f0)
	class SlateWidgetStyleAsset*                                 Style;                                             // 0x758(0x8)
	class SlateBrushAsset*                                       UncheckedImage;                                    // 0x760(0x8)
	class SlateBrushAsset*                                       UncheckedHoveredImage;                             // 0x768(0x8)
	class SlateBrushAsset*                                       UncheckedPressedImage;                             // 0x770(0x8)
	class SlateBrushAsset*                                       CheckedImage;                                      // 0x778(0x8)
	class SlateBrushAsset*                                       CheckedHoveredImage;                               // 0x780(0x8)
	class SlateBrushAsset*                                       CheckedPressedImage;                               // 0x788(0x8)
	class SlateBrushAsset*                                       UndeterminedImage;                                 // 0x790(0x8)
	class SlateBrushAsset*                                       UndeterminedHoveredImage;                          // 0x798(0x8)
	class SlateBrushAsset*                                       UndeterminedPressedImage;                          // 0x7a0(0x8)
	byte                                                         HorizontalAlignment;                               // 0x7a8(0x1)
	char                                                         pad0x3_3S8R3[0x3];                                 // 0x7a9(0x3)
	struct Margin                                                Padding;                                           // 0x7ac(0x10)
	char                                                         pad0x4_IH7CB[0x4];                                 // 0x7bc(0x4)
	struct SlateColor                                            BorderBackgroundColor;                             // 0x7c0(0x30)
	char                                                         pad0x28_Z592U[0x28];                               // 0x7f0(0x28)
};


// Size 0x20 (Full Size[0x170] - InheritedSize[0x150]
class InvalidationBox: public ContentWidget
{
public:
	bool                                                         CacheRelativeTransforms;                           // 0x150(0x1)
	char                                                         pad0x1f_87Z1C[0x1f];                               // 0x151(0x1f)
};


// Size 0x48 (Full Size[0x198] - InheritedSize[0x150]
class MenuAnchor: public ContentWidget
{
public:
	class UClass*                                                MenuClass;                                         // 0x150(0x8)
	byte                                                         Placement;                                         // 0x168(0x1)
	char                                                         pad0x7_AV0DH[0x7];                                 // 0x169(0x7)
	char                                                         pad0x28_7QIVE[0x28];                               // 0x170(0x28)
};


// Size 0x18 (Full Size[0x168] - InheritedSize[0x150]
class NamedSlot: public ContentWidget
{
public:
	char                                                         pad0x18_28ZZX[0x18];                               // 0x150(0x18)
};


// Size 0x18 (Full Size[0x168] - InheritedSize[0x150]
class SafeZone: public ContentWidget
{
public:
	char                                                         pad0x18_KO2JP[0x18];                               // 0x150(0x18)
};


// Size 0x20 (Full Size[0x170] - InheritedSize[0x150]
class ScaleBox: public ContentWidget
{
public:
	byte                                                         StretchDirection;                                  // 0x150(0x1)
	byte                                                         Stretch;                                           // 0x151(0x1)
	char                                                         pad0x2_JVM71[0x2];                                 // 0x152(0x2)
	float                                                        UserSpecifiedScale;                                // 0x154(0x4)
	char                                                         pad0x18_E6IMO[0x18];                               // 0x158(0x18)
};


// Size 0x38 (Full Size[0x188] - InheritedSize[0x150]
class SizeBox: public ContentWidget
{
public:
	bool                                                         bOverride_WidthOverride;                           // 0x150(0x1)
	bool                                                         bOverride_HeightOverride;                          // 0x150(0x1)
	bool                                                         bOverride_MinDesiredWidth;                         // 0x150(0x1)
	bool                                                         bOverride_MinDesiredHeight;                        // 0x150(0x1)
	bool                                                         bOverride_MaxDesiredWidth;                         // 0x150(0x1)
	bool                                                         bOverride_MaxDesiredHeight;                        // 0x150(0x1)
	char                                                         pad0x3_UHYXV[0x3];                                 // 0x151(0x3)
	float                                                        WidthOverride;                                     // 0x154(0x4)
	float                                                        HeightOverride;                                    // 0x158(0x4)
	float                                                        MinDesiredWidth;                                   // 0x15c(0x4)
	float                                                        MinDesiredHeight;                                  // 0x160(0x4)
	float                                                        MaxDesiredWidth;                                   // 0x164(0x4)
	float                                                        MaxDesiredHeight;                                  // 0x168(0x4)
	char                                                         pad0x1c_K9FMN[0x1c];                               // 0x16c(0x1c)
};


// Size 0x40 (Full Size[0x190] - InheritedSize[0x150]
class Viewport: public ContentWidget
{
public:
	struct LinearColor                                           BackgroundColor;                                   // 0x150(0x10)
	char                                                         pad0x30_N5ECF[0x30];                               // 0x160(0x30)
};


// Size 0x38 (Full Size[0x188] - InheritedSize[0x150]
class GridPanel: public PanelWidget
{
public:
	TArray<Float ColumnFill>                                     ColumnFill;                                        // 0x150(0x10)
	TArray<Float RowFill>                                        RowFill;                                           // 0x160(0x10)
	char                                                         pad0x18_FK8XQ[0x18];                               // 0x170(0x18)
};


// Size 0x18 (Full Size[0x168] - InheritedSize[0x150]
class HorizontalBox: public PanelWidget
{
public:
	char                                                         pad0x18_T0OWO[0x18];                               // 0x150(0x18)
};


// Size 0x18 (Full Size[0x168] - InheritedSize[0x150]
class Overlay: public PanelWidget
{
public:
	char                                                         pad0x18_4MAD2[0x18];                               // 0x150(0x18)
};


// Size 0x7a0 (Full Size[0x8f0] - InheritedSize[0x150]
class ScrollBox: public PanelWidget
{
public:
	struct ScrollBoxStyle                                        WidgetStyle;                                       // 0x150(0x248)
	struct ScrollBarStyle                                        WidgetBarStyle;                                    // 0x398(0x518)
	class SlateWidgetStyleAsset*                                 Style;                                             // 0x8b0(0x8)
	class SlateWidgetStyleAsset*                                 BarStyle;                                          // 0x8b8(0x8)
	byte                                                         Orientation;                                       // 0x8c0(0x1)
	byte                                                         ScrollBarVisibility;                               // 0x8c1(0x1)
	byte                                                         ConsumeMouseWheel;                                 // 0x8c2(0x1)
	char                                                         pad0x1_GOMPO[0x1];                                 // 0x8c3(0x1)
	struct Vector2D                                              ScrollbarThickness;                                // 0x8c4(0x8)
	bool                                                         AlwaysShowScrollbar;                               // 0x8cc(0x1)
	char                                                         pad0x23_U0LS0[0x23];                               // 0x8cd(0x23)
};


// Size 0x30 (Full Size[0x180] - InheritedSize[0x150]
class UniformGridPanel: public PanelWidget
{
public:
	struct Margin                                                SlotPadding;                                       // 0x150(0x10)
	float                                                        MinDesiredSlotWidth;                               // 0x160(0x4)
	float                                                        MinDesiredSlotHeight;                              // 0x164(0x4)
	char                                                         pad0x18_X2J16[0x18];                               // 0x168(0x18)
};


// Size 0x18 (Full Size[0x168] - InheritedSize[0x150]
class VerticalBox: public PanelWidget
{
public:
	char                                                         pad0x18_7MZT4[0x18];                               // 0x150(0x18)
};


// Size 0x20 (Full Size[0x170] - InheritedSize[0x150]
class WidgetSwitcher: public PanelWidget
{
public:
	int                                                          ActiveWidgetIndex;                                 // 0x150(0x4)
	char                                                         pad0x1c_EMYIB[0x1c];                               // 0x154(0x1c)
};


// Size 0x20 (Full Size[0x170] - InheritedSize[0x150]
class WrapBox: public PanelWidget
{
public:
	struct Vector2D                                              InnerSlotPadding;                                  // 0x150(0x8)
	char                                                         pad0x18_LA45W[0x18];                               // 0x158(0x18)
};


// Size 0x228 (Full Size[0x360] - InheritedSize[0x138]
class ProgressBar: public Widget
{
public:
	struct ProgressBarStyle                                      WidgetStyle;                                       // 0x138(0x1b8)
	class SlateWidgetStyleAsset*                                 Style;                                             // 0x2f0(0x8)
	class SlateBrushAsset*                                       BackgroundImage;                                   // 0x2f8(0x8)
	class SlateBrushAsset*                                       FillImage;                                         // 0x300(0x8)
	class SlateBrushAsset*                                       MarqueeImage;                                      // 0x308(0x8)
	float                                                        Percent;                                           // 0x310(0x4)
	byte                                                         BarFillType;                                       // 0x314(0x1)
	bool                                                         bIsMarquee;                                        // 0x315(0x1)
	char                                                         pad0x2_7JI5Q[0x2];                                 // 0x316(0x2)
	struct LinearColor                                           FillColorAndOpacity;                               // 0x328(0x10)
	char                                                         pad0x28_DLG4H[0x28];                               // 0x338(0x28)
};


// Size 0x240 (Full Size[0x378] - InheritedSize[0x138]
class RichTextBlock: public Widget
{
public:
	struct FText                                                 Text;                                              // 0x138(0x38)
	struct SlateFontInfo                                         Font;                                              // 0x180(0x40)
	struct LinearColor                                           Color;                                             // 0x1c0(0x10)
	byte                                                         Justification;                                     // 0x1d0(0x1)
	bool                                                         AutoWrapText;                                      // 0x1d1(0x1)
	char                                                         pad0x2_CVH2M[0x2];                                 // 0x1d2(0x2)
	float                                                        WrapTextAt;                                        // 0x1d4(0x4)
	struct Margin                                                Margin;                                            // 0x1d8(0x10)
	float                                                        LineHeightPercentage;                              // 0x1e8(0x4)
	char                                                         pad0x4_0AWF3[0x4];                                 // 0x1ec(0x4)
	TArray<class RichTextBlockDecorator*>                        Decorators;                                        // 0x1f0(0x10)
	char                                                         pad0x178_D9BNQ[0x178];                             // 0x200(0x178)
};


// Size 0x548 (Full Size[0x680] - InheritedSize[0x138]
class ScrollBar: public Widget
{
public:
	struct ScrollBarStyle                                        WidgetStyle;                                       // 0x138(0x518)
	class SlateWidgetStyleAsset*                                 Style;                                             // 0x650(0x8)
	bool                                                         bAlwaysShowScrollbar;                              // 0x658(0x1)
	byte                                                         Orientation;                                       // 0x659(0x1)
	char                                                         pad0x2_4BYUG[0x2];                                 // 0x65a(0x2)
	struct Vector2D                                              Thickness;                                         // 0x65c(0x8)
	char                                                         pad0x1c_A2W0K[0x1c];                               // 0x664(0x1c)
};


// Size 0x2d0 (Full Size[0x408] - InheritedSize[0x138]
class Slider: public Widget
{
public:
	float                                                        Value;                                             // 0x138(0x4)
	struct SliderStyle                                           WidgetStyle;                                       // 0x150(0x248)
	byte                                                         Orientation;                                       // 0x398(0x1)
	char                                                         pad0x3_P324I[0x3];                                 // 0x399(0x3)
	struct LinearColor                                           SliderBarColor;                                    // 0x39c(0x10)
	struct LinearColor                                           SliderHandleColor;                                 // 0x3ac(0x10)
	bool                                                         IndentHandle;                                      // 0x3bc(0x1)
	bool                                                         Locked;                                            // 0x3bd(0x1)
	char                                                         pad0x2_FBYZT[0x2];                                 // 0x3be(0x2)
	char                                                         pad0x48_11VS1[0x48];                               // 0x3c0(0x48)
};


// Size 0x20 (Full Size[0x158] - InheritedSize[0x138]
class Spacer: public Widget
{
public:
	struct Vector2D                                              Size;                                              // 0x138(0x8)
	char                                                         pad0x18_HWGYQ[0x18];                               // 0x140(0x18)
};


// Size 0x428 (Full Size[0x560] - InheritedSize[0x138]
class SpinBox: public Widget
{
public:
	float                                                        Value;                                             // 0x138(0x4)
	struct SpinBoxStyle                                          WidgetStyle;                                       // 0x150(0x318)
	class SlateWidgetStyleAsset*                                 Style;                                             // 0x468(0x8)
	float                                                        Delta;                                             // 0x470(0x4)
	float                                                        SliderExponent;                                    // 0x474(0x4)
	struct SlateFontInfo                                         Font;                                              // 0x478(0x40)
	float                                                        MinDesiredWidth;                                   // 0x4b8(0x4)
	bool                                                         ClearKeyboardFocusOnCommit;                        // 0x4bc(0x1)
	bool                                                         SelectAllTextOnCommit;                             // 0x4bd(0x1)
	char                                                         pad0x2_ZT9QS[0x2];                                 // 0x4be(0x2)
	struct SlateColor                                            ForegroundColor;                                   // 0x4c0(0x30)
	bool                                                         bOverride_MinValue;                                // 0x530(0x1)
	bool                                                         bOverride_MaxValue;                                // 0x530(0x1)
	bool                                                         bOverride_MinSliderValue;                          // 0x530(0x1)
	bool                                                         bOverride_MaxSliderValue;                          // 0x530(0x1)
	char                                                         pad0x3_R32WO[0x3];                                 // 0x531(0x3)
	float                                                        MinValue;                                          // 0x534(0x4)
	float                                                        MaxValue;                                          // 0x538(0x4)
	float                                                        MinSliderValue;                                    // 0x53c(0x4)
	float                                                        MaxSliderValue;                                    // 0x540(0x4)
	char                                                         pad0x1c_BJXE5[0x1c];                               // 0x544(0x1c)
};


// Size 0x0 (Full Size[0x138] - InheritedSize[0x138]
class TableViewBase: public Widget
{
public:
};


// Size 0x48 (Full Size[0x180] - InheritedSize[0x138]
class ListView: public TableViewBase
{
public:
	float                                                        ItemHeight;                                        // 0x138(0x4)
	char                                                         pad0x4_Z3R5Y[0x4];                                 // 0x13c(0x4)
	TArray<class Object*>                                        Items;                                             // 0x140(0x10)
	byte                                                         SelectionMode;                                     // 0x150(0x1)
	char                                                         pad0x3_F9N3K[0x3];                                 // 0x151(0x3)
	char                                                         pad0x2c_IMTQS[0x2c];                               // 0x154(0x2c)
};


// Size 0x48 (Full Size[0x180] - InheritedSize[0x138]
class TileView: public TableViewBase
{
public:
	float                                                        ItemWidth;                                         // 0x138(0x4)
	float                                                        ItemHeight;                                        // 0x13c(0x4)
	TArray<class Object*>                                        Items;                                             // 0x140(0x10)
	byte                                                         SelectionMode;                                     // 0x150(0x1)
	char                                                         pad0x3_5SRZU[0x3];                                 // 0x151(0x3)
	char                                                         pad0x2c_ELGWP[0x2c];                               // 0x154(0x2c)
};


// Size 0x130 (Full Size[0x268] - InheritedSize[0x138]
class TextBlock: public Widget
{
public:
	class SlateWidgetStyleAsset*                                 Style;                                             // 0x138(0x8)
	struct FText                                                 Text;                                              // 0x140(0x38)
	struct SlateColor                                            ColorAndOpacity;                                   // 0x188(0x30)
	struct SlateFontInfo                                         Font;                                              // 0x1c8(0x40)
	struct Vector2D                                              ShadowOffset;                                      // 0x208(0x8)
	struct LinearColor                                           ShadowColorAndOpacity;                             // 0x210(0x10)
	byte                                                         Justification;                                     // 0x230(0x1)
	bool                                                         AutoWrapText;                                      // 0x231(0x1)
	char                                                         pad0x2_COP3K[0x2];                                 // 0x232(0x2)
	float                                                        WrapTextAt;                                        // 0x234(0x4)
	float                                                        MinDesiredWidth;                                   // 0x238(0x4)
	struct Margin                                                Margin;                                            // 0x23c(0x10)
	float                                                        LineHeightPercentage;                              // 0x24c(0x4)
	char                                                         pad0x18_S5LFH[0x18];                               // 0x250(0x18)
};


// Size 0xb8 (Full Size[0x1f0] - InheritedSize[0x138]
class Throbber: public Widget
{
public:
	int                                                          NumberOfPieces;                                    // 0x138(0x4)
	bool                                                         bAnimateHorizontally;                              // 0x13c(0x1)
	bool                                                         bAnimateVertically;                                // 0x13d(0x1)
	bool                                                         bAnimateOpacity;                                   // 0x13e(0x1)
	char                                                         pad0x1_AU3BK[0x1];                                 // 0x13f(0x1)
	class SlateBrushAsset*                                       PieceImage;                                        // 0x140(0x8)
	struct SlateBrush                                            Image;                                             // 0x148(0x90)
	char                                                         pad0x18_CPUQ6[0x18];                               // 0x1d8(0x18)
};


// Size 0x38 (Full Size[0x2e0] - InheritedSize[0x2a8]
class WidgetAnimation: public MovieSceneSequence
{
public:
	char                                                         pad0x20_7LVC4[0x20];                               // 0x2a8(0x20)
	class MovieScene*                                            MovieScene;                                        // 0x2c8(0x8)
	TArray<struct WidgetAnimationBinding>                        AnimationBindings;                                 // 0x2d0(0x10)
};


// Size 0x38 (Full Size[0x260] - InheritedSize[0x228]
class WidgetBlueprintGeneratedClass: public BlueprintGeneratedClass
{
public:
	class WidgetTree*                                            WidgetTree;                                        // 0x228(0x8)
	TArray<struct DelegateRuntimeBinding>                        Bindings;                                          // 0x230(0x10)
	TArray<class WidgetAnimation*>                               Animations;                                        // 0x240(0x10)
	TArray<struct FName>                                         NamedSlots;                                        // 0x250(0x10)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class WidgetBlueprintLibrary: public BlueprintFunctionLibrary
{
public:
};


// Size 0xf0 (Full Size[0x6b0] - InheritedSize[0x5c0]
class WidgetComponent: public PrimitiveComponent
{
public:
	byte                                                         Space;                                             // 0x5b8(0x1)
	char                                                         pad0x7_FO98U[0x7];                                 // 0x5b9(0x7)
	class UClass*                                                WidgetClass;                                       // 0x5c0(0x8)
	struct IntPoint                                              DrawSize;                                          // 0x5c8(0x8)
	struct Vector2D                                              Pivot;                                             // 0x5d0(0x8)
	float                                                        MaxInteractionDistance;                            // 0x5d8(0x4)
	char                                                         pad0x4_AW5PP[0x4];                                 // 0x5dc(0x4)
	class LocalPlayer*                                           OwnerPlayer;                                       // 0x5e0(0x8)
	struct LinearColor                                           BackgroundColor;                                   // 0x5e8(0x10)
	byte                                                         BlendMode;                                         // 0x5f8(0x1)
	bool                                                         bIsOpaque;                                         // 0x5f9(0x1)
	bool                                                         bIsTwoSided;                                       // 0x5fa(0x1)
	char                                                         pad0x1_H35DW[0x1];                                 // 0x5fb(0x1)
	float                                                        ParabolaDistortion;                                // 0x5fc(0x4)
	bool                                                         TickWhenOffscreen;                                 // 0x600(0x1)
	char                                                         pad0x7_DYJKV[0x7];                                 // 0x601(0x7)
	class UserWidget*                                            Widget;                                            // 0x608(0x8)
	class BodySetup*                                             BodySetup;                                         // 0x610(0x8)
	class MaterialInterface*                                     TranslucentMaterial;                               // 0x618(0x8)
	class MaterialInterface*                                     TranslucentMaterial_OneSided;                      // 0x620(0x8)
	class MaterialInterface*                                     OpaqueMaterial;                                    // 0x628(0x8)
	class MaterialInterface*                                     OpaqueMaterial_OneSided;                           // 0x630(0x8)
	class MaterialInterface*                                     MaskedMaterial;                                    // 0x638(0x8)
	class MaterialInterface*                                     MaskedMaterial_OneSided;                           // 0x640(0x8)
	class TextureRenderTarget2D*                                 RenderTarget;                                      // 0x648(0x8)
	class MaterialInstanceDynamic*                               MaterialInstance;                                  // 0x650(0x8)
	bool                                                         bUseLegacyRotation;                                // 0x658(0x1)
	bool                                                         bAddedToScreen;                                    // 0x659(0x1)
	char                                                         pad0x56_LZ3GT[0x56];                               // 0x65a(0x56)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class WidgetLayoutLibrary: public BlueprintFunctionLibrary
{
public:
};


// Size 0x78 (Full Size[0xa0] - InheritedSize[0x28]
class WidgetNavigation: public Object
{
public:
	struct WidgetNavigationData                                  Up;                                                // 0x28(0x14)
	struct WidgetNavigationData                                  Down;                                              // 0x3c(0x14)
	struct WidgetNavigationData                                  Left;                                              // 0x50(0x14)
	struct WidgetNavigationData                                  Right;                                             // 0x64(0x14)
	struct WidgetNavigationData                                  Next;                                              // 0x78(0x14)
	struct WidgetNavigationData                                  Previous;                                          // 0x8c(0x14)
};


// Size 0x18 (Full Size[0x40] - InheritedSize[0x28]
class WidgetTree: public Object
{
public:
	class Widget*                                                RootWidget;                                        // 0x28(0x8)
	TArray<class Widget*>                                        AllWidgets;                                        // 0x30(0x10)
};


}