// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x28 (Full Size[0x50] - InheritedSize[0x28]
class WaterSlideParamsDataAsset: public DataAsset
{
public:
	Struct WaterSlideParams                                      WaterSlideParams;                                  // 0x28(0x28)
};


// Size 0x78 (Full Size[0x440] - InheritedSize[0x3c8]
class WaterSlide: public Actor
{
public:
	char                                                         pad0x8_DO5TP[0x8];                                 // 0x3c8(0x8)
	Class SplineComponent*                                       SlideSpline;                                       // 0x3d0(0x8)
	Class SceneComponent*                                        Root;                                              // 0x3d8(0x8)
	Class WaterSlideParamsDataAsset*                             WaterSlideParamsDataAsset;                         // 0x3e0(0x8)
	Class PrimitiveComponent*                                    EntranceCollisionComponent;                        // 0x3e8(0x8)
	Class WaterSlide*                                            ContinuedWaterSlideRoute;                          // 0x3f0(0x8)
	Class WaterSlide*                                            LeftWaterSlideRoute;                               // 0x3f8(0x8)
	Class WaterSlide*                                            RightWaterSlideRoute;                              // 0x400(0x8)
	bool                                                         IsEndOfSlide;                                      // 0x408(0x1)
	char                                                         pad0x3_CXI2S[0x3];                                 // 0x409(0x3)
	Struct Vector                                                EndOfSlideLaunchForce;                             // 0x40c(0xc)
	Class WaterSlideAudioParams*                                 WaterSlideAudioParams;                             // 0x418(0x8)
	char                                                         pad0x30_IPYFZ[0x30];                               // 0x41e(0x30)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class WaterSlideActionStateId: public ActionStateId
{
public:
};


// Size 0x30 (Full Size[0x58] - InheritedSize[0x28]
class WaterSlideAudioParams: public DataAsset
{
public:
	Class WwiseEvent*                                            WaterSlideStart;                                   // 0x28(0x8)
	Class WwiseEvent*                                            WaterSlideEnd;                                     // 0x30(0x8)
	Class WwiseEvent*                                            WaterSlideIsEndOneShot;                            // 0x38(0x8)
	Class WwiseEvent*                                            WaterSlideChangeForkOneShot;                       // 0x40(0x8)
	struct FName                                                 PlayerSpeedOnWaterSlideRTPC;                       // 0x48(0x8)
	float                                                        PlayerSpeedThatMapsToOne;                          // 0x50(0x4)
	float                                                        PlayerSpeedThatMapsToZero;                         // 0x54(0x4)
};


// Size 0x10 (Full Size[0x2b0] - InheritedSize[0x2a0]
class WaterSlideInputComponent: public LookAtOffsetInputComponent
{
public:
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class WaterSlidePlayerInterface: public Interface
{
public:
};


// Size 0x38 (Full Size[0x118] - InheritedSize[0xe0]
class WaterSlidePlayerComponent: public DoubleIntentComponent
{
public:
	char                                                         pad0x8_JPHNX[0x8];                                 // 0xe0(0x8)
	Class ParticleSystemComponent*                               PlayerWaterSlideSplashingVFXComponent;             // 0xe8(0x8)
	Class ParticleSystem*                                        PlayerWaterSlideSplashingVFX;                      // 0xf0(0x8)
	float                                                        SpawnLocationZOffset;                              // 0xf8(0x4)
	char                                                         pad0x14_RI51F[0x14];                               // 0xfc(0x14)
	Class WaterSlide*                                            CurrentWaterSlide;                                 // 0x110(0x8)
};


// Size 0x0 (Full Size[0x38] - InheritedSize[0x38]
class WaterSlideVeeringAnalogInputId: public AnalogInputId
{
public:
};


}