#pragma once

// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid

// Size 0xa8
struct WaterQueryData
{
public:
	float                                                        WaterHeight;                                       // 0x0(0x4)
	char                                                         pad0x4_SWGBR[0x4];                                 // 0x4(0x4)
	double                                                       QueryTime;                                         // 0x8(0x8)
	double                                                       CreationTime;                                      // 0x10(0x8)
	float                                                        ShorelineScale;                                    // 0x18(0x4)
	float                                                        FFTShorelineScale;                                 // 0x1c(0x4)
	float                                                        CarrierShorelineScale;                             // 0x20(0x4)
	float                                                        BeaufortShorelineScale;                            // 0x24(0x4)
	float                                                        OffsetScale;                                       // 0x28(0x4)
	float                                                        CarrierWavePosition;                               // 0x2c(0x4)
	float                                                        CarrierWaveDisplacement;                           // 0x30(0x4)
	float                                                        HeightComponentOffset;                             // 0x34(0x4)
	float                                                        CarrierWaveAmplitude;                              // 0x38(0x4)
	float                                                        CarrierWaveWaveLength;                             // 0x3c(0x4)
	float                                                        CarrierWavePropagation;                            // 0x40(0x4)
	struct Vector2D                                              CarrierWaveDirection;                              // 0x44(0x8)
	struct Vector2D                                              QueryLocation;                                     // 0x4c(0x8)
	struct Vector2D                                              PositionOffset;                                    // 0x54(0x8)
	int                                                          ReadIndex;                                         // 0x5c(0x4)
	int                                                          ReadIndex2;                                        // 0x60(0x4)
	char                                                         pad0x4_EJ2JX[0x4];                                 // 0x64(0x4)
	TArray<struct Vector2D>                                      CalmWaterPosition;                                 // 0x68(0x10)
	TArray<float>                                                CalmWaterRadius;                                   // 0x78(0x10)
	TArray<float>                                                CalmWaterDampeningFactor;                          // 0x88(0x10)
	TArray<float>                                                CalmWaterPercentageToStartLerp;                    // 0x98(0x10)
};


// Size 0x70
struct WaterSpout
{
public:
	struct Transform                                             SpoutLocatorTransform;                             // 0x0(0x30)
	class ParticleSystemComponent*                               SpoutParticleSystem;                               // 0x30(0x8)
	class ParticleSystemComponent*                               SplashParticleSystem;                              // 0x38(0x8)
	char                                                         pad0x30_6ML08[0x30];                               // 0x40(0x30)
};


// Size 0x90
struct BuoyancyDragSample
{
public:
	struct Vector                                                Offset;                                            // 0x0(0xc)
	struct Vector                                                Normal;                                            // 0xc(0xc)
	struct Vector                                                Tangent;                                           // 0x18(0xc)
	float                                                        Radius;                                            // 0x24(0x4)
	float                                                        DragCoefficient;                                   // 0x28(0x4)
	char                                                         Type;                                              // 0x2c(0x1)
	char                                                         pad0x63_ICTFF[0x63];                               // 0x2d(0x63)
};


// Size 0xd8
struct WaterSplashProbe
{
public:
	char                                                         pad0x8_EZ9S1[0x8];                                 // 0x0(0x8)
	struct FString                                               ProbeDebugName;                                    // 0x8(0x10)
	struct Vector                                                LocalOffset;                                       // 0x18(0xc)
	float                                                        Height;                                            // 0x24(0x4)
	float                                                        Pitch;                                             // 0x28(0x4)
	float                                                        Yaw;                                               // 0x2c(0x4)
	float                                                        Roll;                                              // 0x30(0x4)
	float                                                        RateOfChangeThreshold;                             // 0x34(0x4)
	struct Vector                                                LocalOffsetAdjustment;                             // 0x38(0xc)
	float                                                        LocalOffsetAdjustmentDuration;                     // 0x44(0x4)
	char                                                         Type;                                              // 0x48(0x1)
	char                                                         WaterHeightType;                                   // 0x49(0x1)
	char                                                         pad0x2_MFBCZ[0x2];                                 // 0x4a(0x2)
	float                                                        StaticWaterHeightValue;                            // 0x4c(0x4)
	char                                                         pad0x88_IIDJY[0x88];                               // 0x50(0x88)
};


// Size 0x10
struct AthenaWaterTimeDataTelemetryEvent
{
public:
	double                                                       NetworkTime;                                       // 0x0(0x8)
	double                                                       WaterThreadCreationTime;                           // 0x8(0x8)
};


// Size 0x1
struct EventEnteredWaterExclusionZone
{
public:
	char                                                         pad0x1_6DXGF[0x1];                                 // 0x0(0x1)
};


// Size 0x1
struct EventLeftWaterExclusionZone
{
public:
	char                                                         pad0x1_7975N[0x1];                                 // 0x0(0x1)
};


// Size 0x10
struct WaterInformation
{
public:
	class UClass*                                                WaterType;                                         // 0x0(0x8)
	bool                                                         CanSwim;                                           // 0x8(0x1)
	char                                                         pad0x7_3MY3A[0x7];                                 // 0x9(0x7)
};


// Size 0xb0
struct WaterServiceFrameDataTelemetryEvent
{
public:
	float                                                        WaterHeight;                                       // 0x0(0x4)
	char                                                         pad0x4_2BK96[0x4];                                 // 0x4(0x4)
	double                                                       CurrentTime;                                       // 0x8(0x8)
	struct Vector2D                                              QueryLocation;                                     // 0x10(0x8)
	float                                                        WaterCompHeight;                                   // 0x18(0x4)
	float                                                        WaveAmplitude;                                     // 0x1c(0x4)
	float                                                        WaveLength;                                        // 0x20(0x4)
	float                                                        PropagationSpeed;                                  // 0x24(0x4)
	float                                                        WindSpeed;                                         // 0x28(0x4)
	struct Vector2D                                              WaveDirection;                                     // 0x2c(0x8)
	struct Vector2D                                              WaveOffset;                                        // 0x34(0x8)
	struct Vector2D                                              Choppiness;                                        // 0x3c(0x8)
	struct Vector                                                Normal;                                            // 0x44(0xc)
	struct FString                                               WaterPlaneInfo;                                    // 0x50(0x10)
	int                                                          CalmWaterNumberFound;                              // 0x60(0x4)
	char                                                         pad0x4_U7FFN[0x4];                                 // 0x64(0x4)
	TArray<struct Vector2D>                                      CalmWaterPosition;                                 // 0x68(0x10)
	TArray<float>                                                CalmWaterRadius;                                   // 0x78(0x10)
	TArray<float>                                                CalmWaterDampeningFactor;                          // 0x88(0x10)
	TArray<float>                                                CalmWaterPercentageToStartLerp;                    // 0x98(0x10)
	float                                                        ShorelineScale;                                    // 0xa8(0x4)
	char                                                         pad0x4_CAE26[0x4];                                 // 0xac(0x4)
};


// Size 0x10
struct EventCurrentWaterPlaneChange
{
public:
	class BaseWaterComponent*                                    FormerWaterPlane;                                  // 0x0(0x8)
	class BaseWaterComponent*                                    NewWaterPlane;                                     // 0x8(0x8)
};


// Size 0x1c
struct FFTWaterQueryResult
{
public:
	float                                                        Height;                                            // 0x0(0x4)
	struct Vector2D                                              Choppiness;                                        // 0x4(0x8)
	struct Vector                                                Normal;                                            // 0xc(0xc)
	char                                                         WaterQueryResult;                                  // 0x18(0x1)
	char                                                         pad0x3_LZP2Z[0x3];                                 // 0x19(0x3)
};


// Size 0x18
struct BuoyancySampleMovementConfigurationEntry
{
public:
	struct Vector                                                SampleOffset;                                      // 0x0(0xc)
	char                                                         pad0x4_GMFHK[0x4];                                 // 0xc(0x4)
	class CurveFloat*                                            BuoyancyScaleCurve;                                // 0x10(0x8)
};


// Size 0x58
struct BuoyancyVolumeSample
{
public:
	struct Vector                                                Offset;                                            // 0x0(0xc)
	float                                                        Radius;                                            // 0xc(0x4)
	char                                                         Type;                                              // 0x10(0x1)
	bool                                                         bRelevantForSubmersionVolumeCalculation;           // 0x11(0x1)
	char                                                         pad0x2_7II7W[0x2];                                 // 0x12(0x2)
	float                                                        Scalar;                                            // 0x14(0x4)
	float                                                        DampingScalar;                                     // 0x18(0x4)
	char                                                         pad0x4_TRYQ4[0x4];                                 // 0x1c(0x4)
	class CurveFloat*                                            DistUnderwaterVSBuoyancyForce;                     // 0x20(0x8)
	class CurveFloat*                                            DistUnderwaterVSBuoyancyForceSecondary;            // 0x28(0x8)
	class CurveFloat*                                            DistUnderwaterVSBuoyancyForceTertiary;             // 0x30(0x8)
	class CurveFloat*                                            FakeZOffsetGeneratorCurve;                         // 0x38(0x8)
	float                                                        FakeZOffsetAmp;                                    // 0x40(0x4)
	float                                                        FakeZOffsetGeneratorTimeScale;                     // 0x44(0x4)
	char                                                         pad0x10_ZVV4J[0x10];                               // 0x48(0x10)
};


// Size 0x8
struct EventWaterHeightChanged
{
public:
	class BaseWaterComponent*                                    WaterPlaneOwner;                                   // 0x0(0x8)
};


// Size 0xa8
struct WaterQueryFrameDataTelemetryEvent
{
public:
	struct WaterQueryData                                        QueryData;                                         // 0x0(0xa8)
};


// Size 0x18
struct WaterSplashProbesContainer
{
public:
	TArray<struct WaterSplashProbe>                              Probes;                                            // 0x0(0x10)
	float                                                        ProbeSamplingTime;                                 // 0x10(0x4)
	char                                                         pad0x4_7RK20[0x4];                                 // 0x14(0x4)
};


// Size 0x38
struct BuoyancySampleMovementConfiguration
{
public:
	class CurveVector*                                           CenterOfMassOffsetCurve;                           // 0x0(0x8)
	TArray<struct BuoyancySampleMovementConfigurationEntry>      SampleMoveData;                                    // 0x8(0x10)
	float                                                        OverallBuoyancyScalar;                             // 0x18(0x4)
	char                                                         pad0x4_AM0HZ[0x4];                                 // 0x1c(0x4)
	class CurveFloat*                                            OverallBuoyancyScalarBlendCurve;                   // 0x20(0x8)
	class CurveFloat*                                            ProbeMovementBlendCurve;                           // 0x28(0x8)
	float                                                        Duration;                                          // 0x30(0x4)
	char                                                         pad0x4_R0KCE[0x4];                                 // 0x34(0x4)
};


// Size 0x128
struct SplashProbe
{
public:
	char                                                         pad0x8_41CRD[0x8];                                 // 0x0(0x8)
	struct WaterSplashProbe                                      Probe;                                             // 0x8(0xd8)
	float                                                        ProbeSamplingTime;                                 // 0xe0(0x4)
	float                                                        TimeBetweenProbeVfx;                               // 0xe4(0x4)
	class Object*                                                ParticleSystem;                                    // 0xe8(0x8)
	char                                                         UnderwaterUsage;                                   // 0xf0(0x1)
	bool                                                         SpawnAttached;                                     // 0xf1(0x1)
	bool                                                         AttachToWaterSurface;                              // 0xf2(0x1)
	char                                                         SplashAttachType;                                  // 0xf3(0x1)
	struct Vector                                                VfxSpawnOffset;                                    // 0xf4(0xc)
	bool                                                         Enabled;                                           // 0x100(0x1)
	char                                                         pad0x7_UKQG4[0x7];                                 // 0x101(0x7)
	class ParticleSystemComponent*                               CurrentlyPlayingVFX;                               // 0x108(0x8)
	char                                                         pad0x18_EZHI0[0x18];                               // 0x110(0x18)
};


// Size 0x140
struct WaterBuoyancy
{
public:
	class PrimitiveComponent*                                    PrimitiveComponent;                                // 0x0(0x8)
	float                                                        OverallBuyoancyScalar;                             // 0x8(0x4)
	float                                                        DampingPerSample;                                  // 0xc(0x4)
	float                                                        AdditionalAngularDampingWhenSubmerged;             // 0x10(0x4)
	char                                                         pad0x4_WC617[0x4];                                 // 0x14(0x4)
	TArray<struct BuoyancyVolumeSample>                          VolumeSamples;                                     // 0x18(0x10)
	TArray<struct BuoyancyDragSample>                            DragSamples;                                       // 0x28(0x10)
	class CurveFloat*                                            BuyoancySampleZSpeedVSDampeningScalar;             // 0x38(0x8)
	float                                                        QuadSubmersionTestSampleResolution;                // 0x40(0x4)
	char                                                         pad0xfc_H6LXD[0xfc];                               // 0x44(0xfc)
};


// Size 0x68
struct BuoyancySampleMovement
{
public:
	TArray<struct BuoyancySampleMovementConfiguration>           Configurations;                                    // 0x0(0x10)
	char                                                         pad0x40_R3OEN[0x40];                               // 0x10(0x40)
	class CurveFloat*                                            BuoyancyScalarCurve;                               // 0x50(0x8)
	class CurveFloat*                                            ProbeMovementCurve;                                // 0x58(0x8)
	char                                                         pad0x8_0IV3N[0x8];                                 // 0x60(0x8)
};


