#pragma once

// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid



// Size 0x14
struct RideTransitionActionStateParams
{
public:
	float                                                        Duration;                                          // 0x10(0x4)
};


// Size 0x10
struct OnPlayerChangedWaterSlideRouteActionStateEvent
{
public:
	class WwiseEvent*                                            WaterSlideChangeForkOneShot;                       // 0x8(0x8)
};


// Size 0x18
struct OnEndWaterSlideActionStateEvent
{
public:
	class WwiseEvent*                                            WaterSlideEnd;                                     // 0x8(0x8)
	class WwiseEvent*                                            WaterSlideIsEndOneShot;                            // 0x10(0x8)
};


// Size 0x48
struct ZiplineActionStateConstructionInfo
{
public:
	class SceneComponent*                                        SceneComponent;                                    // 0x30(0x8)
	char                                                         MovementDirection;                                 // 0x38(0x1)
	char                                                         InitialSwingDirection;                             // 0x39(0x1)
	double                                                       ZiplineStartSmoothedTime;                          // 0x40(0x8)
};


// Size 0x24
struct WaterSlideActionStateParams
{
public:
	float                                                        ForcedFieldOfView;                                 // 0x0(0x4)
	bool                                                         ForceStash;                                        // 0x4(0x1)
	struct                                                       LookAtOffsetParams;                                // 0x8(0x1c)
};


// Size 0x28
struct OnStartZiplineActionStateEvent
{
public:
	class WwiseEvent*                                            ZiplineStart;                                      // 0x0(0x8)
	class WwiseEvent*                                            AttachToZiplineAdditiveOneShot;                    // 0x8(0x8)
	class WwiseEvent*                                            ZiplineLoopStart;                                  // 0x10(0x8)
	class ParticleSystem*                                        ZiplineWindVFX;                                    // 0x18(0x8)
	class ParticleSystem*                                        ZiplineTrailVFX;                                   // 0x20(0x8)
};


// Size 0x58
struct RideTransitionActionStateConstructionInfo
{
public:
	class Ride*                                                  Ride;                                              // 0x30(0x8)
	char                                                         Direction;                                         // 0x38(0x1)
	float                                                        Offset;                                            // 0x3c(0x4)
};


// Size 0x38
struct WaterSlideActionStateConstructionInfo
{
public:
	class SceneComponent*                                        SceneComponent;                                    // 0x30(0x8)
};


// Size 0x1c
struct ZipLineActionStateParams
{
public:
	struct                                                       LookAtOffsetParams;                                // 0x0(0x1c)
};


// Size 0x18
struct OnEndZiplineActionStateEvent
{
public:
	class WwiseEvent*                                            ZiplineEnd;                                        // 0x0(0x8)
	class WwiseEvent*                                            ZiplineEndLoop;                                    // 0x8(0x8)
	class WwiseEvent*                                            DetachFromZiplineAdditiveOneShot;                  // 0x10(0x8)
};


// Size 0x28
struct WaterSlideParams
{
public:
	float                                                        ForwardSpeed;                                      // 0x0(0x4)
	float                                                        IncreaseForwardSpeedMultiplier;                    // 0x4(0x4)
	float                                                        DecreaseForwardSpeedMultiplier;                    // 0x8(0x4)
	float                                                        VeeringSpeed;                                      // 0xc(0x4)
	float                                                        LeftVeeringDistance;                               // 0x10(0x4)
	float                                                        RightVeeringDistance;                              // 0x14(0x4)
	struct                                                       StatToFireForRouteChange;                          // 0x18(0x4)
	class ParticleSystem*                                        PlayerSplashingVFXOverride;                        // 0x20(0x8)
};


// Size 0x10
struct OnStartWaterSlideActionStateEvent
{
public:
	class WwiseEvent*                                            WaterSlideStart;                                   // 0x0(0x8)
	class ParticleSystem*                                        WaterSlideVfxOverride;                             // 0x8(0x8)
};


// Size 0x310
struct ZiplineFeelParameters
{
public:
	float                                                        MaxSpeed;                                          // 0x0(0x4)
	float                                                        StartingSpeed;                                     // 0x4(0x4)
	float                                                        MinSpeed;                                          // 0x8(0x4)
	float                                                        AccelerationMultiplier;                            // 0xc(0x4)
	float                                                        DecelerationMultiplier;                            // 0x10(0x4)
	struct                                                       SwingAngleControlDegrees;                          // 0x18(0x170)
	struct                                                       SwingSpeedControlRPM;                              // 0x188(0x170)
	struct                                                       WindResistanceMinMaxAngleDegrees;                  // 0x2f8(0x8)
	struct                                                       FOVMinMaxSpeed;                                    // 0x300(0x8)
	struct                                                       FOVMinMaxAngleDegrees;                             // 0x308(0x8)
};


