// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x28
struct WaterSlideParams
{
public:
	float                                                        ForwardSpeed;                                      // 0x0(0x4)
	float                                                        IncreaseForwardSpeedMultiplier;                    // 0x4(0x4)
	float                                                        DecreaseForwardSpeedMultiplier;                    // 0x8(0x4)
	float                                                        VeeringSpeed;                                      // 0xc(0x4)
	float                                                        LeftVeeringDistance;                               // 0x10(0x4)
	float                                                        RightVeeringDistance;                              // 0x14(0x4)
	struct PlayerStat                                            StatToFireForRouteChange;                          // 0x18(0x4)
	char                                                         pad0x4_FINUL[0x4];                                 // 0x1c(0x4)
	class ParticleSystem*                                        PlayerSplashingVFXOverride;                        // 0x20(0x8)
};


// Size 0x310
struct ZiplineFeelParameters
{
public:
	float                                                        MaxSpeed;                                          // 0x0(0x4)
	float                                                        StartingSpeed;                                     // 0x4(0x4)
	float                                                        MinSpeed;                                          // 0x8(0x4)
	float                                                        AccelerationMultiplier;                            // 0xc(0x4)
	float                                                        DecelerationMultiplier;                            // 0x10(0x4)
	char                                                         pad0x4_T90LK[0x4];                                 // 0x14(0x4)
	struct RuntimeVectorCurve                                    SwingAngleControlDegrees;                          // 0x18(0x170)
	struct RuntimeVectorCurve                                    SwingSpeedControlRPM;                              // 0x188(0x170)
	struct Vector2D                                              WindResistanceMinMaxAngleDegrees;                  // 0x2f8(0x8)
	struct Vector2D                                              FOVMinMaxSpeed;                                    // 0x300(0x8)
	struct Vector2D                                              FOVMinMaxAngleDegrees;                             // 0x308(0x8)
};


// Size 0x1c
struct OnUpdateZiplineActionStateEvent
{
public:
	char                                                         pad0x1c_SVSL3[0x1c];                               // 0x0(0x1c)
};


// Size 0x18
struct OnEndZiplineActionStateEvent
{
public:
	class WwiseEvent*                                            ZiplineEnd;                                        // 0x0(0x8)
	class WwiseEvent*                                            ZiplineEndLoop;                                    // 0x8(0x8)
	class WwiseEvent*                                            DetachFromZiplineAdditiveOneShot;                  // 0x10(0x8)
};


// Size 0x28
struct OnStartZiplineActionStateEvent
{
public:
	class WwiseEvent*                                            ZiplineStart;                                      // 0x0(0x8)
	class WwiseEvent*                                            AttachToZiplineAdditiveOneShot;                    // 0x8(0x8)
	class WwiseEvent*                                            ZiplineLoopStart;                                  // 0x10(0x8)
	class ParticleSystem*                                        ZiplineWindVFX;                                    // 0x18(0x8)
	class ParticleSystem*                                        ZiplineTrailVFX;                                   // 0x20(0x8)
};


// Size 0x1
struct OnExitedRideEvent
{
public:
	char                                                         pad0x1_USZ3R[0x1];                                 // 0x0(0x1)
};


// Size 0x58
struct RideTransitionActionStateConstructionInfo
{
public:
	char                                                         pad0x30_JQ1LI[0x30];                               // 0x0(0x30)
	class Ride*                                                  Ride;                                              // 0x30(0x8)
	byte                                                         Direction;                                         // 0x38(0x1)
	char                                                         pad0x3_Z5ZAO[0x3];                                 // 0x39(0x3)
	float                                                        Offset;                                            // 0x3c(0x4)
	char                                                         pad0x18_AQS23[0x18];                               // 0x40(0x18)
};


// Size 0x14
struct RideTransitionActionStateParams
{
public:
	char                                                         pad0x10_2BO8P[0x10];                               // 0x0(0x10)
	float                                                        Duration;                                          // 0x10(0x4)
};


// Size 0x38
struct WaterSlideActionStateConstructionInfo
{
public:
	char                                                         pad0x30_SP8M0[0x30];                               // 0x0(0x30)
	class SceneComponent*                                        SceneComponent;                                    // 0x30(0x8)
};


// Size 0x24
struct WaterSlideActionStateParams
{
public:
	float                                                        ForcedFieldOfView;                                 // 0x0(0x4)
	bool                                                         ForceStash;                                        // 0x4(0x1)
	char                                                         pad0x3_P5WS0[0x3];                                 // 0x5(0x3)
	struct LookAtOffsetParams                                    LookAtOffsetParams;                                // 0x8(0x1c)
};


// Size 0xc
struct OnPlayerSpeedOnWaterSlideChangedActionStateEvent
{
public:
	char                                                         pad0xc_3JMAJ[0xc];                                 // 0x0(0xc)
};


// Size 0x10
struct OnPlayerChangedWaterSlideRouteActionStateEvent
{
public:
	char                                                         pad0x8_T1B0Y[0x8];                                 // 0x0(0x8)
	class WwiseEvent*                                            WaterSlideChangeForkOneShot;                       // 0x8(0x8)
};


// Size 0x18
struct OnEndWaterSlideActionStateEvent
{
public:
	char                                                         pad0x8_IN4RO[0x8];                                 // 0x0(0x8)
	class WwiseEvent*                                            WaterSlideEnd;                                     // 0x8(0x8)
	class WwiseEvent*                                            WaterSlideIsEndOneShot;                            // 0x10(0x8)
};


// Size 0x10
struct OnStartWaterSlideActionStateEvent
{
public:
	class WwiseEvent*                                            WaterSlideStart;                                   // 0x0(0x8)
	class ParticleSystem*                                        WaterSlideVfxOverride;                             // 0x8(0x8)
};


// Size 0x48
struct ZiplineActionStateConstructionInfo
{
public:
	char                                                         pad0x30_D63DH[0x30];                               // 0x0(0x30)
	class SceneComponent*                                        SceneComponent;                                    // 0x30(0x8)
	byte                                                         MovementDirection;                                 // 0x38(0x1)
	byte                                                         InitialSwingDirection;                             // 0x39(0x1)
	char                                                         pad0x6_9S5PO[0x6];                                 // 0x3a(0x6)
	double                                                       ZiplineStartSmoothedTime;                          // 0x40(0x8)
};


// Size 0x1c
struct ZipLineActionStateParams
{
public:
	struct LookAtOffsetParams                                    LookAtOffsetParams;                                // 0x0(0x1c)
};


}