#pragma once

// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid

#include "Wind_Structs.h"


// Size 0x90 (Full Size[0x370] - InheritedSize[0x2e0]
class WindZoneComponent: public SceneComponent
{
public:
	struct WindTurbulenceParameters                              TurbulenceParams;                                  // 0x2e8(0x70)
	struct WindZoneParams                                        WindZoneParams;                                    // 0x358(0x10)
};


// Size 0x28 (Full Size[0x60] - InheritedSize[0x38]
class WindSettings: public DeveloperSettings
{
public:
	struct WindServiceParams                                     WindParams;                                        // 0x38(0x24)
};


// Size 0x40 (Full Size[0x68] - InheritedSize[0x28]
class TestWindInterface: public Object
{
public:
	TArray<class Interface*>                                     WindZones;                                         // 0x58(0x10)
};


// Size 0x138 (Full Size[0x500] - InheritedSize[0x3c8]
class WindService: public Actor
{
public:
	class WindDirectionalSource*                                 GlobalWindSource;                                  // 0x3d8(0x8)
	float                                                        CurrentWindAngle;                                  // 0x3f0(0x4)
	float                                                        CurrentWindMagnitude;                              // 0x3f4(0x4)
	TArray<class Interface*>                                     WindZones;                                         // 0x4e0(0x10)
	TArray<struct ExtraWind>                                     ExtraWind;                                         // 0x4f0(0x10)
};


