// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x40
class wld_shp_rocks_cluster_03_C: public BP_Placement_HeightDrop_C
{
public:
	Class StaticMeshComponent*                                   StaticMeshComponent0;                              // 0x408(0x8)
	Class StaticMeshComponent*                                   wld_rock_xlarge_02_c;                              // 0x410(0x8)
	Class StaticMeshComponent*                                   wld_rock_xlarge_05_a;                              // 0x418(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent06;                             // 0x420(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent05;                             // 0x428(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent04;                             // 0x430(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent01;                             // 0x438(0x8)
	Class SceneComponent*                                        SharedRoot;                                        // 0x440(0x8)
};


}