// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x38
class wld_palm_cluster_05_b_C: public BP_Placement_HeightDrop_C
{
public:
	Class StaticMeshComponent*                                   wld_tree_palm_02_b_01;                             // 0x410(0x8)
	Class StaticMeshComponent*                                   wld_bush_banana_01_a_01;                           // 0x418(0x8)
	Class StaticMeshComponent*                                   wld_bush_03_a_01;                                  // 0x420(0x8)
	Class StaticMeshComponent*                                   wld_tree_palm_02_a_01;                             // 0x428(0x8)
	Class NonVagueNonUniqueLandmarkComponent*                    NonVagueNonUniqueLandmark;                         // 0x430(0x8)
	Class StaticMeshComponent*                                   wld_bush_01_b_01;                                  // 0x438(0x8)
	Class SceneComponent*                                        SharedRoot;                                        // 0x440(0x8)
};


// Size 0x28
class wld_palm_cluster_05_a_C: public BP_Placement_HeightDrop_C
{
public:
	Class StaticMeshComponent*                                   wld_bush_03_a_01;                                  // 0x410(0x8)
	Class StaticMeshComponent*                                   wld_bush_02_a_01;                                  // 0x418(0x8)
	Class NonVagueNonUniqueLandmarkComponent*                    NonVagueNonUniqueLandmark;                         // 0x420(0x8)
	Class StaticMeshComponent*                                   wld_tree_palm_02_b_01;                             // 0x428(0x8)
	Class SceneComponent*                                        SharedRoot;                                        // 0x430(0x8)
};


// Size 0x28
class wld_palm_cluster_04_d_C: public BP_Placement_HeightDrop_C
{
public:
	Class StaticMeshComponent*                                   wld_bush_01_b_01;                                  // 0x410(0x8)
	Class StaticMeshComponent*                                   wld_bush_banana_01_a_01;                           // 0x418(0x8)
	Class NonVagueNonUniqueLandmarkComponent*                    NonVagueNonUniqueLandmark;                         // 0x420(0x8)
	Class StaticMeshComponent*                                   wld_tree_palm_02_c_01;                             // 0x428(0x8)
	Class SceneComponent*                                        SharedRoot;                                        // 0x430(0x8)
};


// Size 0x28
class wld_palm_cluster_04_c_C: public BP_Placement_HeightDrop_C
{
public:
	Class StaticMeshComponent*                                   wld_bush_03_a_01;                                  // 0x410(0x8)
	Class StaticMeshComponent*                                   wld_bush_02_a_01;                                  // 0x418(0x8)
	Class NonVagueNonUniqueLandmarkComponent*                    NonVagueNonUniqueLandmark;                         // 0x420(0x8)
	Class StaticMeshComponent*                                   wld_tree_palm_02_b_01;                             // 0x428(0x8)
	Class SceneComponent*                                        SharedRoot;                                        // 0x430(0x8)
};


// Size 0x38
class wld_palm_cluster_04_b_C: public BP_Placement_HeightDrop_C
{
public:
	Class StaticMeshComponent*                                   wld_bush_03_a_02;                                  // 0x410(0x8)
	Class StaticMeshComponent*                                   wld_bush_02_a_01;                                  // 0x418(0x8)
	Class StaticMeshComponent*                                   wld_bush_03_a_01;                                  // 0x420(0x8)
	Class StaticMeshComponent*                                   wld_tree_palm_01_a_01;                             // 0x428(0x8)
	Class NonVagueNonUniqueLandmarkComponent*                    NonVagueNonUniqueLandmark;                         // 0x430(0x8)
	Class StaticMeshComponent*                                   wld_tree_palm_02_b_01;                             // 0x438(0x8)
	Class SceneComponent*                                        SharedRoot;                                        // 0x440(0x8)
};


// Size 0x38
class wld_palm_cluster_04_a_C: public BP_Placement_HeightDrop_C
{
public:
	Class StaticMeshComponent*                                   wld_tree_palm_02_b_01;                             // 0x410(0x8)
	Class StaticMeshComponent*                                   wld_bush_banana_01_a_01;                           // 0x418(0x8)
	Class StaticMeshComponent*                                   wld_bush_03_a_01;                                  // 0x420(0x8)
	Class NonVagueNonUniqueLandmarkComponent*                    NonVagueNonUniqueLandmark;                         // 0x428(0x8)
	Class StaticMeshComponent*                                   wld_tree_palm_02_a_01;                             // 0x430(0x8)
	Class StaticMeshComponent*                                   wld_bush_01_b_01;                                  // 0x438(0x8)
	Class SceneComponent*                                        SharedRoot;                                        // 0x440(0x8)
};


}