// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x68 (Full Size[0x470] - InheritedSize[0x408]
class wld_beach_rocks_08_C: public BP_Placement_HeightDrop_C
{
public:
	Class StaticMeshComponent*                                   wld_rock_small_01__d;                              // 0x408(0x8)
	Class StaticMeshComponent*                                   wld_rock_small_01__a;                              // 0x410(0x8)
	Class StaticMeshComponent*                                   wld_rock_medium_01__a1;                            // 0x418(0x8)
	Class StaticMeshComponent*                                   wld_rock_medium_01__e1;                            // 0x420(0x8)
	Class StaticMeshComponent*                                   wld_rock_medium_01__d;                             // 0x428(0x8)
	Class StaticMeshComponent*                                   wld_rock_large_01__c;                              // 0x430(0x8)
	Class StaticMeshComponent*                                   wld_rock_large_01__b;                              // 0x438(0x8)
	Class StaticMeshComponent*                                   wld_rock_medium_01__a;                             // 0x440(0x8)
	Class StaticMeshComponent*                                   wld_rock_medium_01__e;                             // 0x448(0x8)
	Class StaticMeshComponent*                                   wld_rock_large_01__a;                              // 0x450(0x8)
	Class StaticMeshComponent*                                   wld_rock_large_01__c1;                             // 0x458(0x8)
	Class StaticMeshComponent*                                   wld_rock_large_01__b1;                             // 0x460(0x8)
	Class SceneComponent*                                        SharedRoot;                                        // 0x468(0x8)
};


}