// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x68 (Full Size[0x470] - InheritedSize[0x408]
class wld_palm_cluster_03_a_C: public BP_Placement_HeightDrop_C
{
public:
	Class StaticMeshComponent*                                   wld_plant_01_a;                                    // 0x408(0x8)
	Class StaticMeshComponent*                                   wsp_bush_fern_01_a;                                // 0x410(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent022;                            // 0x418(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent0;                              // 0x420(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent07;                             // 0x428(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent06;                             // 0x430(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent05;                             // 0x438(0x8)
	Class NonVagueNonUniqueLandmarkComponent*                    NonVagueNonUniqueLandmark;                         // 0x440(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent04;                             // 0x448(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent03;                             // 0x450(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent015;                            // 0x458(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent09;                             // 0x460(0x8)
	Class SceneComponent*                                        Scene;                                             // 0x468(0x8)
};


}