// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x48 (Full Size[0x450] - InheritedSize[0x408]
class wld_shp_rocks_cluster_01_C: public BP_Placement_HeightDrop_C
{
public:
	class StaticMeshComponent*                                   wld_rock_xlarge_04_b;                              // 0x408(0x8)
	class StaticMeshComponent*                                   wld_rock_large_01__e;                              // 0x410(0x8)
	class StaticMeshComponent*                                   wld_rock_small_01__d;                              // 0x418(0x8)
	class StaticMeshComponent*                                   wld_rock_small_01__a;                              // 0x420(0x8)
	class StaticMeshComponent*                                   wld_rock_medium_01__b;                             // 0x428(0x8)
	class StaticMeshComponent*                                   wld_rock_medium_01__a;                             // 0x430(0x8)
	class StaticMeshComponent*                                   wld_rock_large_01__a;                              // 0x438(0x8)
	class StaticMeshComponent*                                   wsp_cavern_roof_rock_02;                           // 0x440(0x8)
	class SceneComponent*                                        Scene;                                             // 0x448(0x8)
};


}