// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x60 (Full Size[0x468] - InheritedSize[0x408]
class wld_beach_rocks_05_C: public BP_Placement_HeightDrop_C
{
public:
	class StaticMeshComponent*                                   wld_rock_small_01__b;                              // 0x408(0x8)
	class StaticMeshComponent*                                   wld_rock_small_01__c;                              // 0x410(0x8)
	class StaticMeshComponent*                                   wld_rock_medium_01__e;                             // 0x418(0x8)
	class StaticMeshComponent*                                   wld_rock_medium_01__d;                             // 0x420(0x8)
	class StaticMeshComponent*                                   wld_rock_medium_01__c;                             // 0x428(0x8)
	class StaticMeshComponent*                                   wld_rock_xlarge_05_a;                              // 0x430(0x8)
	class StaticMeshComponent*                                   wld_rock_large_01__e;                              // 0x438(0x8)
	class StaticMeshComponent*                                   wld_rock_large_01__c1;                             // 0x440(0x8)
	class StaticMeshComponent*                                   wld_rock_large_01__c;                              // 0x448(0x8)
	class StaticMeshComponent*                                   wld_rock_xlarge_03_a;                              // 0x450(0x8)
	class StaticMeshComponent*                                   wld_rock_large_01__d;                              // 0x458(0x8)
	class SceneComponent*                                        Scene;                                             // 0x460(0x8)
};


}