#pragma once

// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid

// Size 0x60 (Full Size[0x428] - InheritedSize[0x3c8]
class wld_sea_rock_cluster_b_C: public Actor
{
public:
	class StaticMeshComponent*                                   wld_rock_xlarge_04_a;                              // 0x3c8(0x8)
	class StaticMeshComponent*                                   wld_rock_xlarge_02_a;                              // 0x3d0(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent08;                             // 0x3d8(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent07;                             // 0x3e0(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0;                              // 0x3e8(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent05;                             // 0x3f0(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent04;                             // 0x3f8(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent03;                             // 0x400(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent01;                             // 0x408(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent06;                             // 0x410(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent02;                             // 0x418(0x8)
	class SceneComponent*                                        SharedRoot;                                        // 0x420(0x8)
};


