// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x30 (Full Size[0x438] - InheritedSize[0x408]
class wsp_beach_rocks_12_C: public BP_Placement_HeightDrop_C
{
public:
	class StaticMeshComponent*                                   StaticMeshComponent04;                             // 0x408(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent03;                             // 0x410(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent02;                             // 0x418(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent01;                             // 0x420(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0;                              // 0x428(0x8)
	class SceneComponent*                                        SharedRoot;                                        // 0x430(0x8)
};


// Size 0x98 (Full Size[0x4a0] - InheritedSize[0x408]
class wsp_beach_rocks_11_C: public BP_Placement_HeightDrop_C
{
public:
	class StaticMeshComponent*                                   StaticMeshComponent017;                            // 0x408(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent016;                            // 0x410(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent015;                            // 0x418(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent014;                            // 0x420(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent013;                            // 0x428(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent012;                            // 0x430(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent011;                            // 0x438(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent010;                            // 0x440(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent09;                             // 0x448(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent08;                             // 0x450(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent07;                             // 0x458(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent06;                             // 0x460(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent05;                             // 0x468(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent04;                             // 0x470(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent03;                             // 0x478(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent02;                             // 0x480(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent01;                             // 0x488(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0;                              // 0x490(0x8)
	class SceneComponent*                                        SharedRoot;                                        // 0x498(0x8)
};


// Size 0xa8 (Full Size[0x4b0] - InheritedSize[0x408]
class wsp_beach_rocks_10_C: public BP_Placement_HeightDrop_C
{
public:
	class StaticMeshComponent*                                   StaticMeshComponent019;                            // 0x408(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent018;                            // 0x410(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent017;                            // 0x418(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent016;                            // 0x420(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent015;                            // 0x428(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent014;                            // 0x430(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent013;                            // 0x438(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent012;                            // 0x440(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent011;                            // 0x448(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent010;                            // 0x450(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent09;                             // 0x458(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent08;                             // 0x460(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent07;                             // 0x468(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent06;                             // 0x470(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent05;                             // 0x478(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent04;                             // 0x480(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent03;                             // 0x488(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent02;                             // 0x490(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent01;                             // 0x498(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0;                              // 0x4a0(0x8)
	class SceneComponent*                                        SharedRoot;                                        // 0x4a8(0x8)
};


}