// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0xa0 (Full Size[0x4a8] - InheritedSize[0x408]
class wsp_palm_cluster_03_b_C: public BP_Placement_HeightDrop_C
{
public:
	class StaticMeshComponent*                                   StaticMesh;                                        // 0x408(0x8)
	class StaticMeshComponent*                                   wsp_bush_fern_01_a;                                // 0x410(0x8)
	class StaticMeshComponent*                                   wsp_bush_cheese_01_a4;                             // 0x418(0x8)
	class StaticMeshComponent*                                   wsp_bush_cheese_01_a3;                             // 0x420(0x8)
	class StaticMeshComponent*                                   wsp_bush_cheese_01_a2;                             // 0x428(0x8)
	class StaticMeshComponent*                                   wsp_bush_03_a2;                                    // 0x430(0x8)
	class StaticMeshComponent*                                   wsp_bush_03_a1;                                    // 0x438(0x8)
	class StaticMeshComponent*                                   wsp_bush_cheese_01_a1;                             // 0x440(0x8)
	class StaticMeshComponent*                                   wsp_bush_cheese_01_a;                              // 0x448(0x8)
	class StaticMeshComponent*                                   wsp_bush_monstera_01_a1;                           // 0x450(0x8)
	class StaticMeshComponent*                                   wsp_bush_03_a;                                     // 0x458(0x8)
	class StaticMeshComponent*                                   wsp_rock_pebbles_h;                                // 0x460(0x8)
	class StaticMeshComponent*                                   wsp_rock_pebbles_g;                                // 0x468(0x8)
	class StaticMeshComponent*                                   wsp_rock_pebbles_f;                                // 0x470(0x8)
	class StaticMeshComponent*                                   wsp_rock_cliff_j_01;                               // 0x478(0x8)
	class NonVagueNonUniqueLandmarkComponent*                    NonVagueNonUniqueLandmark;                         // 0x480(0x8)
	class StaticMeshComponent*                                   wsp_tree_palm_02_a_02;                             // 0x488(0x8)
	class StaticMeshComponent*                                   wsp_tre_palm_02_a_01;                              // 0x490(0x8)
	class StaticMeshComponent*                                   wsp_tree_palm_02_b;                                // 0x498(0x8)
	class StaticMeshComponent*                                   wsp_bush_monstera_01_a;                            // 0x4a0(0x8)
};


}