// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x78
class wsp_palm_cluster_03_e_C: public BP_Placement_HeightDrop_C
{
public:
	Class StaticMeshComponent*                                   wsp_bush_fern_01_a1;                               // 0x408(0x8)
	Class StaticMeshComponent*                                   wsp_bush_fern_01_a;                                // 0x410(0x8)
	Class StaticMeshComponent*                                   wsp_bush_elephant_01_a;                            // 0x418(0x8)
	Class StaticMeshComponent*                                   wsp_bush_03_a4;                                    // 0x420(0x8)
	Class StaticMeshComponent*                                   wsp_bush_03_a3;                                    // 0x428(0x8)
	Class StaticMeshComponent*                                   wsp_bush_03_a2;                                    // 0x430(0x8)
	Class StaticMeshComponent*                                   wsp_bush_03_a1;                                    // 0x438(0x8)
	Class StaticMeshComponent*                                   wsp_bush_03_a;                                     // 0x440(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent0;                              // 0x448(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent07;                             // 0x450(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent06;                             // 0x458(0x8)
	Class NonVagueNonUniqueLandmarkComponent*                    NonVagueNonUniqueLandmark;                         // 0x460(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent04;                             // 0x468(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent03;                             // 0x470(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent015;                            // 0x478(0x8)
};


}