// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x40 (Full Size[0x408] - InheritedSize[0x3c8]
class wsp_Pole_Orb_Light_C: public Actor
{
public:
	Class PointLightComponent*                                   PointLight2;                                       // 0x3c8(0x8)
	Class PointLightComponent*                                   PointLight1;                                       // 0x3d0(0x8)
	Class PointLightComponent*                                   PointLight;                                        // 0x3d8(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent03;                             // 0x3e0(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent02;                             // 0x3e8(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent01;                             // 0x3f0(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent0;                              // 0x3f8(0x8)
	Class SceneComponent*                                        SharedRoot;                                        // 0x400(0x8)
};


}