// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0xf8 (Full Size[0x4c0] - InheritedSize[0x3c8]
class WSP_Portal_C: public Actor
{
public:
	class ChildActorComponent*                                   SearocksAudio;                                     // 0x3c8(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent027;                            // 0x3d0(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent026;                            // 0x3d8(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent025;                            // 0x3e0(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent024;                            // 0x3e8(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent023;                            // 0x3f0(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent022;                            // 0x3f8(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent021;                            // 0x400(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent020;                            // 0x408(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent019;                            // 0x410(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent018;                            // 0x418(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent017;                            // 0x420(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent016;                            // 0x428(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent015;                            // 0x430(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0;                              // 0x438(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent013;                            // 0x440(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent012;                            // 0x448(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent011;                            // 0x450(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent010;                            // 0x458(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent09;                             // 0x460(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent08;                             // 0x468(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent07;                             // 0x470(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent06;                             // 0x478(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent05;                             // 0x480(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent04;                             // 0x488(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent03;                             // 0x490(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent02;                             // 0x498(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent01;                             // 0x4a0(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent014;                            // 0x4a8(0x8)
	class SceneComponent*                                        Scene;                                             // 0x4b0(0x8)
	class SceneComponent*                                        SharedRoot;                                        // 0x4b8(0x8)
};


}