#pragma once

// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid

// Size 0x68 (Full Size[0x470] - InheritedSize[0x408]
class wsp_tree_cluster_01_a_C: public BP_Placement_HeightDrop_C
{
public:
	class StaticMeshComponent*                                   wsp_bush_cheese_01_a2;                             // 0x408(0x8)
	class StaticMeshComponent*                                   wsp_bush_cheese_01_a1;                             // 0x410(0x8)
	class StaticMeshComponent*                                   wsp_bush_fern_01_a;                                // 0x418(0x8)
	class StaticMeshComponent*                                   wsp_bush_cheese_01_a;                              // 0x420(0x8)
	class StaticMeshComponent*                                   wsp_bush_07_a_02;                                  // 0x428(0x8)
	class StaticMeshComponent*                                   wsp_bush_07_a_01;                                  // 0x430(0x8)
	class StaticMeshComponent*                                   wsp_tree_palm_02_c2;                               // 0x438(0x8)
	class StaticMeshComponent*                                   wsp_tree_palm_02_b2;                               // 0x440(0x8)
	class NonVagueNonUniqueLandmarkComponent*                    NonVagueNonUniqueLandmark;                         // 0x448(0x8)
	class StaticMeshComponent*                                   wsp_tree_palm_01_b3;                               // 0x450(0x8)
	class StaticMeshComponent*                                   wsp_tree_palm_01_a3;                               // 0x458(0x8)
	class StaticMeshComponent*                                   wsp_tree_palm_01_a2;                               // 0x460(0x8)
	class StaticMeshComponent*                                   wsp_tree_palm_02_a2;                               // 0x468(0x8)
};


