// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x60 (Full Size[0x468] - InheritedSize[0x408]
class wsp_tree_cluster_disc_01_c_C: public BP_Placement_HeightDrop_C
{
public:
	class StaticMeshComponent*                                   wsp_bush_01_a3;                                    // 0x408(0x8)
	class StaticMeshComponent*                                   wsp_bush_01_a2;                                    // 0x410(0x8)
	class StaticMeshComponent*                                   wsp_bush_06_b;                                     // 0x418(0x8)
	class StaticMeshComponent*                                   wsp_bush_06_b2;                                    // 0x420(0x8)
	class StaticMeshComponent*                                   wsp_bush_06_b3;                                    // 0x428(0x8)
	class StaticMeshComponent*                                   wsp_bush_06_a;                                     // 0x430(0x8)
	class StaticMeshComponent*                                   wsp_tree_palm_01_a;                                // 0x438(0x8)
	class StaticMeshComponent*                                   wsp_tree_palm_01_b2;                               // 0x440(0x8)
	class NonVagueNonUniqueLandmarkComponent*                    NonVagueNonUniqueLandmark;                         // 0x448(0x8)
	class StaticMeshComponent*                                   wsp_tree_palm_02_b;                                // 0x450(0x8)
	class StaticMeshComponent*                                   wsp_bush_01_a7;                                    // 0x458(0x8)
	class SceneComponent*                                        Scene;                                             // 0x460(0x8)
};


}