// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x70 (Full Size[0x478] - InheritedSize[0x408]
class wsp_beach_rocks_09_C: public BP_Placement_HeightDrop_C
{
public:
	Class StaticMeshComponent*                                   StaticMeshComponent012;                            // 0x408(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent011;                            // 0x410(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent010;                            // 0x418(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent09;                             // 0x420(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent08;                             // 0x428(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent07;                             // 0x430(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent06;                             // 0x438(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent05;                             // 0x440(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent04;                             // 0x448(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent03;                             // 0x450(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent02;                             // 0x458(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent01;                             // 0x460(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent0;                              // 0x468(0x8)
	Class SceneComponent*                                        SharedRoot;                                        // 0x470(0x8)
};


}