// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x88 (Full Size[0x490] - InheritedSize[0x408]
class wsp_palm_cluster_03_d_C: public BP_Placement_HeightDrop_C
{
public:
	Class StaticMeshComponent*                                   wsp_flower_01_a;                                   // 0x408(0x8)
	Class StaticMeshComponent*                                   wsp_rock_pebbles__e;                               // 0x410(0x8)
	Class StaticMeshComponent*                                   wsp_rock_pebbles__f;                               // 0x418(0x8)
	Class StaticMeshComponent*                                   wsp_rock_pebbles__h;                               // 0x420(0x8)
	Class StaticMeshComponent*                                   wsp_rock_pebbles__g;                               // 0x428(0x8)
	Class StaticMeshComponent*                                   wsp_rock_pebbles__b;                               // 0x430(0x8)
	Class StaticMeshComponent*                                   wsp_rock_pebbles__a;                               // 0x438(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent011;                            // 0x440(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent09;                             // 0x448(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent06;                             // 0x450(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent05;                             // 0x458(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent04;                             // 0x460(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent02;                             // 0x468(0x8)
	Class NonVagueNonUniqueLandmarkComponent*                    NonVagueNonUniqueLandmark;                         // 0x470(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent01;                             // 0x478(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent0;                              // 0x480(0x8)
	Class SceneComponent*                                        SharedRoot;                                        // 0x488(0x8)
};


}