// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x80
class wsp_beach_rocks_06_C: public BP_Placement_HeightDrop_C
{
public:
	Class StaticMeshComponent*                                   wsp_rock_pebbles__b4;                              // 0x408(0x8)
	Class StaticMeshComponent*                                   wsp_rock_pebbles__c13;                             // 0x410(0x8)
	Class StaticMeshComponent*                                   wsp_rock_xtra_small__a14;                          // 0x418(0x8)
	Class StaticMeshComponent*                                   wsp_rock_pebbles__g;                               // 0x420(0x8)
	Class StaticMeshComponent*                                   wsp_rock_xtra_small__b17;                          // 0x428(0x8)
	Class StaticMeshComponent*                                   wsp_rock_xtra_small__b14;                          // 0x430(0x8)
	Class StaticMeshComponent*                                   wsp_rock_pebbles__h;                               // 0x438(0x8)
	Class StaticMeshComponent*                                   StaticMesh2;                                       // 0x440(0x8)
	Class StaticMeshComponent*                                   wsp_rock_xtra_small__e12;                          // 0x448(0x8)
	Class StaticMeshComponent*                                   wsp_rock_xtra_small__a17;                          // 0x450(0x8)
	Class StaticMeshComponent*                                   wsp_rock_xtra_small__e11;                          // 0x458(0x8)
	Class StaticMeshComponent*                                   wsp_rock_xtra_small__d23;                          // 0x460(0x8)
	Class StaticMeshComponent*                                   wsp_rock_pebbles__d10;                             // 0x468(0x8)
	Class StaticMeshComponent*                                   wsp_rock_pebbles__e12;                             // 0x470(0x8)
	Class StaticMeshComponent*                                   wsp_rock_pebbles__d13;                             // 0x478(0x8)
	Class SceneComponent*                                        Scene;                                             // 0x480(0x8)
};


}