// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x50 (Full Size[0x458] - InheritedSize[0x408]
class wsp_beach_rocks_05_b_C: public BP_Placement_HeightDrop_C
{
public:
	Class StaticMeshComponent*                                   StaticMesh1;                                       // 0x408(0x8)
	Class StaticMeshComponent*                                   StaticMesh16;                                      // 0x410(0x8)
	Class StaticMeshComponent*                                   StaticMesh13;                                      // 0x418(0x8)
	Class StaticMeshComponent*                                   StaticMesh11;                                      // 0x420(0x8)
	Class StaticMeshComponent*                                   StaticMesh10;                                      // 0x428(0x8)
	Class StaticMeshComponent*                                   StaticMesh9;                                       // 0x430(0x8)
	Class StaticMeshComponent*                                   StaticMesh8;                                       // 0x438(0x8)
	Class StaticMeshComponent*                                   StaticMesh7;                                       // 0x440(0x8)
	Class StaticMeshComponent*                                   StaticMesh6;                                       // 0x448(0x8)
	Class SceneComponent*                                        Scene;                                             // 0x450(0x8)
};


}