#pragma once

// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid

// Size 0x58 (Full Size[0x460] - InheritedSize[0x408]
class wsp_beach_rocks_07_C: public BP_Placement_HeightDrop_C
{
public:
	class StaticMeshComponent*                                   StaticMeshComponent09;                             // 0x408(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent08;                             // 0x410(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent07;                             // 0x418(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent06;                             // 0x420(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent05;                             // 0x428(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent04;                             // 0x430(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent03;                             // 0x438(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent02;                             // 0x440(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent01;                             // 0x448(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0;                              // 0x450(0x8)
	class SceneComponent*                                        SharedRoot;                                        // 0x458(0x8)
};


