// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x38
class wsp_tree_cluster_03_c_C: public BP_Placement_HeightDrop_C
{
public:
	Class StaticMeshComponent*                                   wsp_bush_cheese_01_a1;                             // 0x410(0x8)
	Class StaticMeshComponent*                                   wsp_bush_cheese_01_a;                              // 0x418(0x8)
	Class StaticMeshComponent*                                   wsp_tree_palm_01_a2;                               // 0x420(0x8)
	Class StaticMeshComponent*                                   wsp_bush_06_b;                                     // 0x428(0x8)
	Class StaticMeshComponent*                                   wsp_tree_palm_02_b2;                               // 0x430(0x8)
	Class NonVagueNonUniqueLandmarkComponent*                    NonVagueNonUniqueLandmark;                         // 0x438(0x8)
	Class StaticMeshComponent*                                   wsp_tree_palm_02_a2;                               // 0x440(0x8)
};


// Size 0x38
class wsp_tree_cluster_01_h_C: public BP_Placement_HeightDrop_C
{
public:
	Class StaticMeshComponent*                                   wsp_bush_01_a25;                                   // 0x410(0x8)
	Class StaticMeshComponent*                                   wsp_tree_palm_01_b10;                              // 0x418(0x8)
	Class NonVagueNonUniqueLandmarkComponent*                    NonVagueNonUniqueLandmark;                         // 0x420(0x8)
	Class StaticMeshComponent*                                   wsp_tree_palm_01_a;                                // 0x428(0x8)
	Class StaticMeshComponent*                                   wsp_bush_01_a20;                                   // 0x430(0x8)
	Class StaticMeshComponent*                                   wsp_bush_06_b11;                                   // 0x438(0x8)
	Class SceneComponent*                                        Scene;                                             // 0x440(0x8)
};


// Size 0x30
class wsp_tree_cluster_01_b_C: public BP_Placement_HeightDrop_C
{
public:
	Class StaticMeshComponent*                                   wsp_bush_06_b;                                     // 0x410(0x8)
	Class StaticMeshComponent*                                   wsp_tree_palm_02_b2;                               // 0x418(0x8)
	Class StaticMeshComponent*                                   wsp_tree_palm_02_a2;                               // 0x420(0x8)
	Class NonVagueNonUniqueLandmarkComponent*                    NonVagueNonUniqueLandmark;                         // 0x428(0x8)
	Class StaticMeshComponent*                                   wsp_tree_palm_01_a2;                               // 0x430(0x8)
	Class SceneComponent*                                        Scene;                                             // 0x438(0x8)
};


}