#pragma once

// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid

// Size 0x50 (Full Size[0x458] - InheritedSize[0x408]
class wsp_cave_rocks_09_C: public BP_Placement_HeightDrop_C
{
public:
	class StaticMeshComponent*                                   StaticMesh7;                                       // 0x408(0x8)
	class StaticMeshComponent*                                   StaticMesh6;                                       // 0x410(0x8)
	class StaticMeshComponent*                                   StaticMesh5;                                       // 0x418(0x8)
	class StaticMeshComponent*                                   StaticMesh4;                                       // 0x420(0x8)
	class StaticMeshComponent*                                   StaticMesh3;                                       // 0x428(0x8)
	class StaticMeshComponent*                                   StaticMesh2;                                       // 0x430(0x8)
	class StaticMeshComponent*                                   StaticMesh;                                        // 0x438(0x8)
	class StaticMeshComponent*                                   StaticMesh1;                                       // 0x440(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0;                              // 0x448(0x8)
	class SceneComponent*                                        SharedRoot;                                        // 0x450(0x8)
};


