// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x50 (Full Size[0x458] - InheritedSize[0x408]
class wsp_tree_cluster_disc_01_h_C: public BP_Placement_HeightDrop_C
{
public:
	class StaticMeshComponent*                                   wsp_bush_03_a1;                                    // 0x408(0x8)
	class StaticMeshComponent*                                   wsp_bush_03_a;                                     // 0x410(0x8)
	class StaticMeshComponent*                                   wsp_bush_01_a25;                                   // 0x418(0x8)
	class StaticMeshComponent*                                   wsp_bush_04_a6;                                    // 0x420(0x8)
	class StaticMeshComponent*                                   wsp_tree_palm_01_b10;                              // 0x428(0x8)
	class NonVagueNonUniqueLandmarkComponent*                    NonVagueNonUniqueLandmark;                         // 0x430(0x8)
	class StaticMeshComponent*                                   wsp_tree_palm_01_a;                                // 0x438(0x8)
	class StaticMeshComponent*                                   wsp_bush_01_a20;                                   // 0x440(0x8)
	class StaticMeshComponent*                                   wsp_bush_06_b11;                                   // 0x448(0x8)
	class SceneComponent*                                        Scene;                                             // 0x450(0x8)
};


}