// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x88
class wsp_beach_rocks_01_C: public BP_Placement_HeightDrop_C
{
public:
	Class StaticMeshComponent*                                   StaticMesh16;                                      // 0x408(0x8)
	Class StaticMeshComponent*                                   StaticMesh15;                                      // 0x410(0x8)
	Class StaticMeshComponent*                                   StaticMesh14;                                      // 0x418(0x8)
	Class StaticMeshComponent*                                   StaticMesh13;                                      // 0x420(0x8)
	Class StaticMeshComponent*                                   StaticMesh12;                                      // 0x428(0x8)
	Class StaticMeshComponent*                                   StaticMesh11;                                      // 0x430(0x8)
	Class StaticMeshComponent*                                   StaticMesh10;                                      // 0x438(0x8)
	Class StaticMeshComponent*                                   StaticMesh9;                                       // 0x440(0x8)
	Class StaticMeshComponent*                                   StaticMesh8;                                       // 0x448(0x8)
	Class StaticMeshComponent*                                   StaticMesh7;                                       // 0x450(0x8)
	Class StaticMeshComponent*                                   StaticMesh6;                                       // 0x458(0x8)
	Class StaticMeshComponent*                                   StaticMesh5;                                       // 0x460(0x8)
	Class StaticMeshComponent*                                   StaticMesh4;                                       // 0x468(0x8)
	Class StaticMeshComponent*                                   StaticMesh3;                                       // 0x470(0x8)
	Class StaticMeshComponent*                                   StaticMesh2;                                       // 0x478(0x8)
	Class StaticMeshComponent*                                   StaticMesh1;                                       // 0x480(0x8)
	Class SceneComponent*                                        Scene;                                             // 0x488(0x8)
};


}