#pragma once

// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid

// Size 0x60 (Full Size[0x428] - InheritedSize[0x3c8]
class wsp_Pole_Orb_Light_b_C: public Actor
{
public:
	class PointLightComponent*                                   PointLight3;                                       // 0x3c8(0x8)
	class PointLightComponent*                                   PointLight2;                                       // 0x3d0(0x8)
	class PointLightComponent*                                   PointLight1;                                       // 0x3d8(0x8)
	class PointLightComponent*                                   PointLight;                                        // 0x3e0(0x8)
	class StaticMeshComponent*                                   StaticMesh;                                        // 0x3e8(0x8)
	class StaticMeshComponent*                                   tls_linstock_01_a;                                 // 0x3f0(0x8)
	class StaticMeshComponent*                                   wsp_rope_a;                                        // 0x3f8(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent03;                             // 0x400(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent02;                             // 0x408(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent01;                             // 0x410(0x8)
	class StaticMeshComponent*                                   StaticMeshComponent0;                              // 0x418(0x8)
	class SceneComponent*                                        SharedRoot;                                        // 0x420(0x8)
};


