// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x60
class wsp_Pole_Orb_Light_b_C: public Actor
{
public:
	Class PointLightComponent*                                   PointLight3;                                       // 0x3c8(0x8)
	Class PointLightComponent*                                   PointLight2;                                       // 0x3d0(0x8)
	Class PointLightComponent*                                   PointLight1;                                       // 0x3d8(0x8)
	Class PointLightComponent*                                   PointLight;                                        // 0x3e0(0x8)
	Class StaticMeshComponent*                                   StaticMesh;                                        // 0x3e8(0x8)
	Class StaticMeshComponent*                                   tls_linstock_01_a;                                 // 0x3f0(0x8)
	Class StaticMeshComponent*                                   wsp_rope_a;                                        // 0x3f8(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent03;                             // 0x400(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent02;                             // 0x408(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent01;                             // 0x410(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent0;                              // 0x418(0x8)
	Class SceneComponent*                                        SharedRoot;                                        // 0x420(0x8)
};


}