// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x48 (Full Size[0x450] - InheritedSize[0x408]
class wsp_mushroom_glow_01_c_C: public BP_Placement_HeightDrop_C
{
public:
	Class StaticMeshComponent*                                   StaticMeshComponent07;                             // 0x408(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent06;                             // 0x410(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent05;                             // 0x418(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent04;                             // 0x420(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent03;                             // 0x428(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent02;                             // 0x430(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent01;                             // 0x438(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent0;                              // 0x440(0x8)
	Class SceneComponent*                                        SharedRoot;                                        // 0x448(0x8)
};


}