// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0xb0 (Full Size[0x4b8] - InheritedSize[0x408]
class wsp_beach_rocks_04_b_C: public BP_Placement_HeightDrop_C
{
public:
	class StaticMeshComponent*                                   StaticMesh22;                                      // 0x408(0x8)
	class StaticMeshComponent*                                   StaticMesh20;                                      // 0x410(0x8)
	class StaticMeshComponent*                                   StaticMesh19;                                      // 0x418(0x8)
	class StaticMeshComponent*                                   StaticMesh18;                                      // 0x420(0x8)
	class StaticMeshComponent*                                   StaticMesh17;                                      // 0x428(0x8)
	class StaticMeshComponent*                                   StaticMesh16;                                      // 0x430(0x8)
	class StaticMeshComponent*                                   StaticMesh15;                                      // 0x438(0x8)
	class StaticMeshComponent*                                   StaticMesh14;                                      // 0x440(0x8)
	class StaticMeshComponent*                                   StaticMesh13;                                      // 0x448(0x8)
	class StaticMeshComponent*                                   StaticMesh12;                                      // 0x450(0x8)
	class StaticMeshComponent*                                   StaticMesh11;                                      // 0x458(0x8)
	class StaticMeshComponent*                                   StaticMesh10;                                      // 0x460(0x8)
	class StaticMeshComponent*                                   StaticMesh9;                                       // 0x468(0x8)
	class StaticMeshComponent*                                   StaticMesh8;                                       // 0x470(0x8)
	class StaticMeshComponent*                                   StaticMesh7;                                       // 0x478(0x8)
	class StaticMeshComponent*                                   StaticMesh6;                                       // 0x480(0x8)
	class StaticMeshComponent*                                   StaticMesh5;                                       // 0x488(0x8)
	class StaticMeshComponent*                                   StaticMesh4;                                       // 0x490(0x8)
	class StaticMeshComponent*                                   StaticMesh3;                                       // 0x498(0x8)
	class StaticMeshComponent*                                   StaticMesh2;                                       // 0x4a0(0x8)
	class StaticMeshComponent*                                   StaticMesh1;                                       // 0x4a8(0x8)
	class SceneComponent*                                        Scene;                                             // 0x4b0(0x8)
};


}