// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x8
struct WwiseAudioAcousticSurfaceParams
{
public:
	float                                                        Thickness;                                         // 0x0(0x4)
	float                                                        Reflectivity;                                      // 0x4(0x4)
};


// Size 0x28
struct MultiEmitterData
{
public:
	Class WwiseObjectPoolWrapper*                                PoolWrapper;                                       // 0x0(0x8)
	Class WwiseEvent*                                            PlayEvent;                                         // 0x8(0x8)
	struct FName                                                 Name;                                              // 0x10(0x8)
	Struct Vector                                                Offset;                                            // 0x18(0xc)
};


// Size 0x2
struct WwiseEmitterParams
{
public:
	bool                                                         bEnableObstructionAndOcclusion;                    // 0x0(0x1)
	bool                                                         bEnableAccoustics;                                 // 0x1(0x1)
};


// Size 0x3c
struct WwiseListenerInfo
{
public:
	Struct Vector                                                Position;                                          // 0x0(0xc)
	Struct Vector                                                Up;                                                // 0xc(0xc)
	Struct Vector                                                Right;                                             // 0x18(0xc)
	Struct Vector                                                Front;                                             // 0x24(0xc)
	Struct Vector                                                Velocity;                                          // 0x30(0xc)
};


// Size 0x28
struct WwiseNativeEmitterPoolDensityParams
{
public:
	bool                                                         PlayPoolDensityAudio;                              // 0x0(0x1)
	char                                                         pad0x7_TME8E[0x7];                                 // 0x1(0x7)
	Class WwiseEvent*                                            PoolDensityAudioPlayEvent;                         // 0x8(0x8)
	Class WwiseEvent*                                            PoolDensityAudioStopEvent;                         // 0x10(0x8)
	struct FName                                                 DensityRtpcName;                                   // 0x18(0x8)
	int                                                          FullDensityAmount;                                 // 0x20(0x4)
	float                                                        DensityDistance;                                   // 0x24(0x4)
};


// Size 0x10
struct WwiseExternalSource
{
public:
	Struct FString                                               path;                                              // 0x0(0x10)
};


// Size 0x10
struct WwiseSubtitle
{
public:
	Struct FString                                               Subtitle;                                          // 0x0(0x10)
};


// Size 0x20
struct MovieSceneAkAudioEventTemplate
{
public:
	Class MovieSceneAkAudioEventSection*                         Section;                                           // 0x18(0x8)
};


// Size 0x20
struct MovieSceneAkAudioRTPCTemplate
{
public:
	Class MovieSceneAkAudioRTPCSection*                          Section;                                           // 0x18(0x8)
};


// Size 0x88
struct MovieSceneAkAudioRTPCSectionData
{
public:
	Struct FString                                               RTPCName;                                          // 0x0(0x10)
	Struct RichCurve                                             RTPCCurve;                                         // 0x10(0x78)
};


}