#pragma once

// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid

#include "WwiseAudioCore_Structs.h"


// Size 0x238 (Full Size[0x260] - InheritedSize[0x28]
class WwiseAudioSettings: public Object
{
public:
	char                                                         pad0xc0_VBEQF[0xc0];                               // 0x28(0xc0)
	struct WwisePlatformMappings                                 PlatformMappings;                                  // 0xe8(0x20)
	struct WwiseAudioReverbPresets                               ReverbPresetSettings;                              // 0x108(0x64)
	char                                                         pad0x4_2DH3P[0x4];                                 // 0x16c(0x4)
	struct StringAssetReference                                  WwiseCoreAssetsPath;                               // 0x170(0x10)
	struct DirectoryPath                                         WwiseSoundbanksRoot;                               // 0x180(0x10)
	struct DirectoryPath                                         WwiseStreamedFilesRoot;                            // 0x190(0x10)
	TArray<struct WwiseIOPriorityMappingConfig>                  AsyncIOPriorityMappings;                           // 0x1a0(0x10)
	struct DirectoryPath                                         TritonAcousticMapsDirectory;                       // 0x1b0(0x10)
	struct FString                                               DefaultLanguage;                                   // 0x1c0(0x10)
	struct FString                                               SinkSharesetName;                                  // 0x1d0(0x10)
	struct WwiseNetworkRelationship                              NetworkRelationship;                               // 0x1e0(0x18)
	class WwiseCoreAssets*                                       WwiseCoreAssets;                                   // 0x200(0x8)
	char                                                         pad0x58_7FA5T[0x58];                               // 0x208(0x58)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class WwiseSubSystemInterface: public Interface
{
public:
};


