#pragma once

// Generated by dougthedruid on Discord
// https://github.com/DougTheDruid

#include "ZoomInOnWieldableItems_Structs.h"


// Size 0x60 (Full Size[0x118] - InheritedSize[0xb8]
class ZoomInOnWieldableItemComponent: public ActorComponent
{
public:
	char                                                         pad0x8_D0DFB[0x8];                                 // 0xb8(0x8)
	struct FName                                                 FeatureName;                                       // 0xc0(0x8)
	float                                                        ZoomedInFov;                                       // 0xc8(0x4)
	float                                                        FreelookPitch;                                     // 0xcc(0x4)
	float                                                        FreelookYaw;                                       // 0xd0(0x4)
	float                                                        FreelookOutInterpolationRate;                      // 0xd4(0x4)
	float                                                        LookSensitivityScaler;                             // 0xd8(0x4)
	char                                                         pad0x3c_69VOO[0x3c];                               // 0xdc(0x3c)
};


// Size 0x0 (Full Size[0x28] - InheritedSize[0x28]
class ZoomedInOnWieldableItemActionStateId: public ActionStateId
{
public:
};


