#pragma once

// Name: SoT, Version: 2.4.0


/*!!DEFINE!!*/

/*!!HELPER_DEF!!*/

/*!!HELPER_INC!!*/

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
//---------------------------------------------------------------------------
// Parameters
//---------------------------------------------------------------------------

// Function Athena.MetalAIFormComponent.OnRep_IsWet
struct UMetalAIFormComponent_OnRep_IsWet_Params
{
};

// Function Athena.PlantAIFormComponent.OnRep_IsWet
struct UPlantAIFormComponent_OnRep_IsWet_Params
{
};

// Function Athena.PlantAIFormComponent.OnRep_IsWeak
struct UPlantAIFormComponent_OnRep_IsWeak_Params
{
};

// Function Athena.BuryingTaleQuestService.RemoveBuriedActor
struct UBuryingTaleQuestService_RemoveBuriedActor_Params
{
	struct FGuid                                       InGuid;                                                    // 0x0000(0x0010)  (ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor)
};

// Function Athena.IslandEventTooltipComponent.UnregisterEvents
struct UIslandEventTooltipComponent_UnregisterEvents_Params
{
};

// Function Athena.AnimatedMechanismAction.OnRep_State
struct AAnimatedMechanismAction_OnRep_State_Params
{
	struct FAnimatedMechanismActionState               PreviousState;                                             // 0x0000(0x0018)  (ConstParm, Parm, OutParm, ReferenceParm)
};

// Function Athena.AnimatedMechanismAction.OnMechanismActionStateChanged
struct AAnimatedMechanismAction_OnMechanismActionStateChanged_Params
{
	TEnumAsByte<Athena_EMechanismActionState>          PreviousState;                                             // 0x0010(0x0001)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TEnumAsByte<Athena_EMechanismActionState>          NewState;                                                  // 0x0011(0x0001)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                      InInstigator;                                              // 0x0018(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Athena.AnimatedMechanismAction.OnMechanismActionReset
struct AAnimatedMechanismAction_OnMechanismActionReset_Params
{
};

// Function Athena.AnimatedMechanismAction.OnLastActorLeftSimpleCollisionShape
struct AAnimatedMechanismAction_OnLastActorLeftSimpleCollisionShape_Params
{
	class AActor*                                      OtherActor;                                                // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                         OtherComp;                                                 // 0x0008(0x0008)  (Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Athena.AnimatedMechanismAction.OnFirstActorEnteredSimpleCollisionShape
struct AAnimatedMechanismAction_OnFirstActorEnteredSimpleCollisionShape_Params
{
	class AActor*                                      OtherActor;                                                // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                         OtherComp;                                                 // 0x0008(0x0008)  (Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Athena.AnimatedMechanismAction.Blueprint_OnStopped
struct AAnimatedMechanismAction_Blueprint_OnStopped_Params
{
};

// Function Athena.AnimatedMechanismAction.Blueprint_OnStarted
struct AAnimatedMechanismAction_Blueprint_OnStarted_Params
{
};

// Function Athena.AnimatedMechanismAction.Blueprint_OnReset
struct AAnimatedMechanismAction_Blueprint_OnReset_Params
{
};

// Function Athena.ProjectileLauncherMechanismSourceComponent.Client_FireProjectile
struct UProjectileLauncherMechanismSourceComponent_Client_FireProjectile_Params
{
	struct FVector                                     ProjectileSpawnLocation;                                   // 0x0000(0x000C)  (ConstParm, Parm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor)
	struct FVector                                     LaunchVelocity;                                            // 0x000C(0x000C)  (ConstParm, Parm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor)
};

// Function Athena.LayerInContainerComponent.OnRep_CanTake
struct ULayerInContainerComponent_OnRep_CanTake_Params
{
};

// Function Athena.LayerInContainerComponent.CanTakeLayer
struct ULayerInContainerComponent_CanTakeLayer_Params
{
	bool                                               ReturnValue;                                               // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// Function Athena.ItemInfo.SwitchNetworkClusterToLevel
struct AItemInfo_SwitchNetworkClusterToLevel_Params
{
	class ULevel*                                      Level;                                                     // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Athena.ItemInfo.SwitchNetworkClusterToGlobal
struct AItemInfo_SwitchNetworkClusterToGlobal_Params
{
};

// Function Athena.ItemInfo.SwitchNetworkClusterToActorOrItsLevel
struct AItemInfo_SwitchNetworkClusterToActorOrItsLevel_Params
{
	class AActor*                                      NewOwner;                                                  // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Athena.ItemInfo.SwitchNetworkClusterTo
struct AItemInfo_SwitchNetworkClusterTo_Params
{
	class AActor*                                      NewOwner;                                                  // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Athena.ItemInfo.OnRep_CurrentRepresentationInstance
struct AItemInfo_OnRep_CurrentRepresentationInstance_Params
{
};

// Function Athena.ItemInfo.GetItemType
struct AItemInfo_GetItemType_Params
{
	class UClass*                                      ReturnValue;                                               // 0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
};

// Function Athena.ItemInfo.GetItemCategory
struct AItemInfo_GetItemCategory_Params
{
	class UClass*                                      ReturnValue;                                               // 0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
};

// Function Athena.ItemInfo.GetItem
struct AItemInfo_GetItem_Params
{
	class AActor*                                      ReturnValue;                                               // 0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Athena.ItemInfo.GetAsWieldable
struct AItemInfo_GetAsWieldable_Params
{
	class AWieldableItem*                              ReturnValue;                                               // 0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Athena.ItemInfo.CreateWieldableItem
struct AItemInfo_CreateWieldableItem_Params
{
	class AActor*                                      InNewOwner;                                                // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                                  InTransform;                                               // 0x0010(0x0030)  (ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor)
	class AWieldableItem*                              ReturnValue;                                               // 0x0040(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Athena.ItemInfo.CreateProxyItem
struct AItemInfo_CreateProxyItem_Params
{
	struct FTransform                                  InTransform;                                               // 0x0000(0x0030)  (ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor)
	TEnumAsByte<Athena_EItemLifetimeManagement>        LifetimeManagement;                                        // 0x0030(0x0001)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                      ReturnValue;                                               // 0x0038(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Athena.IslandSalvageSpawnerManager.SetAllowNewSpawnRequests
struct AIslandSalvageSpawnerManager_SetAllowNewSpawnRequests_Params
{
	bool                                               InAllowNewSpawnRequests;                                   // 0x0000(0x0001)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function Athena.ShadowAIFormComponent.OnRep_FlameSpecificPhobia
struct UShadowAIFormComponent_OnRep_FlameSpecificPhobia_Params
{
	TEnumAsByte<Athena_EFlameOfFateType>               PreviousType;                                              // 0x0000(0x0001)  (ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Athena.ShadowAIFormComponent.OnRep_CurrentState
struct UShadowAIFormComponent_OnRep_CurrentState_Params
{
	TEnumAsByte<Athena_EShadowAIFormState>             PreviousState;                                             // 0x0000(0x0001)  (ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Athena.ShadowAIFormComponent.Multicast_ChangedToState
struct UShadowAIFormComponent_Multicast_ChangedToState_Params
{
	TEnumAsByte<Athena_EShadowAIFormState>             InState;                                                   // 0x0000(0x0001)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Athena.ControllableObject.TakenControlImpl
struct AControllableObject_TakenControlImpl_Params
{
	class AActor*                                      Controller;                                                // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Athena.ControllableObject.RelinquishedControlImpl
struct AControllableObject_RelinquishedControlImpl_Params
{
	class AActor*                                      Controller;                                                // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Athena.ControllableObject.GetControllingActor
struct AControllableObject_GetControllingActor_Params
{
	class AActor*                                      ReturnValue;                                               // 0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Athena.ControllableObject.CanInteractImpl
struct AControllableObject_CanInteractImpl_Params
{
	class AActor*                                      InCharacter;                                               // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                               ReturnValue;                                               // 0x0008(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// Function Athena.SailManipulator.SetMastSocketId
struct ASailManipulator_SetMastSocketId_Params
{
	struct FSocketId                                   InMastSocketId;                                            // 0x0000(0x0020)  (Parm)
};

// Function Athena.SailManipulator.SetMast
struct ASailManipulator_SetMast_Params
{
	class AMast*                                       InMast;                                                    // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Athena.SailManipulator.SetLocked
struct ASailManipulator_SetLocked_Params
{
	bool                                               IsLocked;                                                  // 0x0000(0x0001)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function Athena.SailManipulator.RotateTowardsLocation
struct ASailManipulator_RotateTowardsLocation_Params
{
	struct FVector                                     TargetLocation;                                            // 0x0000(0x000C)  (ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor)
};

// Function Athena.SailManipulator.OnRep_PendingBoundMast
struct ASailManipulator_OnRep_PendingBoundMast_Params
{
};

// Function Athena.SailManipulator.IsLocked
struct ASailManipulator_IsLocked_Params
{
	bool                                               ReturnValue;                                               // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// Function Athena.SailManipulator.HandleBoundMastEndPlay
struct ASailManipulator_HandleBoundMastEndPlay_Params
{
	TEnumAsByte<Engine_EEndPlayReason>                 EndPlayReason;                                             // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Athena.SailManipulator.HandleBoundMastDestroyed
struct ASailManipulator_HandleBoundMastDestroyed_Params
{
};

// Function Athena.SailManipulator.GetRopeUVOffset
struct ASailManipulator_GetRopeUVOffset_Params
{
	float                                              ReturnValue;                                               // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Athena.SailManipulator.GetMast
struct ASailManipulator_GetMast_Params
{
	class AMast*                                       ReturnValue;                                               // 0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Athena.Mast.UpdateSailsLoweredBasedOnIntent
struct AMast_UpdateSailsLoweredBasedOnIntent_Params
{
	float                                              LoweredIntent;                                             // 0x0000(0x0004)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Athena.Mast.UpdateSailsBasedOnIntent
struct AMast_UpdateSailsBasedOnIntent_Params
{
	float                                              AngleIntent;                                               // 0x0000(0x0004)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                              LoweredIntent;                                             // 0x0004(0x0004)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Athena.Mast.UpdateSailsAngleBasedOnIntent
struct AMast_UpdateSailsAngleBasedOnIntent_Params
{
	float                                              AngleIntent;                                               // 0x0000(0x0004)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Athena.Mast.UpdateHingeTransform
struct AMast_UpdateHingeTransform_Params
{
};

// Function Athena.Mast.ToggleRepairPlankVisibility
struct AMast_ToggleRepairPlankVisibility_Params
{
	class URepairableComponent*                        InRepairableComponent;                                     // 0x0000(0x0008)  (ConstParm, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                               ShouldBeVisible;                                           // 0x0008(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function Athena.Mast.SetMastPhysicsFromDamageState
struct AMast_SetMastPhysicsFromDamageState_Params
{
	TEnumAsByte<Athena_EMastDamageState>               MastDamageState;                                           // 0x0000(0x0001)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Athena.Mast.SetMastFallingProportion
struct AMast_SetMastFallingProportion_Params
{
	float                                              InProportion;                                              // 0x0000(0x0004)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Athena.Mast.SetFullyRepaired
struct AMast_SetFullyRepaired_Params
{
	class AActor*                                      InRepairer;                                                // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Athena.Mast.SetFullyDamaged
struct AMast_SetFullyDamaged_Params
{
};

// Function Athena.Mast.ReactToDamageLevelChangedThird
struct AMast_ReactToDamageLevelChangedThird_Params
{
	int                                                DamageLevel;                                               // 0x0000(0x0004)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Athena.Mast.ReactToDamageLevelChangedSecond
struct AMast_ReactToDamageLevelChangedSecond_Params
{
	int                                                DamageLevel;                                               // 0x0000(0x0004)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Athena.Mast.ReactToDamageLevelChangedFirst
struct AMast_ReactToDamageLevelChangedFirst_Params
{
	int                                                DamageLevel;                                               // 0x0000(0x0004)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Athena.Mast.ReactToDamage
struct AMast_ReactToDamage_Params
{
	struct FImpactDamageEvent                          ImpactDamageEvent;                                         // 0x0000(0x0058)  (ConstParm, Parm, OutParm, ReferenceParm)
};

// Function Athena.Mast.OnRep_IsCursed
struct AMast_OnRep_IsCursed_Params
{
};

// Function Athena.Mast.OnMastMeshSwapRequested
struct AMast_OnMastMeshSwapRequested_Params
{
	class UStaticMesh*                                 NewMeshBottom;                                             // 0x0000(0x0008)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                                 NewMeshTop;                                                // 0x0008(0x0008)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Athena.Mast.OnMastDescLoaded
struct AMast_OnMastDescLoaded_Params
{
	class UMastDescAsset*                              MastDesc;                                                  // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Athena.Mast.OnLoweredProportionChange
struct AMast_OnLoweredProportionChange_Params
{
	float                                              LoweredProportion;                                         // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                              DeltaTime;                                                 // 0x0004(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Athena.Mast.OnAngleChanged
struct AMast_OnAngleChanged_Params
{
	float                                              Angle;                                                     // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                              DeltaTime;                                                 // 0x0004(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Athena.Mast.Multicast_PlayMastDamageEffectsRPC
struct AMast_Multicast_PlayMastDamageEffectsRPC_Params
{
	TArray<int>                                        RepairableComponentIndices;                                // 0x0000(0x0010)  (ConstParm, Parm, ZeroConstructor, ReferenceParm)
	int                                                NewDamageLevel;                                            // 0x0010(0x0004)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Athena.Mast.IsMastVisuallyFractured
struct AMast_IsMastVisuallyFractured_Params
{
	bool                                               ReturnValue;                                               // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// Function Athena.Mast.IsMastFullyDamaged
struct AMast_IsMastFullyDamaged_Params
{
	bool                                               ReturnValue;                                               // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// Function Athena.Mast.HingeTransformChanged
struct AMast_HingeTransformChanged_Params
{
	struct FTransform                                  NewTransform;                                              // 0x0000(0x0030)  (Parm, IsPlainOldData, NoDestructor)
};

// Function Athena.Mast.GetSailTurnRate
struct AMast_GetSailTurnRate_Params
{
	float                                              ReturnValue;                                               // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Athena.Mast.GetSails
struct AMast_GetSails_Params
{
	TArray<class ASail*>                               ReturnValue;                                               // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm)
};

// Function Athena.Mast.GetSailMovementRate
struct AMast_GetSailMovementRate_Params
{
	float                                              ReturnValue;                                               // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Athena.Mast.GetSailLoweredProportion
struct AMast_GetSailLoweredProportion_Params
{
	float                                              ReturnValue;                                               // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Athena.Mast.GetSailAngleRatio
struct AMast_GetSailAngleRatio_Params
{
	float                                              ReturnValue;                                               // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Athena.Mast.GetMaxDamageLevel
struct AMast_GetMaxDamageLevel_Params
{
	int                                                ReturnValue;                                               // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Athena.Mast.GetMastHeight
struct AMast_GetMastHeight_Params
{
	float                                              ReturnValue;                                               // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Athena.Mast.GetMastDamageState
struct AMast_GetMastDamageState_Params
{
	TEnumAsByte<Athena_EMastDamageState>               ReturnValue;                                               // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Athena.Mast.GetMastAngleBoneTransform
struct AMast_GetMastAngleBoneTransform_Params
{
	struct FTransform                                  ReturnValue;                                               // 0x0000(0x0030)  (Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor)
};

// Function Athena.Mast.GetLookAtPos
struct AMast_GetLookAtPos_Params
{
	struct FVector                                     ReturnValue;                                               // 0x0000(0x000C)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// Function Athena.Mast.GetHingeWorldTransform
struct AMast_GetHingeWorldTransform_Params
{
	struct FTransform                                  ReturnValue;                                               // 0x0000(0x0030)  (Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor)
};

// Function Athena.Mast.GetFallingImpactLocation
struct AMast_GetFallingImpactLocation_Params
{
	struct FVector                                     ReturnValue;                                               // 0x0000(0x000C)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// Function Athena.Mast.GetDamageLevel
struct AMast_GetDamageLevel_Params
{
	int                                                ReturnValue;                                               // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Athena.Mast.FinaliseSails
struct AMast_FinaliseSails_Params
{
	TArray<class UChildActorComponent*>                InSails;                                                   // 0x0000(0x0010)  (Parm, ZeroConstructor, ContainsInstancedReference)
};

// Function Athena.Mast.ApplyMastFallingAngle
struct AMast_ApplyMastFallingAngle_Params
{
	float                                              InAngle;                                                   // 0x0000(0x0004)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Athena.Mast.ApplyDamage
struct AMast_ApplyDamage_Params
{
	struct FImpactDamageEvent                          ImpactDamageEvent;                                         // 0x0000(0x0058)  (ConstParm, Parm, OutParm, ReferenceParm)
};

// Function Athena.ActionRulesBlueprintFunctionLibrary.ExecuteActionRule
struct UActionRulesBlueprintFunctionLibrary_ExecuteActionRule_Params
{
	class UClass*                                      InInputId;                                                 // 0x0000(0x0008)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UActionRulesComponent*                       InActionRulesComponent;                                    // 0x0008(0x0008)  (Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                      InInstigator;                                              // 0x0010(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Athena.ActionRulesBlueprintFunctionLibrary.AddTakeLockKeyActionRule
struct UActionRulesBlueprintFunctionLibrary_AddTakeLockKeyActionRule_Params
{
	class UClass*                                      InInputId;                                                 // 0x0010(0x0008)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UActionRulesComponent*                       InActionRulesComponent;                                    // 0x0028(0x0008)  (Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Athena.ActorCoherentViewComponent.ReadyForBindingsEventReceived
struct UActorCoherentViewComponent_ReadyForBindingsEventReceived_Params
{
};

// Function Athena.ActorRelevancyTestFunctions.WaitForActorToBeAckedForPlayerId
struct UActorRelevancyTestFunctions_WaitForActorToBeAckedForPlayerId_Params
{
	class UObject*                                     WorldContextObject;                                        // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLatentActionInfo                           LatentInfo;                                                // 0x0008(0x0018)  (Parm)
	class AActor*                                      Actor;                                                     // 0x0020(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int                                                ClientId;                                                  // 0x0028(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int                                                SplitScreenIndex;                                          // 0x002C(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Athena.ActorRelevancyTestFunctions.WaitForActorToBeAckedForPlayerController
struct UActorRelevancyTestFunctions_WaitForActorToBeAckedForPlayerController_Params
{
	class UObject*                                     WorldContextObject;                                        // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLatentActionInfo                           LatentInfo;                                                // 0x0008(0x0018)  (Parm)
	class AActor*                                      Actor;                                                     // 0x0020(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                           PlayerController;                                          // 0x0028(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Athena.ActorRelevancyTestFunctions.IsActorAckedForPlayer
struct UActorRelevancyTestFunctions_IsActorAckedForPlayer_Params
{
	class APlayerController*                           PlayerController;                                          // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                      Actor;                                                     // 0x0008(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                               ReturnValue;                                               // 0x0010(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// Function Athena.AdjustableWaterLevelPuzzle.OnRep_ReppedData
struct AAdjustableWaterLevelPuzzle_OnRep_ReppedData_Params
{
};

// Function Athena.AILocomotionCompositeInputHandler.OnQuickSwitchWeapon
struct UAILocomotionCompositeInputHandler_OnQuickSwitchWeapon_Params
{
	TEnumAsByte<AthenaInput_EInputHandlerResult>       ReturnValue;                                               // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Athena.AILocomotionCompositeInputHandler.OnQuickSwitchSecondaryWeapon
struct UAILocomotionCompositeInputHandler_OnQuickSwitchSecondaryWeapon_Params
{
	TEnumAsByte<AthenaInput_EInputHandlerResult>       ReturnValue;                                               // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Athena.AILocomotionCompositeInputHandler.OnQuickSwitchPrimaryWeapon
struct UAILocomotionCompositeInputHandler_OnQuickSwitchPrimaryWeapon_Params
{
	TEnumAsByte<AthenaInput_EInputHandlerResult>       ReturnValue;                                               // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Athena.AIShipCaptainActionStateId.PushCharacterIntoAIShipCaptainActionState
struct UAIShipCaptainActionStateId_PushCharacterIntoAIShipCaptainActionState_Params
{
	TEnumAsByte<ActionStateMachine_EActionStateMachineTrackId> TrackId;                                                   // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                      Character;                                                 // 0x0028(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Athena.LookAtOffsetComponent.GetLookAtOffset
struct ULookAtOffsetComponent_GetLookAtOffset_Params
{
	struct FLookAtOffset                               ReturnValue;                                               // 0x0000(0x00A0)  (Parm, OutParm, ReturnParm)
};

// Function Athena.CharacterInterface.GetMouthPosition
struct UCharacterInterface_GetMouthPosition_Params
{
	struct FVector                                     ReturnValue;                                               // 0x0000(0x000C)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// Function Athena.CharacterFootImpactMeshInterface.GetFootImpactSkeletonMeshComponent
struct UCharacterFootImpactMeshInterface_GetFootImpactSkeletonMeshComponent_Params
{
	class USkeletalMeshComponent*                      ReturnValue;                                               // 0x0000(0x0008)  (ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Athena.CloudDomeInterface.UpdateCloudMeshes
struct UCloudDomeInterface_UpdateCloudMeshes_Params
{
	struct FCloudVisualParameters                      CloudVisualParametersIn;                                   // 0x0000(0x0070)  (Parm, OutParm)
	TArray<struct FTiledCloudProperties>               CloudTileIn;                                               // 0x0070(0x0010)  (Parm, OutParm, ZeroConstructor)
	TArray<struct FRenderedCloudProperties>            RenderedCloudsIn;                                          // 0x0080(0x0010)  (Parm, OutParm, ZeroConstructor)
	TArray<struct FCloudTypeDefinition>                CloudMeshesIn;                                             // 0x0090(0x0010)  (Parm, OutParm, ZeroConstructor)
	TArray<struct FCloudTypeNormalizedWeight>          NormalizedCloudWeightsIn;                                  // 0x00A0(0x0010)  (Parm, OutParm, ZeroConstructor)
};

// Function Athena.CloudDomeInterface.GetCloudDomePosition
struct UCloudDomeInterface_GetCloudDomePosition_Params
{
	struct FVector                                     ReturnValue;                                               // 0x0000(0x000C)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// Function Athena.AthenaCharacter.WieldItem
struct AAthenaCharacter_WieldItem_Params
{
	bool                                               Fast;                                                      // 0x0010(0x0001)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	TEnumAsByte<Athena_EWieldItemReturnCode>           ReturnValue;                                               // 0x0011(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Athena.AthenaCharacter.UseItem
struct AAthenaCharacter_UseItem_Params
{
	class UClass*                                      NotificationInputId;                                       // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                               ReturnValue;                                               // 0x0008(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// Function Athena.AthenaCharacter.UpdateWaterServiceInterface
struct AAthenaCharacter_UpdateWaterServiceInterface_Params
{
};

// Function Athena.AthenaCharacter.UnforceWaterHeight
struct AAthenaCharacter_UnforceWaterHeight_Params
{
};

// Function Athena.AthenaCharacter.SetIgnoreReplicationRotationOnly
struct AAthenaCharacter_SetIgnoreReplicationRotationOnly_Params
{
	bool                                               InIgnoreReplicationRotationOnly;                           // 0x0000(0x0001)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function Athena.AthenaCharacter.ReceiveRestart
struct AAthenaCharacter_ReceiveRestart_Params
{
};

// Function Athena.AthenaCharacter.PickUpItem
struct AAthenaCharacter_PickUpItem_Params
{
	class AItemInfo*                                   ItemInfo;                                                  // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                               AndWield;                                                  // 0x0008(0x0001)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function Athena.AthenaCharacter.Kill
struct AAthenaCharacter_Kill_Params
{
	TEnumAsByte<Athena_ECharacterDeathType>            DeathType;                                                 // 0x0000(0x0001)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Athena.AthenaCharacter.IsInWater
struct AAthenaCharacter_IsInWater_Params
{
	bool                                               ReturnValue;                                               // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// Function Athena.AthenaCharacter.IsInteractionValid
struct AAthenaCharacter_IsInteractionValid_Params
{
	class UObject*                                     InInteractable;                                            // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                               ReturnValue;                                               // 0x0008(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// Function Athena.AthenaCharacter.IsDead
struct AAthenaCharacter_IsDead_Params
{
	bool                                               ReturnValue;                                               // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// Function Athena.AthenaCharacter.InteractWith
struct AAthenaCharacter_InteractWith_Params
{
	class UObject*                                     InInteractable;                                            // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                      NotificationInputId;                                       // 0x0008(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
};

// Function Athena.AthenaCharacter.Interact
struct AAthenaCharacter_Interact_Params
{
	class UObject*                                     InInteractable;                                            // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Athena.AthenaCharacter.HasValidWaterHeight
struct AAthenaCharacter_HasValidWaterHeight_Params
{
	bool                                               ReturnValue;                                               // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// Function Athena.AthenaCharacter.HasMovementBase
struct AAthenaCharacter_HasMovementBase_Params
{
	bool                                               ReturnValue;                                               // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// Function Athena.AthenaCharacter.HandleCharacterMovementUpdated
struct AAthenaCharacter_HandleCharacterMovementUpdated_Params
{
	float                                              DeltaSeconds;                                              // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                     OldLocation;                                               // 0x0004(0x000C)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                     OldVelocity;                                               // 0x0010(0x000C)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function Athena.AthenaCharacter.GetYawOnMovingBase
struct AAthenaCharacter_GetYawOnMovingBase_Params
{
	float                                              ReturnValue;                                               // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Athena.AthenaCharacter.GetWaterLevelRelativeToCharacterBasePosition
struct AAthenaCharacter_GetWaterLevelRelativeToCharacterBasePosition_Params
{
	float                                              ReturnValue;                                               // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Athena.AthenaCharacter.GetWaterHeight
struct AAthenaCharacter_GetWaterHeight_Params
{
	float                                              ReturnValue;                                               // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Athena.AthenaCharacter.GetViewPitch
struct AAthenaCharacter_GetViewPitch_Params
{
	float                                              ReturnValue;                                               // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Athena.AthenaCharacter.GetValidWaterHeightAtomic
struct AAthenaCharacter_GetValidWaterHeightAtomic_Params
{
	float                                              OutWaterHeight;                                            // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                               ReturnValue;                                               // 0x0004(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// Function Athena.AthenaCharacter.GetThirdPersonMeshComponent
struct AAthenaCharacter_GetThirdPersonMeshComponent_Params
{
	class USkeletalMeshComponent*                      ReturnValue;                                               // 0x0000(0x0008)  (ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Athena.AthenaCharacter.GetInputBinder
struct AAthenaCharacter_GetInputBinder_Params
{
	class UCharacterInputBinder*                       ReturnValue;                                               // 0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Athena.AthenaCharacter.GetIgnoreReplicationRotationOnly
struct AAthenaCharacter_GetIgnoreReplicationRotationOnly_Params
{
	bool                                               ReturnValue;                                               // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// Function Athena.AthenaCharacter.GetFocusedInteractable
struct AAthenaCharacter_GetFocusedInteractable_Params
{
	class UObject*                                     ReturnValue;                                               // 0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Athena.AthenaCharacter.GetFloorSweepCollisionResponseContainer
struct AAthenaCharacter_GetFloorSweepCollisionResponseContainer_Params
{
	struct FCollisionResponseContainer                 ReturnValue;                                               // 0x0000(0x0020)  (Parm, OutParm, ReturnParm)
};

// Function Athena.AthenaCharacter.GetFirstPersonMeshComponent
struct AAthenaCharacter_GetFirstPersonMeshComponent_Params
{
	class USkeletalMeshComponent*                      ReturnValue;                                               // 0x0000(0x0008)  (ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Athena.AthenaCharacter.GetCurrentShip
struct AAthenaCharacter_GetCurrentShip_Params
{
	class AActor*                                      ReturnValue;                                               // 0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Athena.AthenaCharacter.GetCharacterTransform
struct AAthenaCharacter_GetCharacterTransform_Params
{
	struct FTransform                                  ReturnValue;                                               // 0x0000(0x0030)  (Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor)
};

// Function Athena.AthenaCharacter.GetCharacterRotation
struct AAthenaCharacter_GetCharacterRotation_Params
{
	struct FRotator                                    ReturnValue;                                               // 0x0000(0x000C)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// Function Athena.AthenaCharacter.GenerateNewRandomBool
struct AAthenaCharacter_GenerateNewRandomBool_Params
{
};

// Function Athena.AthenaCharacter.GenerateNewRandomAnimationSeed
struct AAthenaCharacter_GenerateNewRandomAnimationSeed_Params
{
};

// Function Athena.AthenaCharacter.ForceWaterHeight
struct AAthenaCharacter_ForceWaterHeight_Params
{
	float                                              WaterHeight;                                               // 0x0000(0x0004)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                      WaterId;                                                   // 0x0008(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
};

// Function Athena.AthenaCharacter.CureAllAilings
struct AAthenaCharacter_CureAllAilings_Params
{
};

// Function Athena.AthenaCharacter.CreateProjectileTraceHitVolume
struct AAthenaCharacter_CreateProjectileTraceHitVolume_Params
{
};

// Function Athena.AthenaCharacter.CanInteractWith
struct AAthenaCharacter_CanInteractWith_Params
{
	class UObject*                                     InInteractable;                                            // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                      NotificationInputId;                                       // 0x0008(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                               ReturnValue;                                               // 0x0010(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// Function Athena.AthenaCharacter.CalculateWaterHeight
struct AAthenaCharacter_CalculateWaterHeight_Params
{
};

// Function Athena.AthenaCharacter.AllAnimationsLoaded
struct AAthenaCharacter_AllAnimationsLoaded_Params
{
	bool                                               ReturnValue;                                               // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// Function Athena.PlayerCharacterInterface.IsPlayerFemale
struct UPlayerCharacterInterface_IsPlayerFemale_Params
{
	bool                                               ReturnValue;                                               // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// Function Athena.PlayerCharacterInterface.GetFirstPersonWwiseEmitterOwner
struct UPlayerCharacterInterface_GetFirstPersonWwiseEmitterOwner_Params
{
	class USceneComponent*                             ReturnValue;                                               // 0x0000(0x0008)  (ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Athena.PlayerCharacterInterface.ExecuteRumbleProfile
struct UPlayerCharacterInterface_ExecuteRumbleProfile_Params
{
	struct FName                                       RumbleTag;                                                 // 0x0000(0x0008)  (ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Athena.PlayerManagerServiceInterface.GetPlayerStateFromPlayerGameId
struct UPlayerManagerServiceInterface_GetPlayerStateFromPlayerGameId_Params
{
	struct FGuid                                       InPlayerGameId;                                            // 0x0000(0x0010)  (ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor)
	class APlayerState*                                ReturnValue;                                               // 0x0010(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Athena.PlayerManagerServiceInterface.GetPlayerCharacterFromPlayerState
struct UPlayerManagerServiceInterface_GetPlayerCharacterFromPlayerState_Params
{
	class APlayerState*                                PlayerState;                                               // 0x0000(0x0008)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAthenaPlayerCharacter*                      ReturnValue;                                               // 0x0008(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Athena.PlayerManagerServiceInterface.GetNumPlayers
struct UPlayerManagerServiceInterface_GetNumPlayers_Params
{
	int                                                ReturnValue;                                               // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Athena.PlayerManagerServiceInterface.GetNumActiveLocalPlayers
struct UPlayerManagerServiceInterface_GetNumActiveLocalPlayers_Params
{
	int                                                ReturnValue;                                               // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Athena.PlayerManagerServiceInterface.GetFirstLocalPlayerController
struct UPlayerManagerServiceInterface_GetFirstLocalPlayerController_Params
{
	class APlayerController*                           ReturnValue;                                               // 0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Athena.PlayerManagerServiceInterface.GetFirstLocalPlayer
struct UPlayerManagerServiceInterface_GetFirstLocalPlayer_Params
{
	class ACharacter*                                  ReturnValue;                                               // 0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Athena.PlayerManagerServiceInterface.GetAllPlayerControllersWeakActorHandle
struct UPlayerManagerServiceInterface_GetAllPlayerControllersWeakActorHandle_Params
{
	TArray<struct FWeakActorHandle>                    ReturnValue;                                               // 0x0000(0x0010)  (ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm)
};

// Function Athena.PlayerManagerServiceInterface.GetAllActivePlayers
struct UPlayerManagerServiceInterface_GetAllActivePlayers_Params
{
	TArray<class AAthenaPlayerCharacter*>              ReturnValue;                                               // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm)
};

// Function Athena.PlayerManagerServiceInterface.GetActiveLocalPlayers
struct UPlayerManagerServiceInterface_GetActiveLocalPlayers_Params
{
	TArray<class AAthenaPlayerCharacter*>              ReturnValue;                                               // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm)
};

// Function Athena.CloudDomeServiceInterface.UnregisterCloudDomeFromService
struct UCloudDomeServiceInterface_UnregisterCloudDomeFromService_Params
{
};

// Function Athena.CloudDomeServiceInterface.RegisterCloudDomeWithService
struct UCloudDomeServiceInterface_RegisterCloudDomeWithService_Params
{
};

// Function Athena.CloudDomeServiceInterface.GetNumberOfCloudDomes
struct UCloudDomeServiceInterface_GetNumberOfCloudDomes_Params
{
	int                                                ReturnValue;                                               // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Athena.CloudDomeServiceInterface.GetCloudDome
struct UCloudDomeServiceInterface_GetCloudDome_Params
{
	int                                                CloudDomeIndex;                                            // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Athena.CloudDomeServiceInterface.GetActualCloudDome
struct UCloudDomeServiceInterface_GetActualCloudDome_Params
{
	int                                                CloudDomeIndex;                                            // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACloudDome*                                  ReturnValue;                                               // 0x0008(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Athena.AthenaPlayerCharacter.WalkActivate
struct AAthenaPlayerCharacter_WalkActivate_Params
{
};

// Function Athena.AthenaPlayerCharacter.UseItem
struct AAthenaPlayerCharacter_UseItem_Params
{
	class UClass*                                      NotificationInputId;                                       // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                               ReturnValue;                                               // 0x0008(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// Function Athena.AthenaPlayerCharacter.TriggerTattooGlow
struct AAthenaPlayerCharacter_TriggerTattooGlow_Params
{
};

// Function Athena.AthenaPlayerCharacter.TattooGlowClient
struct AAthenaPlayerCharacter_TattooGlowClient_Params
{
};

// Function Athena.AthenaPlayerCharacter.TattooGlow
struct AAthenaPlayerCharacter_TattooGlow_Params
{
};

// Function Athena.AthenaPlayerCharacter.SprintActivate
struct AAthenaPlayerCharacter_SprintActivate_Params
{
};

// Function Athena.AthenaPlayerCharacter.ServerWantsSprint
struct AAthenaPlayerCharacter_ServerWantsSprint_Params
{
	bool                                               WantsSprint;                                               // 0x0000(0x0001)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function Athena.AthenaPlayerCharacter.ServerSetAutoFloatInWater
struct AAthenaPlayerCharacter_ServerSetAutoFloatInWater_Params
{
	bool                                               AutoFloatInWater;                                          // 0x0000(0x0001)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function Athena.AthenaPlayerCharacter.Server_IPGLoadStatus
struct AAthenaPlayerCharacter_Server_IPGLoadStatus_Params
{
	TArray<uint32_t>                                   InData;                                                    // 0x0000(0x0010)  (ConstParm, Parm, ZeroConstructor, ReferenceParm)
};

// Function Athena.AthenaPlayerCharacter.OnWieldedItem
struct AAthenaPlayerCharacter_OnWieldedItem_Params
{
};

// Function Athena.AthenaPlayerCharacter.OnRep_ReplicatedIsSprinting
struct AAthenaPlayerCharacter_OnRep_ReplicatedIsSprinting_Params
{
};

// Function Athena.AthenaPlayerCharacter.OnRep_OverridePirateDescSeed
struct AAthenaPlayerCharacter_OnRep_OverridePirateDescSeed_Params
{
};

// Function Athena.AthenaPlayerCharacter.OnRep_OverrideAnimationEntry
struct AAthenaPlayerCharacter_OnRep_OverrideAnimationEntry_Params
{
};

// Function Athena.AthenaPlayerCharacter.OnRep_AutoFloatInWater
struct AAthenaPlayerCharacter_OnRep_AutoFloatInWater_Params
{
};

// Function Athena.AthenaPlayerCharacter.OnMeshSet
struct AAthenaPlayerCharacter_OnMeshSet_Params
{
};

// Function Athena.AthenaPlayerCharacter.OnImpactDamageEventReceived
struct AAthenaPlayerCharacter_OnImpactDamageEventReceived_Params
{
	struct FImpactDamageEvent                          InImpactEvent;                                             // 0x0000(0x0058)  (ConstParm, Parm, OutParm, ReferenceParm)
};

// Function Athena.AthenaPlayerCharacter.Multicast_OnKrakenTentacleDeath
struct AAthenaPlayerCharacter_Multicast_OnKrakenTentacleDeath_Params
{
	int                                                RemainingTentacles;                                        // 0x0000(0x0004)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Athena.AthenaPlayerCharacter.IsSprintEnabled
struct AAthenaPlayerCharacter_IsSprintEnabled_Params
{
	bool                                               ReturnValue;                                               // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// Function Athena.AthenaPlayerCharacter.IsInteractionValid
struct AAthenaPlayerCharacter_IsInteractionValid_Params
{
	class UObject*                                     InInteractable;                                            // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                               ReturnValue;                                               // 0x0008(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// Function Athena.AthenaPlayerCharacter.HasMeshSet
struct AAthenaPlayerCharacter_HasMeshSet_Params
{
	bool                                               ReturnValue;                                               // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// Function Athena.AthenaPlayerCharacter.HasFinishedSpawning
struct AAthenaPlayerCharacter_HasFinishedSpawning_Params
{
	bool                                               ReturnValue;                                               // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// Function Athena.AthenaPlayerCharacter.GetTaleVoyageParticipantComponent
struct AAthenaPlayerCharacter_GetTaleVoyageParticipantComponent_Params
{
	class UVoyageParticipantComponent*                 ReturnValue;                                               // 0x0000(0x0008)  (ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Athena.AthenaPlayerCharacter.GetPrimaryVoyageParticipantComponent
struct AAthenaPlayerCharacter_GetPrimaryVoyageParticipantComponent_Params
{
