#pragma once

// Name: SoT, Version: 2.4.0


/*!!DEFINE!!*/

/*!!HELPER_DEF!!*/

/*!!HELPER_INC!!*/

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
//---------------------------------------------------------------------------
// Classes
//---------------------------------------------------------------------------

// AnimBlueprintGeneratedClass BP_Anim_OceanCrawler_Eel.BP_Anim_OceanCrawler_Eel_C
// 0x13F8 (FullSize[0x1B18] - InheritedSize[0x0720])
class UBP_Anim_OceanCrawler_Eel_C : public UOceanCrawlerAnimationInstance
{
public:
	struct FPointerToUberGraphFrame                    UberGraphFrame;                                            // 0x0720(0x0008) (ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                              AnimGraphNode_Root_302497AD48D111831274C6ACDE90652E;       // 0x0728(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_189B1447455D70A049AC04AE02EA0D6B; // 0x0770(0x0040)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_18F209ED4FFD661ED288ECBCA4A06EB1;       // 0x07B0(0x0060)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_F67CA7174BD64183D8EA2A85898ABCE6; // 0x0810(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_F746832F4FAB594C91D6559682351065; // 0x0850(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_1A4970254571A3870E2C39B2CDB0850C; // 0x0890(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_61692F0945F9F465E2E177AD1FAF49AC; // 0x08D0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_9789BBA241D5F3EB14930E90DF6398A0; // 0x0910(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_71182D894F445BD0282D68AB26BD997A; // 0x0950(0x0040)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_72A191F94C5B40E103F27DA599EAA6EA; // 0x0990(0x0050)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_E264DB2A4172F7FDC1C85E90572E312A; // 0x09E0(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_C08F2A074863B1BF03C5FDB3CCAF77C2; // 0x0A28(0x0060)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_7590321E424542CF1B48309F8B5DF46A; // 0x0A88(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_349A1D084D762EE1E250C494A109182A; // 0x0AD0(0x0060)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_0AAE0A6E42AE4069DA8F8199F6AA933F; // 0x0B30(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_8BB1CBD14D95470A552E5F8DBCAECF1A; // 0x0B78(0x0060)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_077FF4C34D75A89A107F578777BE2E35; // 0x0BD8(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_123D5FBA4DD412BCE093499E5444D64C; // 0x0C20(0x00A8)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_91A4EA1048F84F2A1BDE73981C56879C; // 0x0CC8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_7497979A41881C0BCFBD8EB6763F6EA6; // 0x0D10(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_EAC254AB44574801409A32A3BA0EFF68; // 0x0D50(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_BF34B94B4DA751485FB41D8B463FB0A9; // 0x0D90(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_CCF603B244B156BBBD393BA8828564A9; // 0x0DD0(0x0040)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_F5D37846402A617AC6666B9F21A99E4C; // 0x0E10(0x0110)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_26AAC8DB48598A82A7D8628F82487B80; // 0x0F20(0x0048)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_23D5AD3640E53875DD65EA8350327188; // 0x0F68(0x0110)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_D730A6E349F195B209C67F94587EDDCB; // 0x1078(0x0048)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_280B7D354C77AB5D95F8C396C903844F; // 0x10C0(0x0110)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_CE3D1265443E946CA46239B8AC750385; // 0x11D0(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_895AA53E4B929A859E4A3D893550839E; // 0x1218(0x0060)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_1F1FFBD94453A0896973FCA2496B87B7; // 0x1278(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_D9FEF8FB44D924D9DFFE15A628AE428A; // 0x12C0(0x00A8)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_D8F1191D40D5208982F7F480B01CD0D1; // 0x1368(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_B6F790614F35B88784CA3AB06AADFEFD; // 0x13B0(0x00A8)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_D7A32D934E826499424DB09FD9A6A6D7; // 0x1458(0x0048)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_4050FAD44215639D061BAA990E701F4B; // 0x14A0(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_F4477574436C65970C866C88E44F7FC5; // 0x14E8(0x00A8)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_C9267EAB4288387418102BB306A4AADC; // 0x1590(0x0070)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_60AB5E614C50EFE0A8092CA732C48364; // 0x1600(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_EAD0B19F41555F655A0F9397928A0F02; // 0x1640(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_515A24074CE6BCC88B37D9967F7682C1; // 0x1680(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_344F2D414A7E53D744B8F997F24EE104; // 0x16C0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_915BD396431288E6E4B0B893AFA23F4F; // 0x1700(0x0040)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_50EDD8EE49A10D97651D7C8F28F54AEF; // 0x1740(0x0110)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_FC5A28F940EB1246AB301887067A3699; // 0x1850(0x0048)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_564A3F864B7F8ACD1CBF1EBD16E978A8; // 0x1898(0x0110)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_84D52000488388CD7F88AC88EA6FA2C3; // 0x19A8(0x0048)
	struct FAnimNode_RefPose                           AnimGraphNode_IdentityPose_EBE021524DA71B3EA754AC91CFEAF01D; // 0x19F0(0x0038)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_23659D2A499ECA467E154BAC3F215831; // 0x1A28(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_C29776404DC9363D6F2EF79E8DED8200; // 0x1A70(0x00A8)


	static UClass* StaticClass()
	{
		static UClass* ptr = UObject::FindClass("AnimBlueprintGeneratedClass BP_Anim_OceanCrawler_Eel.BP_Anim_OceanCrawler_Eel_C");
		return ptr;
	}



	void AnimNotify_NewAttack();
	void AnimNotify_AttackCompleted();
	void AnimNotify_StartingHitReact();
	void ExecuteUbergraph_BP_Anim_OceanCrawler_Eel(int EntryPoint);
	void AfterRead();
	void BeforeDelete();

};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
