#pragma once

// Name: SoT, Version: 2.3.0


/*!!DEFINE!!*/

/*!!HELPER_DEF!!*/

/*!!HELPER_INC!!*/

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
//---------------------------------------------------------------------------
// Classes
//---------------------------------------------------------------------------

// AnimBlueprintGeneratedClass BP_Anim_FishingRod.BP_Anim_FishingRod_C
// 0x1694 (FullSize[0x1CF4] - InheritedSize[0x0660])
class UBP_Anim_FishingRod_C : public UWieldableFishingRodAnimationInstance
{
public:
	struct FPointerToUberGraphFrame                    UberGraphFrame;                                            // 0x0660(0x0008) (ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                              AnimGraphNode_Root_EDE43C174EA613B760B85A8243DF8736;       // 0x0668(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_316B233F479A460C283CF5A1A873E9E4; // 0x06B0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_B8ABE2504ABBD44FC7137C9717DA97A0; // 0x06F0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_65037C52489F3DA61B86F6921B053177; // 0x0730(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_A20A7566439B93E50C0CF4A894505E9C; // 0x0770(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_D024319048878DDCF1121AB36EE6B28B; // 0x07B0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_7633CAB04DC204B0E6E09AA9F49F5189; // 0x07F0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_535EB42D44232817CF418D883C6417D6; // 0x0830(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_CDEBA2CA4F7A0CD8612F04BD4E1A491A; // 0x0870(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_D4E1ACD2458DECD6C2E09A8D08B40404; // 0x08B0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_76350F374C5583C2B16BDAB9FB139ABA; // 0x08F0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_44B670A94DFA9DF2AC19C08BC712F9DE; // 0x0930(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_46A2D12B4B3E8BC20002A9BFD2F4483C; // 0x0970(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_388C83784AE7830EE274C38C93DC5532; // 0x09B0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_0193244D44387C4F1AD74A96E80A16E4; // 0x09F0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_02AFE28B472D855EF0A539A738CE6983; // 0x0A30(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_B56FC935403C7A06E3AAF1A8F6ED2620; // 0x0A70(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_B119FB1B4E28040C9CA008A10FFF6C70; // 0x0AB0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_47C47C664D07FEFDC925FEBB0A8E19B4; // 0x0AF0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_5BC1ECB54E2D6F611BB08E82BDAC26DA; // 0x0B30(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_2E35F66E4528C6144A99DFBAB298A5E6; // 0x0B70(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_A2191B0146D87EB6C76E8E902D25B44D; // 0x0BB0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_E9301E4945E811372B8918BB0E6080C9; // 0x0BF0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_32EB052D40C553EB5D0F799EEAA5F277; // 0x0C30(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_36AC6EAF430325711DFC38948C7FF07E; // 0x0C70(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_B724A55B47B994CAB33FD184F2EC5F9E; // 0x0CB0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_D7D73691417A11F6353163B69BF05DD6; // 0x0CF0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_B0BCBC534969837B621DBFAF768917B3; // 0x0D30(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_37E9DF944D938122B80095A8FA842F03; // 0x0D70(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_E6177B634AD93DC0F53784BB54217CFC; // 0x0DB0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_1228236F4FA4BAFCF6C14EBA447D9F70; // 0x0DF0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_83326B9840F0AB60A6F1BE91286463BD; // 0x0E30(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_53CCB5F14F8CC3B01D05FD87F8430D39; // 0x0E70(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_452D0A15465A5F5E9B3F1D95C2E07CAD; // 0x0EB0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_7891A33A4FFC278679E013941C82ED0D; // 0x0EF0(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_E9B6AA934CC14C20C55031BEF5172236; // 0x0F30(0x0060)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_840C37634E34ED1FAC0C9AA0A6EDFC522; // 0x0F90(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_CB5C0C0C4F0B87455115408464DA4ADB; // 0x0FD8(0x0060)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_840C37634E34ED1FAC0C9AA0A6EDFC52; // 0x1038(0x0048)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_9F426118455DB4045ADA5E9939E6B8EF; // 0x1080(0x0050)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_92C1E0A54A7B280B84346F98ED0446292; // 0x10D0(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_00154D8D4E81FF74AAD8A9A03386905A; // 0x1118(0x0060)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_4C7F45E5441F2070A8F99F9911BA278D; // 0x1178(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_2AE850474F69125A41669296400230B8; // 0x11C0(0x0060)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_24A1AA0549ABCAE5E454EF825E808ADB; // 0x1220(0x0110)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_85E8550A41FA56E41BD30E8546E4957F; // 0x1330(0x00A0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_4E62C1EE491EBCC6F552448BBA53FC0C; // 0x13D0(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_171FA3884D215EE88B7F41B3B3211457; // 0x1418(0x0060)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_DF7ECFD64F1811CCC915EAA8B877CC7E; // 0x1478(0x0048)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_790EDFC049D11F6D32745FA320CBD8CC; // 0x14C0(0x0110)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_26A0D5904BDF69AC1DC5F7B15EB7160A; // 0x15D0(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_94D0C21C4B251E1F7BEF78B825AFA8EB; // 0x1618(0x0060)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_FE8A25BA4E01827B4DD67D96D518D166; // 0x1678(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_5393CCD941726BDBE4DF68BD58CC8AA9; // 0x16C0(0x0060)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_E50D616F457876B00451FC98E9B4C3F6; // 0x1720(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_8C8E3556453963200C2FBB8011D7A218; // 0x1768(0x0060)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_92C1E0A54A7B280B84346F98ED044629; // 0x17C8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_C28614034648EB6B296EFBBD8007EC43; // 0x1810(0x0040)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_A753349448FE6F26E3EEB7809FDFF704; // 0x1850(0x0050)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_1F0DDB57487A85866A3647BC76ECB383; // 0x18A0(0x00B0)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_FFBB8ECD48FFAC9FAB9BD48526AAFC76; // 0x1950(0x0050)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_E679A2AF4A72CE39499F118AA4319345; // 0x19A0(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_EF7707D84C688F6055C899A2EDBA1926; // 0x19E8(0x0060)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_9C01E36645747C02DDA617B1AB22C774; // 0x1A48(0x0110)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_5FC6BE81454FAA2FC39CD7BACB1932FB; // 0x1B58(0x00A0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_1DEE0B1D4E5BDF2213B58CB491321770; // 0x1BF8(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_5850CD3749FE6A56190AA9B6EACFB4FC; // 0x1C40(0x00A8)
	float                                              DEBUGTimer;                                                // 0x1CE8(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                              DEBUGWantedVerticalBend;                                   // 0x1CEC(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                              DEBUGWantedHorizontalBend;                                 // 0x1CF0(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)


	static UClass* StaticClass()
	{
		static UClass* ptr = UObject::FindClass("AnimBlueprintGeneratedClass BP_Anim_FishingRod.BP_Anim_FishingRod_C");
		return ptr;
	}



	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Anim_FishingRod_AnimGraphNode_TransitionResult_316B233F479A460C283CF5A1A873E9E4();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Anim_FishingRod_AnimGraphNode_TransitionResult_B8ABE2504ABBD44FC7137C9717DA97A0();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Anim_FishingRod_AnimGraphNode_TransitionResult_65037C52489F3DA61B86F6921B053177();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Anim_FishingRod_AnimGraphNode_TransitionResult_A20A7566439B93E50C0CF4A894505E9C();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Anim_FishingRod_AnimGraphNode_TransitionResult_D024319048878DDCF1121AB36EE6B28B();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Anim_FishingRod_AnimGraphNode_TransitionResult_7633CAB04DC204B0E6E09AA9F49F5189();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Anim_FishingRod_AnimGraphNode_TransitionResult_535EB42D44232817CF418D883C6417D6();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Anim_FishingRod_AnimGraphNode_TransitionResult_CDEBA2CA4F7A0CD8612F04BD4E1A491A();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Anim_FishingRod_AnimGraphNode_TransitionResult_D4E1ACD2458DECD6C2E09A8D08B40404();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Anim_FishingRod_AnimGraphNode_TransitionResult_76350F374C5583C2B16BDAB9FB139ABA();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Anim_FishingRod_AnimGraphNode_TransitionResult_44B670A94DFA9DF2AC19C08BC712F9DE();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Anim_FishingRod_AnimGraphNode_TransitionResult_46A2D12B4B3E8BC20002A9BFD2F4483C();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Anim_FishingRod_AnimGraphNode_TransitionResult_388C83784AE7830EE274C38C93DC5532();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Anim_FishingRod_AnimGraphNode_TransitionResult_0193244D44387C4F1AD74A96E80A16E4();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Anim_FishingRod_AnimGraphNode_TransitionResult_02AFE28B472D855EF0A539A738CE6983();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Anim_FishingRod_AnimGraphNode_TransitionResult_B56FC935403C7A06E3AAF1A8F6ED2620();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Anim_FishingRod_AnimGraphNode_TransitionResult_B119FB1B4E28040C9CA008A10FFF6C70();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Anim_FishingRod_AnimGraphNode_TransitionResult_47C47C664D07FEFDC925FEBB0A8E19B4();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Anim_FishingRod_AnimGraphNode_TransitionResult_5BC1ECB54E2D6F611BB08E82BDAC26DA();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Anim_FishingRod_AnimGraphNode_TransitionResult_2E35F66E4528C6144A99DFBAB298A5E6();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Anim_FishingRod_AnimGraphNode_TransitionResult_A2191B0146D87EB6C76E8E902D25B44D();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Anim_FishingRod_AnimGraphNode_TransitionResult_E9301E4945E811372B8918BB0E6080C9();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Anim_FishingRod_AnimGraphNode_TransitionResult_32EB052D40C553EB5D0F799EEAA5F277();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Anim_FishingRod_AnimGraphNode_TransitionResult_36AC6EAF430325711DFC38948C7FF07E();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Anim_FishingRod_AnimGraphNode_TransitionResult_B724A55B47B994CAB33FD184F2EC5F9E();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Anim_FishingRod_AnimGraphNode_TransitionResult_D7D73691417A11F6353163B69BF05DD6();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Anim_FishingRod_AnimGraphNode_TransitionResult_B0BCBC534969837B621DBFAF768917B3();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Anim_FishingRod_AnimGraphNode_TransitionResult_37E9DF944D938122B80095A8FA842F03();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Anim_FishingRod_AnimGraphNode_TransitionResult_E6177B634AD93DC0F53784BB54217CFC();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Anim_FishingRod_AnimGraphNode_TransitionResult_1228236F4FA4BAFCF6C14EBA447D9F70();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Anim_FishingRod_AnimGraphNode_TransitionResult_83326B9840F0AB60A6F1BE91286463BD();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Anim_FishingRod_AnimGraphNode_TransitionResult_53CCB5F14F8CC3B01D05FD87F8430D39();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Anim_FishingRod_AnimGraphNode_TransitionResult_452D0A15465A5F5E9B3F1D95C2E07CAD();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Anim_FishingRod_AnimGraphNode_TransitionResult_7891A33A4FFC278679E013941C82ED0D();
	void ExecuteUbergraph_BP_Anim_FishingRod(int EntryPoint);
	void AfterRead();
	void BeforeDelete();

};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
