#pragma once

// Name: SoT, Version: 2.3.0


/*!!DEFINE!!*/

/*!!HELPER_DEF!!*/

/*!!HELPER_INC!!*/

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
//---------------------------------------------------------------------------
// Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_BlendspaceVariants.BP_BlendSpaceVariants
// 0x0050
struct FBP_BlendSpaceVariants
{
	class UBlendSpace*                                 BlendSpace_01_54_0C261F9545659CFDCCC15C9F19F605D0;         // 0x0000(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	class UBlendSpace*                                 BlendSpace_02_55_86F16A704B9D91C037463CAE6E55D103;         // 0x0008(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	class UBlendSpace*                                 BlendSpace_03_56_822937EA44B18E9DE6C97D944A8C7D52;         // 0x0010(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	class UBlendSpace*                                 BlendSpace_04_57_4390C2994A1567F81C23E0B20D619514;         // 0x0018(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	class UBlendSpace*                                 BlendSpace_05_58_B709F8F540F3BD760DD86F9543EAE154;         // 0x0020(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	class UBlendSpace*                                 BlendSpace_06_59_7BA8111B43AF8C05E1517A9CF35DC4D1;         // 0x0028(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	class UBlendSpace*                                 BlendSpace_07_60_6EEEA5BF4DD46B694C96C59781612970;         // 0x0030(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	class UBlendSpace*                                 BlendSpace_08_61_CF0F9A0949DC7030129551B1CDC49113;         // 0x0038(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	class UBlendSpace*                                 BlendSpace_09_62_CD033C284CE033797C0967A96FA1EF89;         // 0x0040(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	class UBlendSpace*                                 BlendSpace_10_63_EE25AAAD4BC380FA97285B955AB7C3BD;         // 0x0048(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

	void AfterRead();
	void BeforeDelete();

};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
