#pragma once

// Name: SoT, Version: 2.3.0


/*!!DEFINE!!*/

/*!!HELPER_DEF!!*/

/*!!HELPER_INC!!*/

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
//---------------------------------------------------------------------------
// Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_BlendSpace1DVariants.BP_BlendSpace1DVariants
// 0x0050
struct FBP_BlendSpace1DVariants
{
	class UBlendSpace1D*                               BlendSpace_01_64_0C261F9545659CFDCCC15C9F19F605D0;         // 0x0000(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	class UBlendSpace1D*                               BlendSpace_02_65_86F16A704B9D91C037463CAE6E55D103;         // 0x0008(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	class UBlendSpace1D*                               BlendSpace_03_66_822937EA44B18E9DE6C97D944A8C7D52;         // 0x0010(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	class UBlendSpace1D*                               BlendSpace_04_67_4390C2994A1567F81C23E0B20D619514;         // 0x0018(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	class UBlendSpace1D*                               BlendSpace_05_68_B709F8F540F3BD760DD86F9543EAE154;         // 0x0020(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	class UBlendSpace1D*                               BlendSpace_06_69_7BA8111B43AF8C05E1517A9CF35DC4D1;         // 0x0028(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	class UBlendSpace1D*                               BlendSpace_07_70_6EEEA5BF4DD46B694C96C59781612970;         // 0x0030(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	class UBlendSpace1D*                               BlendSpace_08_71_CF0F9A0949DC7030129551B1CDC49113;         // 0x0038(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	class UBlendSpace1D*                               BlendSpace_09_72_CD033C284CE033797C0967A96FA1EF89;         // 0x0040(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	class UBlendSpace1D*                               BlendSpace_10_73_EE25AAAD4BC380FA97285B955AB7C3BD;         // 0x0048(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

	void AfterRead();
	void BeforeDelete();

};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
