#pragma once

// Name: SoT, Version: 2.2.1.1


/*!!DEFINE!!*/

/*!!HELPER_DEF!!*/

/*!!HELPER_INC!!*/

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
//---------------------------------------------------------------------------
// Classes
//---------------------------------------------------------------------------

// AnimBlueprintGeneratedClass BP_Humanoid_FirstPerson.BP_Humanoid_FirstPerson_C
// 0x182C9 (FullSize[0x1AC99] - InheritedSize[0x29D0])
class UBP_Humanoid_FirstPerson_C : public UFirstPersonAnimationInstance
{
public:
	struct FPointerToUberGraphFrame                    UberGraphFrame;                                            // 0x29D0(0x0008) (ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                              AnimGraphNode_Root_D0188A614D143FB7821BC9B3CCA7655C;       // 0x29D8(0x0048)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_2B8700FB4F8D370CE8590D99226C071C; // 0x2A20(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_129FE3024D442BFB00CF33AD59DB42E7; // 0x2AB0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_948AA19D4BBB26DE46D6F68AF0632D40; // 0x2AF0(0x0040)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_7DBB79E4444F18C00CFDD7ADF5C641C7; // 0x2B30(0x0048)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_C156E52048447FFB87EC07A8137FDC76; // 0x2B78(0x0048)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_8E6667E84202C651009EC68662D42034; // 0x2BC0(0x0048)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_28B2F24E47E6D3C18AEA81846281D7E0; // 0x2C08(0x0048)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_2B4A8ADF431650833CDDB3927BF5EF47; // 0x2C50(0x0048)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_E9951E0C45CA7B3A40F1CEA234CE79F2; // 0x2C98(0x0048)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_FE0684FA4DA5B73D4467C38655260D49; // 0x2CE0(0x0048)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_9CD9B4E44081175D8066C99FEABD575B; // 0x2D28(0x00A0)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_1A10FD3243E979D42CB92A9E0389C99A; // 0x2DC8(0x0070)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_577F1696465934275E74F6AFC6058707; // 0x2E38(0x0050)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_F2A6A00042396DF212C52FAA8705B9AA; // 0x2E88(0x00B0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_B4D1EFE4481D2C843B7A31ABD02DA5B7; // 0x2F38(0x00B0)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_A3C480144612CFBAE0DE2D82CC901541; // 0x2FE8(0x00A0)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_29ACD86045A3D644E2F06780D22FCF70; // 0x3088(0x0070)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_7B6B2E8243531812A43AC695DD2D4695; // 0x30F8(0x0050)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_777B7581432DB72AAC7AE0B7DB4182B4; // 0x3148(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_FF2E30AE470566A6EE0A99995C40BF74; // 0x3190(0x00A8)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_1A084AFE4178CB4E0AD3CB9CD222C27E; // 0x3238(0x0070)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_7BFD74D44C548AC8CEE02CB3AE486F0D; // 0x32A8(0x0070)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_1C7E4DA545A0A63D0A7423A3FDA2D431; // 0x3318(0x0050)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_F165A49C4CA138DCFCF69DBB3F83541C; // 0x3368(0x0050)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_3B249D6E479FA946B34141903D1CBFB0; // 0x33B8(0x00C0)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_BE1161194E27CD1CC32B62B670B372A8; // 0x3478(0x0050)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_F368A7F24F506C771BD82C95752E325A; // 0x34C8(0x0050)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_4D1B47F34381B8AE4E27CBAF554168A5; // 0x3518(0x0050)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_36F5984B49D837B85137C49FC9A9D17B; // 0x3568(0x0050)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_DB01F11D48F268904277C9ADA2A9901C; // 0x35B8(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_06E2CB1F434A1E99FFCCFFB90CBE492F; // 0x3600(0x00A8)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_8EA8C45F40931A31D46406AB429D0C1D; // 0x36A8(0x0050)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_B8D1E2154FA5AC99B3E64FA52EE07EC1; // 0x36F8(0x0050)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_3202085A40AD5E0620EF6D9C6D5E3616; // 0x3748(0x00C0)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_026EDE994444DC429291CD97E00E8BEB; // 0x3808(0x0050)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_46D571D0486B8F37BE908088A724C9BE; // 0x3858(0x0050)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_BE271CFE4BFA90BF3160E685A1A20241; // 0x38A8(0x0050)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_83B7F5534C077447DA94E087915D6503; // 0x38F8(0x0050)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_BFB85F1345EBB8F3FC4622BA43CB4367; // 0x3948(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_90F33FA84C5AB34A48B12F996703BEDE; // 0x3990(0x00A8)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_DDE6B56447B642ACB11217A5006B1FB3; // 0x3A38(0x0090)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_6D7BA53247CC9BEC955ABBB519359F68; // 0x3AC8(0x00A0)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_D0EC7340490F4016C6018CBE68F596D2; // 0x3B68(0x0090)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_64B9A7DD438218B1339E0DA17224AF33; // 0x3BF8(0x00B0)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_34E8653443F400DD7BCA0BACEA3F37AE; // 0x3CA8(0x0090)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_4AAE2E5140E335DCB6C2358F14E4D8CA; // 0x3D38(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_0065DD5E4AEF508DCC1F40A6FE280D8D2; // 0x3D78(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_F2B9CC8E4A873043809F748F674D371B2; // 0x3DB8(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_64C97D8240BFB5D45B3CDFB5A21E685B2; // 0x3DF8(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_1391AB0C4353FB8672072CB0372E2D142; // 0x3E38(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_D5FD9B2F4908D15B6512CB98AFC7EC6D2; // 0x3E78(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_1DB962564495322F1D6E0299F8D5F9772; // 0x3EB8(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_C9B0F834472B6D6E6D928C92CE64DDF12; // 0x3EF8(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_9F7DAEBC498F8AA46442A295D52A4EEA2; // 0x3F38(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_1AE3662640E5D930EC691DADD7A379142; // 0x3F78(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_EB40443F4CC91A18E7F2FD9A3DCF649B2; // 0x3FB8(0x0040)
	struct FAnimNode_RefPose                           AnimGraphNode_IdentityPose_BBAC39AC417A417A082A369EC48EF7F82; // 0x3FF8(0x0038)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_DE0764E24580DA5A2D31909098420BA52; // 0x4030(0x0048)
	struct FAnimNode_RefPose                           AnimGraphNode_IdentityPose_5EA9047F48637B1836BC13872F24C2AA2; // 0x4078(0x0038)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_E2463EE945357D91B4C6F5BE69AF9FEA2; // 0x40B0(0x00B0)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_147F3E5D4D4EF17A1207CAB46616F3422; // 0x4160(0x0110)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_4A7645DF4004B0B784EB04BD9138BE002; // 0x4270(0x0048)
	struct FAnimNode_RefPose                           AnimGraphNode_IdentityPose_0209655042582D3B23F30BA10E5C3C1F2; // 0x42B8(0x0038)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_2B7EB5DB4E43198D2E91019FDA98C28E2; // 0x42F0(0x00B0)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_8F294C4E41E3232362E06EB316D882E52; // 0x43A0(0x0110)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_D276690B4999C12EBBF5D5B7887A4AED2; // 0x44B0(0x0048)
	struct FAnimNode_RefPose                           AnimGraphNode_IdentityPose_A72A6D4F4DE8091D74C244BE072984B52; // 0x44F8(0x0038)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_8B0B956B45275F9943F82682CD2989FA2; // 0x4530(0x00B0)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_BF606ECF42C724A8FCBF29AF2025431E2; // 0x45E0(0x0110)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_2303FA6A43655D7344FED09C44548E082; // 0x46F0(0x0048)
	struct FAnimNode_RefPose                           AnimGraphNode_IdentityPose_2071F87043470355B527FBA89ADC7A542; // 0x4738(0x0038)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_033A7878495D52DD0E1606A0079100032; // 0x4770(0x00B0)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_23E534104A87F765C276ECAE687C40FE2; // 0x4820(0x0110)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_5FEA9B714AABE4087F76A483C163F72F2; // 0x4930(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_C2FCCC4A4E7507A6B362EC94FEFCA83A2; // 0x4978(0x0040)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_B6777B174C0354E5F56ACC857A02B25C; // 0x49B8(0x00A8)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_231659A64A088E473D440A9C5B8A87F9; // 0x4A60(0x00B0)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_F900935F49D992230DD78B8AFDC87012; // 0x4B10(0x0070)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_FA9D62B442CAC6470510759CC47028BA; // 0x4B80(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_927CB34045C3A632F15D3A87C93E8882; // 0x4BC0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_79EAD2674E9004B0943CE99382032BB3; // 0x4C00(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_B28A44EA43484CF3CAA41B9D0A1466F9; // 0x4C40(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_7DBF6FFF4FABF7A1FB5D54AFB78C34B3; // 0x4C80(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_753E6A3C4E2B9ADDBF7DE6A2F37B4149; // 0x4CC0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_AB3262B1482BEF0F8EB5EA8DED3AA27E; // 0x4D00(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_C1B654AE48446548146379A0ADA342A5; // 0x4D40(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_94D232914CE207A62C243DABF29B1D39; // 0x4D80(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_D49029824FFABD54055266A4B1D0F078; // 0x4DC0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_7F5409A74D39BAAE12B073AEAD11C830; // 0x4E00(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_0393B7734364FB279A07BE8DD4E26B32; // 0x4E40(0x0040)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_81AE75D943BEE0611AADAF96519B79F8; // 0x4E80(0x0110)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_E105872B47A850DA5C0E0BA4DF987AA9; // 0x4F90(0x0048)
	struct FAnimNode_RefPose                           AnimGraphNode_IdentityPose_605B167D4104185D2B3964A24CF41E92; // 0x4FD8(0x0038)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_3839F7E14129DC8756D436B3A173A97D; // 0x5010(0x0048)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_820D617B441B04665F9DB4A864DDAE30; // 0x5058(0x00B0)
	struct FAnimNode_RefPose                           AnimGraphNode_IdentityPose_2414FD2A4C9A5AA676DB4E951A73E5C6; // 0x5108(0x0038)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_27E78F814A610563337C299CDC625C0B; // 0x5140(0x0110)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_1BA077CA47D946B39F36FC81806A0EB5; // 0x5250(0x0048)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_72D46F714D55C230DC4464A3BC9E7B55; // 0x5298(0x00B0)
	struct FAnimNode_RefPose                           AnimGraphNode_IdentityPose_2CED4B3143C99B8CBDBA079CAE7376A0; // 0x5348(0x0038)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_DF8030724C0B3E88EB5945B61A276B65; // 0x5380(0x0110)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_3E586B9048B5B51BB773DCA45D16985D; // 0x5490(0x0048)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_07069C9443BEB11D4085E5A234862D72; // 0x54D8(0x00B0)
	struct FAnimNode_RefPose                           AnimGraphNode_IdentityPose_EDE1A19541714B467DB4AD9288E64751; // 0x5588(0x0038)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_5218ABC940DE9A2A8C531BAE965970BB; // 0x55C0(0x0110)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_F7A9A7E4413865A4757C078B26ADD1E4; // 0x56D0(0x0048)
	struct FAnimNode_RefPose                           AnimGraphNode_IdentityPose_76D380754989701A9BEE7C86DC27E3E5; // 0x5718(0x0038)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_983A065D44F2D1BF202A8091B1EC744F; // 0x5750(0x00B0)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_CA0F377A46DE783A714451978F294EE7; // 0x5800(0x0110)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_4A36B9EE48DDFB6C90FC0CA953419F87; // 0x5910(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_8C44C6B442F66F9F1C4808B957DA9D49; // 0x5958(0x0040)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_6D18536C4D6C5E74D11E4EA59800712A; // 0x5998(0x00A8)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_43F88B8B4E331B31A852D490FA8759C6; // 0x5A40(0x00B0)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_0065DD5E4AEF508DCC1F40A6FE280D8D; // 0x5AF0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_F2B9CC8E4A873043809F748F674D371B; // 0x5B30(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_64C97D8240BFB5D45B3CDFB5A21E685B; // 0x5B70(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_1391AB0C4353FB8672072CB0372E2D14; // 0x5BB0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_D5FD9B2F4908D15B6512CB98AFC7EC6D; // 0x5BF0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_1DB962564495322F1D6E0299F8D5F977; // 0x5C30(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_C9B0F834472B6D6E6D928C92CE64DDF1; // 0x5C70(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_9F7DAEBC498F8AA46442A295D52A4EEA; // 0x5CB0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_1AE3662640E5D930EC691DADD7A37914; // 0x5CF0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_EB40443F4CC91A18E7F2FD9A3DCF649B; // 0x5D30(0x0040)
	struct FAnimNode_RefPose                           AnimGraphNode_IdentityPose_BBAC39AC417A417A082A369EC48EF7F8; // 0x5D70(0x0038)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_DE0764E24580DA5A2D31909098420BA5; // 0x5DA8(0x0048)
	struct FAnimNode_RefPose                           AnimGraphNode_IdentityPose_5EA9047F48637B1836BC13872F24C2AA; // 0x5DF0(0x0038)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_E2463EE945357D91B4C6F5BE69AF9FEA; // 0x5E28(0x00B0)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_147F3E5D4D4EF17A1207CAB46616F342; // 0x5ED8(0x0110)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_4A7645DF4004B0B784EB04BD9138BE00; // 0x5FE8(0x0048)
	struct FAnimNode_RefPose                           AnimGraphNode_IdentityPose_0209655042582D3B23F30BA10E5C3C1F; // 0x6030(0x0038)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_2B7EB5DB4E43198D2E91019FDA98C28E; // 0x6068(0x00B0)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_8F294C4E41E3232362E06EB316D882E5; // 0x6118(0x0110)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_D276690B4999C12EBBF5D5B7887A4AED; // 0x6228(0x0048)
	struct FAnimNode_RefPose                           AnimGraphNode_IdentityPose_A72A6D4F4DE8091D74C244BE072984B5; // 0x6270(0x0038)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_8B0B956B45275F9943F82682CD2989FA; // 0x62A8(0x00B0)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_BF606ECF42C724A8FCBF29AF2025431E; // 0x6358(0x0110)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_2303FA6A43655D7344FED09C44548E08; // 0x6468(0x0048)
	struct FAnimNode_RefPose                           AnimGraphNode_IdentityPose_2071F87043470355B527FBA89ADC7A54; // 0x64B0(0x0038)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_033A7878495D52DD0E1606A007910003; // 0x64E8(0x00B0)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_23E534104A87F765C276ECAE687C40FE; // 0x6598(0x0110)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_5FEA9B714AABE4087F76A483C163F72F; // 0x66A8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_C2FCCC4A4E7507A6B362EC94FEFCA83A; // 0x66F0(0x0040)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_12BDB6FD4D208047E9B269ABFD8784D6; // 0x6730(0x00A8)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_835549A04AD123C31FAC48A395B42963; // 0x67D8(0x00A0)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_7F8FF6BF45A0241923039ABFF878B327; // 0x6878(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_3B9D140B462925B0F74A51B6095F5895; // 0x68B8(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_D743353D417980747A3FD989D345634E; // 0x68F8(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_7C8F9A914B30A2B8AD134A91FDF60E6D; // 0x6938(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_FAA7A9C042B877260702C0910C2592EC; // 0x6978(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_0A995FA8445AE1C9F5F13A8CC5E17317; // 0x69B8(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_B0BF7B09421E1B2C550E36900E73EE61; // 0x69F8(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_7C73E2DD49BAA2E326CC6DA891D667D9; // 0x6A38(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_825FA43542896E7C744853B7CAA3AC15; // 0x6A78(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_73BA2333404B0B2ED23A46BC6104482A; // 0x6AB8(0x0040)
	struct FAnimNode_RefPose                           AnimGraphNode_IdentityPose_FF21551B4E429025ECF2158CFE876BF4; // 0x6AF8(0x0038)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_68F1478E4869B35B0A4016802C82E4E0; // 0x6B30(0x0048)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_2472EA954528905CFE3FBDA1883F4220; // 0x6B78(0x0110)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_B97BA5314A764371437E6E95047832DE; // 0x6C88(0x0048)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_58AC7D7D4840BACD91C450980BC64658; // 0x6CD0(0x0110)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_8AE142E3464968BE1D7140A5418989C3; // 0x6DE0(0x0048)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_14FA8C97492E9C23A67144B399259131; // 0x6E28(0x0110)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_40223A3E45CF753E3FC525B5192E9940; // 0x6F38(0x0048)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_90B3EC8C4D1FF150CEEDB8A6A4B67A84; // 0x6F80(0x0110)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_D115A27D44BCB6DDA386DBBFA782AAB4; // 0x7090(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_EEDFBC5141BA8C728907FB8983991822; // 0x70D8(0x0040)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_908601F64069338B174BD98079C75920; // 0x7118(0x00A8)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_5FB19FA546D27AE09032E1AB1DF7B81C; // 0x71C0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_0833243B484BF8A5A885A4A487AD523F; // 0x7200(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_9E81F00C48DB5EF417A6F3B6724894D5; // 0x7240(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_2D8743B941245A68EC2BE18E733CD1F3; // 0x7280(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_F90D88F441D23528E644D3BBD58930A1; // 0x72C0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_B0150BD349A4D2837B6C84B18CD6BEF0; // 0x7300(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_67B9A90348EC7B69EE973FBDC9FFCA98; // 0x7340(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_23C1957B4FB54DC48407F98B0C642CA8; // 0x7380(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_377B03FB4F35ED33391BEA97A45241ED; // 0x73C0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_CF8568B748E2986D61BB44BEE9B49F7D; // 0x7400(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_53656A0C401E9D8814612F88AE19B3D8; // 0x7440(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_88F58F3049D75D378863E28B3E0BA04A; // 0x7480(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_C85E32F845370E2C29BE8B9F2B5E7B66; // 0x74C0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_2999983B4EA442EDF693CCB20E8CA34C; // 0x7500(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_4FC8234F4B54F1E3DF1012A5D3E1C031; // 0x7540(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_82903E584D7994295D3ABE912B31B4CF; // 0x7580(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_AA15013E475FC7D90CB4E7BE15B3EACC; // 0x75C0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_BB2A78A0401E119194337BA137C9DFCA; // 0x7600(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_CABDB43844276933954B329B5CD68721; // 0x7640(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_3C9618FD48D5C1D72329CC87DC29C62D; // 0x7680(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_6CE308734868F8556F0EE280BCEF76A5; // 0x76C0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_D0E26E044BE13D47200272AFD5027EF6; // 0x7700(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_E5DA758B42DD8E0375F06AA87F87ECA1; // 0x7740(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_E355EAEA44B670AD0C08D3958BAD2E43; // 0x7780(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_9227BEAF434D71A92A821AB34528F938; // 0x77C0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_1B79AE4340FBED309AA867A201CAEBA7; // 0x7800(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_C846B9834D450482A3DCF5BC18124F88; // 0x7840(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_77DF910242FB159533AFC694EB125B5D; // 0x7880(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_F91E008443A5138B592211B4B1AA9753; // 0x78C0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_88137F364C1010F700BD2B933548D6B6; // 0x7900(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_47FE7632495346574D701A8404459F74; // 0x7940(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_7421B970447C29586D0840936C0CC174; // 0x7980(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_9FB2171E4CC4B457E3E450A9CB895B4C; // 0x79C0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_E249442D47798C3780AF45BC524A461D; // 0x7A00(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_5A7FEE6245CDA017C2DE728A6E606BAB; // 0x7A40(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_A42D9EB744B6CE804DBD17B41AD5B0B0; // 0x7A80(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_C2AF3EBE4F7779C9447545A0070EDEC5; // 0x7AC0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_1D8ACD3E4B3A4414599F51804A2D3CB5; // 0x7B00(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_7E1E4E234CD33A25A3376D8A1CE7AADF; // 0x7B40(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_78B60FE64A3193A552B77FABBE24879D; // 0x7B80(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_2C41E5444671247CFC43089359A9C3A4; // 0x7BC0(0x0040)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_1D266A3A48A11EB54E5BC982F2DF42CE2; // 0x7C00(0x0050)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_B3C4786147F23DBB2CF25DBC1D7928E02; // 0x7C50(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_6DB4505C4BE81D2795ACD4BA9A5CD4F3; // 0x7C98(0x0060)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_855265224C0A9D1588C031A5AC42D2EF2; // 0x7CF8(0x0048)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_5D0B4AA44D57A7E699147A8DF4AA3019; // 0x7D40(0x0048)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_1D266A3A48A11EB54E5BC982F2DF42CE; // 0x7D88(0x0050)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_B3C4786147F23DBB2CF25DBC1D7928E0; // 0x7DD8(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_E6DD9CB64B1DB8B2D4D14E8D618644D5; // 0x7E20(0x0060)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_855265224C0A9D1588C031A5AC42D2EF; // 0x7E80(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_D48B85784FC9BC3E7656918A7D131427; // 0x7EC8(0x00A8)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_530FCD1F4CD0EC037202378EBDE069E5; // 0x7F70(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_F94E19314E0CD83DA8A635BE5AB9F6C1; // 0x7FB8(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_A4DE63384BB77EEC9DB6958AB553ED782; // 0x7FF8(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_8A8B9C6042CD54DEA3016E8AA179CDF12; // 0x8038(0x0040)
	struct FAnimNode_BlendSpaceEvaluator               AnimGraphNode_BlendSpaceEvaluator_354B7E1748FD48564DDA9E88BF48B6CE4; // 0x8078(0x0118)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_CA6FBE0D41DF50A139C980A9A00171134; // 0x8190(0x0050)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_A16B6D2C4F86CF7288F42A9A79E77A914; // 0x81E0(0x00B0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_298B2DA24BBE3970D77005A68EB996864; // 0x8290(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_0BBBD3294522C0360562E0B2BA18C8204; // 0x82D8(0x0060)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_0E75DC00456D8063B288DFA515EFA4584; // 0x8338(0x00B0)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_B913233D4FF0FE7DE5E3A9AD11655CC74; // 0x83E8(0x0110)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_1F3670BF4DF49D6A32F5E9A5079D01D74; // 0x84F8(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_85F03AA44021DFCD657344B45DE7A545; // 0x8540(0x00A8)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_1AFE32DA435CB3BFE966FEB9E0CCC87F; // 0x85E8(0x00B0)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_9EA549074A41692C0A50B89BFF35B7CB2; // 0x8698(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_1837F7E2458E0174C122228E1B8F1F8B2; // 0x86D8(0x0040)
	struct FAnimNode_BlendSpaceEvaluator               AnimGraphNode_BlendSpaceEvaluator_354B7E1748FD48564DDA9E88BF48B6CE3; // 0x8718(0x0118)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_CA6FBE0D41DF50A139C980A9A00171133; // 0x8830(0x0050)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_A16B6D2C4F86CF7288F42A9A79E77A913; // 0x8880(0x00B0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_298B2DA24BBE3970D77005A68EB996863; // 0x8930(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_0BBBD3294522C0360562E0B2BA18C8203; // 0x8978(0x0060)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_0E75DC00456D8063B288DFA515EFA4583; // 0x89D8(0x00B0)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_B913233D4FF0FE7DE5E3A9AD11655CC73; // 0x8A88(0x0110)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_1F3670BF4DF49D6A32F5E9A5079D01D73; // 0x8B98(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_A4934082473096F29A9631A2A2F2B713; // 0x8BE0(0x00A8)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_4BE75D2345E32297CF247991DE2184B2; // 0x8C88(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_BA157C6A449B8FD13B0E1BB6CF82C8D3; // 0x8CD0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_321F5E074A5EEB41CF881D82958253104; // 0x8D10(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_0FC3515F4489411B54B44FBE600E70E44; // 0x8D50(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_6EB02F5F473A20C0EC5E4A9CA96E741E4; // 0x8D90(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_901288274FAD069F1203EAA2C7DDAD464; // 0x8DD0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_612C4B1C41B908993D2FBDBE499D46DB4; // 0x8E10(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_619D88B74C56AF22B4A19B9772AAFCAF4; // 0x8E50(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_A69CC76C4D46CF5FFD3155A1AB55C8C34; // 0x8E90(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_717283874E19F474AA87639B5CC447EC4; // 0x8ED0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_AE9CFB9F4AF3E48FE63BA29EACAA3C634; // 0x8F10(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_4D0F0E1741BD56DEC62329AED5CF60684; // 0x8F50(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_524973E142F9DC80DBA501AA0CAD65F2; // 0x8F90(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_078EA53C49F615AC045A679CDD584CBD4; // 0x8FD0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_03ABDF4A4345AEA30888E184C7275C524; // 0x9010(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_B8424F4C41A89D9FE7BA8F9FCD4F3AF64; // 0x9050(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_3CE96BE84A7997C5AE4A3CA1CC11DF024; // 0x9090(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_77CAF299498195803A6C4D877AD495DD4; // 0x90D0(0x0040)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_B349BEFD4CEEC950D0D3029C3A63ECB48; // 0x9110(0x0110)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_8814C1924FAE3D0945361FAFAF902C158; // 0x9220(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_B1F3EC9341AE1490D8BFC6AD1B4AA77E2; // 0x9268(0x0060)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_85CC058C4E205D23A3AE59AA2A869ED08; // 0x92C8(0x0048)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_C38E30914794A343BA467D8367B0A5714; // 0x9310(0x0110)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_1E9313124C7B1D6EC04EF4B6A36B223012; // 0x9420(0x0048)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_653B2A904F3734DBDF1893A7B6FC41DC8; // 0x9468(0x0110)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_1E9313124C7B1D6EC04EF4B6A36B223011; // 0x9578(0x0048)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_EF99854B44E1FFAEFFA05E9CC30E1E0C4; // 0x95C0(0x0110)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_B747C86944D3DEA7EE3E05AF827EC87E4; // 0x96D0(0x0048)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_B349BEFD4CEEC950D0D3029C3A63ECB47; // 0x9718(0x0110)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_8814C1924FAE3D0945361FAFAF902C157; // 0x9828(0x0048)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_AC6A2B3B4511958EEBE8C2988B40E07A4; // 0x9870(0x0048)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_653B2A904F3734DBDF1893A7B6FC41DC7; // 0x98B8(0x0110)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_1E9313124C7B1D6EC04EF4B6A36B223010; // 0x99C8(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_E7253AC542D855C67787FE94A7342D3D2; // 0x9A10(0x0060)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_604441324C983CCBC4D71FA5CDDA95F14; // 0x9A70(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_E8F4E0154C3A61E77287319E5019A3A22; // 0x9AB8(0x0060)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_85CC058C4E205D23A3AE59AA2A869ED07; // 0x9B18(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_262E19A845E59B26391C01AF0C6ADFF0; // 0x9B60(0x00A8)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_D934D2D14EE00B1D4822E588E5576336; // 0x9C08(0x00B0)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_22CB95BB4490C8C3F12849B611F4A2E5; // 0x9CB8(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_321F5E074A5EEB41CF881D82958253103; // 0x9CF8(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_0FC3515F4489411B54B44FBE600E70E43; // 0x9D38(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_6EB02F5F473A20C0EC5E4A9CA96E741E3; // 0x9D78(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_901288274FAD069F1203EAA2C7DDAD463; // 0x9DB8(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_612C4B1C41B908993D2FBDBE499D46DB3; // 0x9DF8(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_619D88B74C56AF22B4A19B9772AAFCAF3; // 0x9E38(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_A69CC76C4D46CF5FFD3155A1AB55C8C33; // 0x9E78(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_717283874E19F474AA87639B5CC447EC3; // 0x9EB8(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_AE9CFB9F4AF3E48FE63BA29EACAA3C633; // 0x9EF8(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_4D0F0E1741BD56DEC62329AED5CF60683; // 0x9F38(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_1C7AC12F40AEE7106FB86FB089C16D26; // 0x9F78(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_078EA53C49F615AC045A679CDD584CBD3; // 0x9FB8(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_03ABDF4A4345AEA30888E184C7275C523; // 0x9FF8(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_B8424F4C41A89D9FE7BA8F9FCD4F3AF63; // 0xA038(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_3CE96BE84A7997C5AE4A3CA1CC11DF023; // 0xA078(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_77CAF299498195803A6C4D877AD495DD3; // 0xA0B8(0x0040)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_B349BEFD4CEEC950D0D3029C3A63ECB46; // 0xA0F8(0x0110)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_8814C1924FAE3D0945361FAFAF902C156; // 0xA208(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_B1F3EC9341AE1490D8BFC6AD1B4AA77E; // 0xA250(0x0060)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_85CC058C4E205D23A3AE59AA2A869ED06; // 0xA2B0(0x0048)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_C38E30914794A343BA467D8367B0A5713; // 0xA2F8(0x0110)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_1E9313124C7B1D6EC04EF4B6A36B22309; // 0xA408(0x0048)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_653B2A904F3734DBDF1893A7B6FC41DC6; // 0xA450(0x0110)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_1E9313124C7B1D6EC04EF4B6A36B22308; // 0xA560(0x0048)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_EF99854B44E1FFAEFFA05E9CC30E1E0C3; // 0xA5A8(0x0110)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_B747C86944D3DEA7EE3E05AF827EC87E3; // 0xA6B8(0x0048)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_B349BEFD4CEEC950D0D3029C3A63ECB45; // 0xA700(0x0110)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_8814C1924FAE3D0945361FAFAF902C155; // 0xA810(0x0048)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_AC6A2B3B4511958EEBE8C2988B40E07A3; // 0xA858(0x0048)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_653B2A904F3734DBDF1893A7B6FC41DC5; // 0xA8A0(0x0110)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_1E9313124C7B1D6EC04EF4B6A36B22307; // 0xA9B0(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_E7253AC542D855C67787FE94A7342D3D; // 0xA9F8(0x0060)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_604441324C983CCBC4D71FA5CDDA95F13; // 0xAA58(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_E8F4E0154C3A61E77287319E5019A3A2; // 0xAAA0(0x0060)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_85CC058C4E205D23A3AE59AA2A869ED05; // 0xAB00(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_3F8381D148F79CE227F465BCFB3CCF02; // 0xAB48(0x00A8)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_E32023BE42D41DA4AF198AA9ABC514AD; // 0xABF0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_F2779A63495AD4F9CB0096A9BD0A5B04; // 0xAC38(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_4AEDF4A34C2D61E89D2A79B639639BBC; // 0xAC78(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_4ADAC28340C232BA114903B64F558288; // 0xACB8(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_6F7A2C97433D404A4DC998977370830D; // 0xACF8(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_5D448F914566A1826C8759B2A4ADC813; // 0xAD38(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_929CB34C4E7D7A6E85D33A8BFBDF1104; // 0xAD78(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_C4D1AF754F6F49E7A2E9C1AA55EC9F17; // 0xADB8(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_88DE6BA941BCF838BDEACF97FFA3B2B7; // 0xADF8(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_BFA3BA424330A22F9116B099C00F9E0E; // 0xAE38(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_21FA0B324134F386F56F1AA2D09BCE0C; // 0xAE78(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_D0918438400B4C872E957AB5B5A2E428; // 0xAEB8(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_0D7D9EB641B60405F0301C9017BFA0E6; // 0xAEF8(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_7B2D7522499CE15FFCE5A19C7B55CCC5; // 0xAF38(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_371B571E4C7C9B4680137982B282C2C6; // 0xAF78(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_5A1BED85468CE1BAACAF0E9AC9CC8B69; // 0xAFB8(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_38E73C4946C2EAAABD54218217C56776; // 0xAFF8(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_3B1CEA8741F54CB0F8C9848D92A89C08; // 0xB038(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_FEDAC5C3463DB2532C5C1B9382F3EFCD; // 0xB078(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_E478629049A73E37FF02C3B4079EDF27; // 0xB0B8(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_395F39C942B943AF47CB8F976B8B6FC5; // 0xB0F8(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_8770D8C44F091D874E3570837632B5A1; // 0xB138(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_B0499B5341D5C49D92A21BB7EEE06016; // 0xB178(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_7487F2514542162ED8A59DB5A4EB533D; // 0xB1B8(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_72DAAD874BA28218D7322186245E07A6; // 0xB1F8(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_7302C5814CEA884CBC62EA96EA6FFC71; // 0xB238(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_5E441013463E9B447EC22BA1B139DB09; // 0xB278(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_54FAF9EF46AA99D86C23E0BCF320A6C3; // 0xB2B8(0x0040)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_18DC795D46D4AB8F17C4C1B75BA72746; // 0xB2F8(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_D776BA4D4F4B76E397214DA2E0AF6A9C; // 0xB3A8(0x0060)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_E6D9B0F84C4ABDE01FDFC0BD5B907134; // 0xB408(0x0060)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_11154144442F942724230E8443DE5E0D; // 0xB468(0x0048)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_3ACD4F774A7DD0E475EE65ACC34B7ACA; // 0xB4B0(0x0110)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_533F33EC44E6722B4A905C96817524FA; // 0xB5C0(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_D11ADE8C447A43923AE44494A9CEFD93; // 0xB608(0x0060)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_253496AD466EE83BAAAFF39AF64B9F67; // 0xB668(0x0070)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_2E0E66A9497A30F778A8A9810E3CE9B2; // 0xB6D8(0x0110)
	struct FAnimationNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_B34A5EB94F6FFD6E10F271910C84C2DE; // 0xB7E8(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_CBDF7E9F44DEBDCDC600F59EC664CFCE; // 0xB858(0x0060)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_239AD8F84B7916B83C664789C4C98839; // 0xB8B8(0x0110)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_134EAC7A497DBC89B94DE49B4356F2F5; // 0xB9C8(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_BDE953394233401A3684D2A9973C0E57; // 0xBA38(0x0048)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_C32BEC5A4A6B999400655180B790A1EC; // 0xBA80(0x0110)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_0FF8C987496F87646C4226A4580FE982; // 0xBB90(0x0048)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_7238CDEB45A05FF44D9612A1B5E577AE; // 0xBBD8(0x0050)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_287702E64055739589A1A2BCEF7D7D41; // 0xBC28(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_FF5730374914F2F6AB37429DA0514326; // 0xBC70(0x0060)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_420953DA45105C6D078EC8B71C8EDA3C; // 0xBCD0(0x0048)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_1AFB12A8465A366168751E85150E55C5; // 0xBD18(0x0070)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_BB2E6A864FD138E3A1FC35BA163266F0; // 0xBD88(0x0110)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_AA3FA92C40B6405AC23BE8B06FFE52BC; // 0xBE98(0x0110)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_4764F7834BDE951FC33B489C02672DAC; // 0xBFA8(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_2E533A11424DA679C19233934C61C52A; // 0xBFF0(0x0060)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_D222BEC4446305B0F3AA0CA10AC19DC6; // 0xC050(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_2B10445F43F89B0CFF512DB3E4405A53; // 0xC098(0x0060)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_AF5D5CD641C97635249D6B9E0FCA2F98; // 0xC0F8(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_C5F815F14E886B88AB306088EC0D81B5; // 0xC140(0x0060)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_042C1F65474FAE5F7C9A5C8D505013E7; // 0xC1A0(0x0048)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_10BD25514F2554FB84554892E6938FE1; // 0xC1E8(0x0110)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_6239FC494462BE90F371818CD0B76343; // 0xC2F8(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_B1DCEF0046C95F33E14C078EC0B364E0; // 0xC340(0x0060)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_C04E42FB4CC41DF81EB1DDA56ACE77A6; // 0xC3A0(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_7FD527104FC788A6C9D7E7B708C4368A; // 0xC3E8(0x00A8)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_9E6B0B2448F36E99FC4D78A287D663BE; // 0xC490(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_C84F9E64416A8A636068BDB8DADB7F1D; // 0xC4D8(0x0060)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_913FCFF3430879158290AABA9E96D40F; // 0xC538(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_89BD283B4F69A10535F5159E4CFAB212; // 0xC5E8(0x0060)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_1E6B1DB44459A98DEF5F059A178A8EAB; // 0xC648(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_FFCA7B1E42D52FF658E3DBB275B792892; // 0xC690(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_A22B58A746CE63E1F695809768479B3D2; // 0xC6D0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_C8A65B5945E9BBAE51334B891812DA382; // 0xC710(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_AA661F9F4AD62C72ABBFF98402A055352; // 0xC750(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_4C8B1DD04E6B90A6E84C3EAEA254D36C2; // 0xC790(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_EC2E69204E39DD097F7D77ACE38528D92; // 0xC7D0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_0178D7D3468564C585892E94CACA27992; // 0xC810(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_940184B44514CAC819E27E970184680C2; // 0xC850(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_2389DD79467A5DD71544B48F00A6E01A2; // 0xC890(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_49F26C134FFB0E19B09E2FB3EC674CC32; // 0xC8D0(0x0040)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_25970FB041FAF94111AAF18629169D7A2; // 0xC910(0x0110)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_722706844AFD4F0D01E8969002789C8F2; // 0xCA20(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_E10B89074A435563F15DBCB6835666212; // 0xCA68(0x0060)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_96B075ED4D082A61C62FA8A86C479BAB2; // 0xCAC8(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_CA6F7CA048A818E3818F92BC9E0DC9512; // 0xCB10(0x0060)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_FD0AE57F4B329C9F745C66804CA2AA422; // 0xCB70(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_0B9FEF1A47E0DD3D5BFD798DDFB6E8492; // 0xCC20(0x0060)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_3F01ED8344749D7D6534FBAE8D11C62D4; // 0xCC80(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_04B6525D41FBA19F99340AB3A3E848872; // 0xCCC8(0x0060)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_10D2FB93459F9DB214EB0DA582E302BB2; // 0xCD28(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_38DA7A354EC88E6B560FAAAAB99DF6832; // 0xCDD8(0x0060)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_3F01ED8344749D7D6534FBAE8D11C62D3; // 0xCE38(0x0048)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_E81318B34D8511A80043C2B9D3274D8B2; // 0xCE80(0x0110)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_AB3706D049EAF2AE8839FBAFBC8A1D832; // 0xCF90(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_DFC6BB28457172C7FD7C8FA8A5CBA623; // 0xCFD8(0x00A8)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_241868654BF47C140CEAC4A0D5606E89; // 0xD080(0x00B0)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_FFCA7B1E42D52FF658E3DBB275B79289; // 0xD130(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_A22B58A746CE63E1F695809768479B3D; // 0xD170(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_C8A65B5945E9BBAE51334B891812DA38; // 0xD1B0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_AA661F9F4AD62C72ABBFF98402A05535; // 0xD1F0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_4C8B1DD04E6B90A6E84C3EAEA254D36C; // 0xD230(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_EC2E69204E39DD097F7D77ACE38528D9; // 0xD270(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_0178D7D3468564C585892E94CACA2799; // 0xD2B0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_940184B44514CAC819E27E970184680C; // 0xD2F0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_2389DD79467A5DD71544B48F00A6E01A; // 0xD330(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_49F26C134FFB0E19B09E2FB3EC674CC3; // 0xD370(0x0040)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_25970FB041FAF94111AAF18629169D7A; // 0xD3B0(0x0110)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_722706844AFD4F0D01E8969002789C8F; // 0xD4C0(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_8FB43A15438CFAE2C1C2358E5BD47A1F; // 0xD508(0x0060)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_83A1663A49A352593A7683B737A23506; // 0xD568(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_E10B89074A435563F15DBCB683566621; // 0xD618(0x0060)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_96B075ED4D082A61C62FA8A86C479BAB; // 0xD678(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_CA6F7CA048A818E3818F92BC9E0DC951; // 0xD6C0(0x0060)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_FD0AE57F4B329C9F745C66804CA2AA42; // 0xD720(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_0B9FEF1A47E0DD3D5BFD798DDFB6E849; // 0xD7D0(0x0060)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_3F01ED8344749D7D6534FBAE8D11C62D2; // 0xD830(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_04B6525D41FBA19F99340AB3A3E84887; // 0xD878(0x0060)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_10D2FB93459F9DB214EB0DA582E302BB; // 0xD8D8(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_38DA7A354EC88E6B560FAAAAB99DF683; // 0xD988(0x0060)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_3F01ED8344749D7D6534FBAE8D11C62D; // 0xD9E8(0x0048)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_E81318B34D8511A80043C2B9D3274D8B; // 0xDA30(0x0110)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_AB3706D049EAF2AE8839FBAFBC8A1D83; // 0xDB40(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_3C6AF21E481615F06D5ED1B6D4389651; // 0xDB88(0x00A8)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_B45EE26748B9A2BD872B37A6990C7A22; // 0xDC30(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_6F3CA53249FA1A4310AE2296B768EE26; // 0xDC78(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_5AA90AC04049F02EE336CA9367222670; // 0xDCB8(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_123526EE4144B286DBA741B2FEA6E5B7; // 0xDCF8(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_DCA53CB84E6601BC6FCB9BB03C134C7E; // 0xDD38(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_4206DD574F23C48A98B04DA1C5762873; // 0xDD78(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_5883EEB94A4E9554519AFF82E1878DFB; // 0xDDB8(0x0060)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_C2571E8B454C97BF5277CF9685FF264B; // 0xDE18(0x0048)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_8AB0B9A547B3DC564F83B8B0609A0CBA; // 0xDE60(0x0050)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_9A7340624EF8B0121F02F2A5DA94D2BF; // 0xDEB0(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_5B46034D4F6337B84774A18F56268C76; // 0xDEF8(0x0060)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_2E1DF91E44DE1F1431629A94433F62103; // 0xDF58(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_4F97E19940633CB1E430EEBD9BA05156; // 0xDFA0(0x0060)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_2E1DF91E44DE1F1431629A94433F62102; // 0xE000(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_BC2979964BFEFDFF592C958C7232E1F7; // 0xE048(0x0060)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_75470BC34880395B6DC7AD8DDCBCF387; // 0xE0A8(0x0060)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_195DBAD64442435FE21BBDB88CB0B09F; // 0xE108(0x00C0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_2E1DF91E44DE1F1431629A94433F6210; // 0xE1C8(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_C91B176D425494DF106940875D5A44EE; // 0xE210(0x00A8)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_8EDA082C495F57C37E70AE9403CDA7B5; // 0xE2B8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_A4DE63384BB77EEC9DB6958AB553ED78; // 0xE300(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_8A8B9C6042CD54DEA3016E8AA179CDF1; // 0xE340(0x0040)
	struct FAnimNode_BlendSpaceEvaluator               AnimGraphNode_BlendSpaceEvaluator_354B7E1748FD48564DDA9E88BF48B6CE2; // 0xE380(0x0118)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_CA6FBE0D41DF50A139C980A9A00171132; // 0xE498(0x0050)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_A16B6D2C4F86CF7288F42A9A79E77A912; // 0xE4E8(0x00B0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_298B2DA24BBE3970D77005A68EB996862; // 0xE598(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_0BBBD3294522C0360562E0B2BA18C8202; // 0xE5E0(0x0060)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_0E75DC00456D8063B288DFA515EFA4582; // 0xE640(0x00B0)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_B913233D4FF0FE7DE5E3A9AD11655CC72; // 0xE6F0(0x0110)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_1F3670BF4DF49D6A32F5E9A5079D01D72; // 0xE800(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_7654245D48F0B5A5FF96288EF76E3EDB; // 0xE848(0x00A8)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_8929BBFD4637C461AC6FD8B7F00685CF; // 0xE8F0(0x00B0)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_9EA549074A41692C0A50B89BFF35B7CB; // 0xE9A0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_1837F7E2458E0174C122228E1B8F1F8B; // 0xE9E0(0x0040)
	struct FAnimNode_BlendSpaceEvaluator               AnimGraphNode_BlendSpaceEvaluator_354B7E1748FD48564DDA9E88BF48B6CE; // 0xEA20(0x0118)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_CA6FBE0D41DF50A139C980A9A0017113; // 0xEB38(0x0050)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_A16B6D2C4F86CF7288F42A9A79E77A91; // 0xEB88(0x00B0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_298B2DA24BBE3970D77005A68EB99686; // 0xEC38(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_0BBBD3294522C0360562E0B2BA18C820; // 0xEC80(0x0060)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_0E75DC00456D8063B288DFA515EFA458; // 0xECE0(0x00B0)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_B913233D4FF0FE7DE5E3A9AD11655CC7; // 0xED90(0x0110)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_1F3670BF4DF49D6A32F5E9A5079D01D7; // 0xEEA0(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_4EA7B3EF4C854CE03C90E7A0B4E6F157; // 0xEEE8(0x00A8)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_DCDBE7814E8EC16DCA977DA50927ADE0; // 0xEF90(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_658C61374400EC42B82D2294C882FC0D; // 0xEFD8(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_321F5E074A5EEB41CF881D82958253102; // 0xF018(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_0FC3515F4489411B54B44FBE600E70E42; // 0xF058(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_6EB02F5F473A20C0EC5E4A9CA96E741E2; // 0xF098(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_901288274FAD069F1203EAA2C7DDAD462; // 0xF0D8(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_612C4B1C41B908993D2FBDBE499D46DB2; // 0xF118(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_619D88B74C56AF22B4A19B9772AAFCAF2; // 0xF158(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_A69CC76C4D46CF5FFD3155A1AB55C8C32; // 0xF198(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_717283874E19F474AA87639B5CC447EC2; // 0xF1D8(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_AE9CFB9F4AF3E48FE63BA29EACAA3C632; // 0xF218(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_4D0F0E1741BD56DEC62329AED5CF60682; // 0xF258(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_FBDF6D734799FB2CCE9CB98E5D92EA3E; // 0xF298(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_078EA53C49F615AC045A679CDD584CBD2; // 0xF2D8(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_03ABDF4A4345AEA30888E184C7275C522; // 0xF318(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_B8424F4C41A89D9FE7BA8F9FCD4F3AF62; // 0xF358(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_3CE96BE84A7997C5AE4A3CA1CC11DF022; // 0xF398(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_77CAF299498195803A6C4D877AD495DD2; // 0xF3D8(0x0040)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_B349BEFD4CEEC950D0D3029C3A63ECB44; // 0xF418(0x0110)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_8814C1924FAE3D0945361FAFAF902C154; // 0xF528(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_EB59795A4224F9EFC09FC7BFE39C1C272; // 0xF570(0x0060)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_85CC058C4E205D23A3AE59AA2A869ED04; // 0xF5D0(0x0048)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_C38E30914794A343BA467D8367B0A5712; // 0xF618(0x0110)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_1E9313124C7B1D6EC04EF4B6A36B22306; // 0xF728(0x0048)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_653B2A904F3734DBDF1893A7B6FC41DC4; // 0xF770(0x0110)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_1E9313124C7B1D6EC04EF4B6A36B22305; // 0xF880(0x0048)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_EF99854B44E1FFAEFFA05E9CC30E1E0C2; // 0xF8C8(0x0110)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_B747C86944D3DEA7EE3E05AF827EC87E2; // 0xF9D8(0x0048)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_B349BEFD4CEEC950D0D3029C3A63ECB43; // 0xFA20(0x0110)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_8814C1924FAE3D0945361FAFAF902C153; // 0xFB30(0x0048)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_AC6A2B3B4511958EEBE8C2988B40E07A2; // 0xFB78(0x0048)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_653B2A904F3734DBDF1893A7B6FC41DC3; // 0xFBC0(0x0110)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_1E9313124C7B1D6EC04EF4B6A36B22304; // 0xFCD0(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_D414E4F54CA6A176C7C2B1BF279A65812; // 0xFD18(0x0060)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_604441324C983CCBC4D71FA5CDDA95F12; // 0xFD78(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_965CDF444A237B3EDABA9B99F3F15D592; // 0xFDC0(0x0060)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_85CC058C4E205D23A3AE59AA2A869ED03; // 0xFE20(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_1CC2A6C943A69A76B5BED78319567C15; // 0xFE68(0x00A8)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_27D19F964D07590AEB7943A38E734866; // 0xFF10(0x00B0)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_ABFCA54940C6BF936156FBBAC10E658A; // 0xFFC0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_321F5E074A5EEB41CF881D8295825310; // 0x10000(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_0FC3515F4489411B54B44FBE600E70E4; // 0x10040(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_6EB02F5F473A20C0EC5E4A9CA96E741E; // 0x10080(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_901288274FAD069F1203EAA2C7DDAD46; // 0x100C0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_612C4B1C41B908993D2FBDBE499D46DB; // 0x10100(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_619D88B74C56AF22B4A19B9772AAFCAF; // 0x10140(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_A69CC76C4D46CF5FFD3155A1AB55C8C3; // 0x10180(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_717283874E19F474AA87639B5CC447EC; // 0x101C0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_AE9CFB9F4AF3E48FE63BA29EACAA3C63; // 0x10200(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_4D0F0E1741BD56DEC62329AED5CF6068; // 0x10240(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_4784BD7144F973C7489B7982C2DEA815; // 0x10280(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_078EA53C49F615AC045A679CDD584CBD; // 0x102C0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_03ABDF4A4345AEA30888E184C7275C52; // 0x10300(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_B8424F4C41A89D9FE7BA8F9FCD4F3AF6; // 0x10340(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_3CE96BE84A7997C5AE4A3CA1CC11DF02; // 0x10380(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_77CAF299498195803A6C4D877AD495DD; // 0x103C0(0x0040)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_B349BEFD4CEEC950D0D3029C3A63ECB42; // 0x10400(0x0110)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_8814C1924FAE3D0945361FAFAF902C152; // 0x10510(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_EB59795A4224F9EFC09FC7BFE39C1C27; // 0x10558(0x0060)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_85CC058C4E205D23A3AE59AA2A869ED02; // 0x105B8(0x0048)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_C38E30914794A343BA467D8367B0A571; // 0x10600(0x0110)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_1E9313124C7B1D6EC04EF4B6A36B22303; // 0x10710(0x0048)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_653B2A904F3734DBDF1893A7B6FC41DC2; // 0x10758(0x0110)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_1E9313124C7B1D6EC04EF4B6A36B22302; // 0x10868(0x0048)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_EF99854B44E1FFAEFFA05E9CC30E1E0C; // 0x108B0(0x0110)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_B747C86944D3DEA7EE3E05AF827EC87E; // 0x109C0(0x0048)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_B349BEFD4CEEC950D0D3029C3A63ECB4; // 0x10A08(0x0110)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_8814C1924FAE3D0945361FAFAF902C15; // 0x10B18(0x0048)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_AC6A2B3B4511958EEBE8C2988B40E07A; // 0x10B60(0x0048)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_653B2A904F3734DBDF1893A7B6FC41DC; // 0x10BA8(0x0110)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_1E9313124C7B1D6EC04EF4B6A36B2230; // 0x10CB8(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_D414E4F54CA6A176C7C2B1BF279A6581; // 0x10D00(0x0060)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_604441324C983CCBC4D71FA5CDDA95F1; // 0x10D60(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_965CDF444A237B3EDABA9B99F3F15D59; // 0x10DA8(0x0060)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_85CC058C4E205D23A3AE59AA2A869ED0; // 0x10E08(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_2C1F570942461946533F96B1074F00B8; // 0x10E50(0x00A8)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_CEFCA87042D0B922C00A899B93549E25; // 0x10EF8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_BAC980FE4F09933FBB789988CDEE1DAB; // 0x10F40(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_BE23C99544F628EC541279971371CA56; // 0x10F80(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_CEB5DBEC4D18E334015C718A2671863B; // 0x10FC0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_3C99232741D366E265530693E53E0EAD; // 0x11000(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_885866B543DD30363DF62E9DA332C8BA; // 0x11040(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_3E76724248EDE265C48D3BA2798E732C; // 0x11080(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_9C9EFA104875FFB2172FA8B957A41590; // 0x110C0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_DA21FA8F426CDF8CE3B2E88AED77FA05; // 0x11100(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_BFBAD1BC4C8B9B05AB51889DF2FE29C4; // 0x11140(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_6242580F4B496CC2B3BEA086F13532C1; // 0x11180(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_AA0E354A4809F8FC8B896CB041FEEB14; // 0x111C0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_D4232AF9414B06122FA07B89D4C885E5; // 0x11200(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_E0FB565242F35E0CC7CC8E9D56B4E1A5; // 0x11240(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_751173444E5B0D5F486F52B67754272A; // 0x11280(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_4AEAD5684C658EE69F0941A1A77C10EA; // 0x112C0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_7A09715F4A83A456611E2AA11CF5036C; // 0x11300(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_78E9238F4B1B281E8D0A489E2B634C5D; // 0x11340(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_F0290364409090813CD2548460F299DB; // 0x11380(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_7A70304B43ACF86BC8E4889DC6C8F56E; // 0x113C0(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_A06931E7475EA79253EC4E85B2D0BBC9; // 0x11400(0x0060)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_AD579AE845875E577C99BDAF2CDA2190; // 0x11460(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_8DBACF184C327F61BE8EC2A191F95DFA; // 0x114A8(0x0060)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_DE75779F4797BBF2F08787B9D83E67C5; // 0x11508(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_AB076BFF45B66E3339AEFE90175D6B2A; // 0x11550(0x0060)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_724A056A48BF1877BDC4739EFE3D9CFB; // 0x115B0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_CE0CFE544EACC1D50D6C5B9BD5B526E1; // 0x115F8(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_0B1C0E344CE4D244B345459EAA264385; // 0x11638(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_1A5727864F58BBB00D6A118A31C516E1; // 0x11678(0x0060)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_C9847A1246DA7A421C59D88C48876D7F; // 0x116D8(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_9D40264B49660B6683201699C8708E4F; // 0x11788(0x0060)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_0D4D3A594888750CF6507CA95BCB7D55; // 0x117E8(0x0048)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_9C111B5448E091E1799E2EACB65B6915; // 0x11830(0x0110)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_11CAE05F4B0E031100D0DF99A6BC19FD; // 0x11940(0x0048)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_73CFF3124FD0960B82293FBE7A2EFAC0; // 0x11988(0x0110)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_AACF9B77446CEA65B296B28CF3AB2011; // 0x11A98(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_6324914645DB563106B057B297910FC1; // 0x11AE0(0x0060)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_A70BF0AE499CD96BE2D251B8CA54EA52; // 0x11B40(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_1570B7264C050675CE0C45A7D60A87E1; // 0x11B88(0x00A8)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_0241BF1542D9B5D80961BDBF11189B9D; // 0x11C30(0x0048)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_09A2EAA445CA0440DF564D9464909AC1; // 0x11C78(0x0050)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_75B3FA6F46445DA9565A77AF93680106; // 0x11CC8(0x0048)
	struct FAnimNode_BlendSpaceEvaluator               AnimGraphNode_BlendSpaceEvaluator_2798666641C032BF9A9B748AE7C4EE52; // 0x11D10(0x0118)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_F9809F6743EDB8194DA7D69AB5BD7233; // 0x11E28(0x0050)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_242DC02E4539EF1B4276559B5FFBD89E; // 0x11E78(0x00B0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_A440D8334EC7ED4DC07AE6B750302811; // 0x11F28(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_2823A80F4C9B5ADECA59509FC0FE617B; // 0x11F70(0x0060)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_8977519F476344CF33BA888A97E8E228; // 0x11FD0(0x0048)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_3EB586B744ECABB5A039468BC12552B7; // 0x12018(0x0050)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_51034A3740919FADB271E2824E39E53B; // 0x12068(0x0048)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_EC7A58424327A68E762D198E57AAE8E8; // 0x120B0(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_2B633C75479EBD2686046AA92C141108; // 0x12160(0x0060)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_A4CEBF53423F005A6D90B1A18DCA9E7E; // 0x121C0(0x0060)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_A9462D38439BA77C61A93B86598EA664; // 0x12220(0x0048)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_0CA863624B2C9693B05238A3E35ED033; // 0x12268(0x00B0)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_2D28F76E478B710EA9345DBDD88E16F6; // 0x12318(0x0110)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_678A6B9D49CB5BBAB2EA12AEA8193D10; // 0x12428(0x0060)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_9A0C04D249D5EB49933BABBEAC7F2173; // 0x12488(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_5D1B280F4E62852208563D80F583884C; // 0x124D0(0x00A8)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_548A0F274B6C096B06797384102D9FA6; // 0x12578(0x0048)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_816BF7E8414DF91B477C638AED5947D2; // 0x125C0(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_67D245924FF395E5AD33D6ADFD3AFEDF; // 0x12608(0x00A8)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_D300E40E44A817FE9E6035BB31044EFD; // 0x126B0(0x0048)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_755AB7FD4355B5C347203297CD39805D; // 0x126F8(0x00B0)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_4B2424E24041FE698CEB8F88D52C65D8; // 0x127A8(0x0090)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_260FF2AF4585E2064693B7A025A5C336; // 0x12838(0x0090)
	struct FAnimNode_HIKSetProperty                    AnimGraphNode_HIKSetProperty_53209D924AB639131BF4C395BE8837E7; // 0x128C8(0x0050)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_1DF4298E47785363EED2AD9C1C68A1B6; // 0x12918(0x0048)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_0F6A769C4E2E3D06E66EA98232E96584; // 0x12960(0x00B0)
	struct FAnimNode_HIKSetProperty                    AnimGraphNode_HIKSetProperty_9B1C7C7E4F940C91EAF98BAD9B094A7B; // 0x12A10(0x0050)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_C52F638E4BF80B4DBE6BBD8D923EA419; // 0x12A60(0x0048)
	struct FAnimNode_HIKSetProperty                    AnimGraphNode_HIKSetProperty_9993E16A49BAD500CB10DC9A424458A0; // 0x12AA8(0x0050)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_46C2CD6244061F4017B2F68FCD8186D5; // 0x12AF8(0x0048)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_0627BA604BA43F809E9BD697D207D272; // 0x12B40(0x0048)
	struct FAnimNode_HIKSolve                          AnimGraphNode_HIKSolve_ECBECB834333AC1DC5AE5096041D6774;   // 0x12B88(0x0080)
	unsigned char                                      UnknownData_KPTH[0x8];                                     // 0x12C08(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FAnimNode_HIKReach                          AnimGraphNode_HIKReach_E42BD3E8401C10A894C498B2E9584CC1;   // 0x12C10(0x0080)
	struct FAnimNode_HIKSetProperty                    AnimGraphNode_HIKSetProperty_CE015F0A43EECEA9CA37099DADE92127; // 0x12C90(0x0050)
	struct FAnimNode_HIKSetProperty                    AnimGraphNode_HIKSetProperty_8BE99C564AA6F979DADE2FBB2226B4C3; // 0x12CE0(0x0050)
	struct FAnimNode_HIKSetProperty                    AnimGraphNode_HIKSetProperty_3AF3546C43C6BAE285D73D8F9A08D603; // 0x12D30(0x0050)
	struct FAnimNode_HIKReach                          AnimGraphNode_HIKReach_DBD67FFD4536F215D08511B3C367CBD6;   // 0x12D80(0x0080)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_14714C244A05F2E5A296C79CEA23AFB4; // 0x12E00(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_C6E9941A48999F3CFEA38C9217F3D72F; // 0x12E48(0x00A8)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_4A49EBD3452092FB53AFD1B1D2826BB7; // 0x12EF0(0x0048)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_FB23FFE84DF57BFFE9799BB26D2E91AA; // 0x12F38(0x0048)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_F628C2E74AAC9CBD9B96E6B42D61ED13; // 0x12F80(0x0048)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_3A76EE35475951C79F92F8BCFDB7FCD5; // 0x12FC8(0x00A0)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_7173227A47E93B8C298A2CAD2AED65A4; // 0x13068(0x0048)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_172E7ACF452FC7027A89B6B817E502E2; // 0x130B0(0x0048)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_E498E6374CE9F0F04120E184C81D950F; // 0x130F8(0x0048)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_2ED6FDD242F34A548D3E9A854C42B9AC; // 0x13140(0x00A0)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_2AA22C4947DADD91F7F7A0A58361A3CB; // 0x131E0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_4F193E8F4D2E17B08C561E8A2F409829; // 0x13228(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_BABD29D946213D3280DFCE881B1806EB; // 0x13268(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_67CF676640E4188A561FCF82645B8BE4; // 0x132A8(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_97CE9D594F8C14C001DE46BC88086AB3; // 0x132E8(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_B4CBBAA8421AA606252F6EB7274B3319; // 0x13328(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_691327534C04446C25AFBEB0070ADD47; // 0x13368(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_8529EFF94C15CEF950484B820B6B88E7; // 0x133A8(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_7AF25A6F4F29F44D23143C8054985AEA; // 0x133E8(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_46B408EE47CA39582B44BE9AAB992220; // 0x13428(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_83C36CD041C68E58560BE08D643B9465; // 0x13468(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_267FF4D645C612A95AA8EBBD77F7EA8C; // 0x134A8(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_6DDE5C5646DFDFA11F3C1A9C4A805379; // 0x134E8(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_8EB2311F45F9646B4B2B078CDA9034EB; // 0x13528(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_60EB0B8246E84BCFDABD46BCBC1578F0; // 0x13568(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_B2A691F2465BF8BFD07BD6B5A4531A29; // 0x135A8(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_917906FB43EE9D97EDCF49B38992F62D; // 0x135E8(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_7DDE0DF94D1DA2AEBD67FBB6A0D9C698; // 0x13628(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_BC3848804ABA1D99208684A623BE8492; // 0x13668(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_341737F94DA1531508BD0291FFFCC276; // 0x136A8(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_5DBAD6B246638C8277BCB5B0B5048671; // 0x136E8(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_C36AE9194BC2DF68BAC7CA884F969522; // 0x13728(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_2732DF7647EF095600903782E98BEC8B; // 0x13768(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_6E4CF1F343B3ED8481D6588868100C92; // 0x137A8(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_70DAF08E4D465FC81180348EBCB99829; // 0x137E8(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_91688AB5424199861D0DD2A579DD80BB; // 0x13828(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_7BE4B97343A2AEFE678D3CB4FA07181E; // 0x13868(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_8AAEF112440CBD374C8E809CD45F4C12; // 0x138A8(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_4C28F395431AC6F9CA66F0AE13FB9CBB; // 0x138E8(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_5807F6B74E52737299A6C1AD86C8247D; // 0x13928(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_42929259439955B3D04C68AA3394366E; // 0x13968(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_C5FB4C6A4F1050616F166A8CB3EF770F; // 0x139A8(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_C27553714E1A286B88CD2A8B6DA054AD; // 0x139E8(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_33BB35DF4D4761BB6D2E90AC9753DAEC; // 0x13A28(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_73DDD4E04111F1E1471B029AABD19007; // 0x13A68(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_FE44775743940573EC8FDE80F26BD0A6; // 0x13AA8(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_0CC6DD2D480B7FDFADA910A47A8746B4; // 0x13AE8(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_0DF7BAA343F65A88FD86B48973B3F81C; // 0x13B28(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_147ACE0149DF4FA79F2D75A161776F79; // 0x13B68(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_D23FB7D441FEEDFA61CF9C97F33BDE7D; // 0x13BA8(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_B590D1CD4693C92D3431CF947EFB07CD; // 0x13BE8(0x0060)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_2A3C0A3E4471247A2AFE87AE41951BEB; // 0x13C48(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_B719F8A840BB0A793F7E0E89FD66C088; // 0x13C90(0x0060)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_7EDAA03D48D4E16314675487CDDED26C; // 0x13CF0(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_A761C62E43EC11FCEEC26C8941FEDCED; // 0x13D38(0x0060)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_7193FB6049D3ED081220C4BF99F2A069; // 0x13D98(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_E249030448F3291EC7A61392494A8F22; // 0x13DE0(0x0060)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_40E68E7645842C40A31799A69DE06913; // 0x13E40(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_EB9979324374E83D06E3618ADFEA483F; // 0x13E88(0x0060)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_140EC6C0434F994FEBCD04AC45537CD4; // 0x13EE8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_2B3A6773421CA2157130E9975CDD57F2; // 0x13F30(0x0040)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_BCB319ED43113F3970C997BAAB439A95; // 0x13F70(0x0070)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_8FBA818B4966BE188A4577B624E1B167; // 0x13FE0(0x0050)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_55186521469F80EA74889FA3F0B5337E; // 0x14030(0x0060)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_6B93AC264E2A8A21D60AA2A26D6EF65E; // 0x14090(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_D7CD8048435F6F22136616BA41250D75; // 0x140D8(0x0060)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_2E561C9E437E7E7E03347FB0DDFF06F6; // 0x14138(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_314A7D2746B230294D5CD4955B8F132D; // 0x14180(0x00A8)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_FF02B50D46DA264D7B4BD18F92BBEEB6; // 0x14228(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_518330AC4235D7EB06D0DBA76A2786A3; // 0x14270(0x0060)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_672FB149430766CE5B4F81A3D526686E; // 0x142D0(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_C272E318485591480FAAF9918480A22C; // 0x14318(0x0060)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_DDBE055D4BA55A55061B579E2021AC64; // 0x14378(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_FA855BC446951C0559D5569751811D53; // 0x143C0(0x0060)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_24E77D9548AD64B390322EA85D1F3DA6; // 0x14420(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_3C580ED643067E5A44B5E18E8142D617; // 0x14468(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_AB17E2F44C952B9C3AC4818B1E534C7C; // 0x144A8(0x0060)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_19E4A419489EE086ADEFA1A7F128758C; // 0x14508(0x0060)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_5A6476EF485B507D346C7AA0B69E9650; // 0x14568(0x0060)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_F8B553C94C20F1EE3A4D2F8ADA9DA0E22; // 0x145C8(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_1BF86D3A4074DA318A4F04AD7EDCD07B; // 0x14608(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_BFFE6F8146E4E7E5771965BF561C93F42; // 0x14648(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_BC4C64A44BA7B8B1F28CD3A4DDFBF5DC2; // 0x14688(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_2DC6E8BD4285F3FE895EFDBEB1CB3073; // 0x146C8(0x0060)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_1107755E409BDC5021CE90BEF8C1ABF42; // 0x14728(0x0048)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_B53649AE43AAC0519EE54DB784FF26B9; // 0x14770(0x0050)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_C4C9A50D44CE963EB99707B1817863772; // 0x147C0(0x0048)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_F43DCF3A4EF9A2AEA5AD40A0AA44FA3A; // 0x14808(0x0050)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_DFAAC78146E32BAD526C3D9FBB705C5E2; // 0x14858(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_F064A24F4D676339548F4D991D4BCC46; // 0x148A0(0x00A8)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_F8B553C94C20F1EE3A4D2F8ADA9DA0E2; // 0x14948(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_E06DE57540ABFD6A2024D2A4980FB603; // 0x14988(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_BFFE6F8146E4E7E5771965BF561C93F4; // 0x149C8(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_BC4C64A44BA7B8B1F28CD3A4DDFBF5DC; // 0x14A08(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_14134DF74581D6BDBF2E0B9DB933A3F6; // 0x14A48(0x0060)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_1107755E409BDC5021CE90BEF8C1ABF4; // 0x14AA8(0x0048)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_193303E7439ACEE3A8F4C5904F92EEF5; // 0x14AF0(0x0050)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_C4C9A50D44CE963EB99707B181786377; // 0x14B40(0x0048)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_B1D5FEA04622FD8FEE7E8DB2832915B0; // 0x14B88(0x0050)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_DFAAC78146E32BAD526C3D9FBB705C5E; // 0x14BD8(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_0D2D41904F0A5BEDD985B8BF57E4A1B2; // 0x14C20(0x00A8)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_7717F9244EE32E34AA6D6CA50DEEF540; // 0x14CC8(0x00B0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_76C8251A413748D4282A81B67964C640; // 0x14D78(0x00B0)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_3194720A457B7A509C77CEAFDBA24337; // 0x14E28(0x00A0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_307DFF144E84A02037641EB88CEE35FD; // 0x14EC8(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_CE540B3D43C2A475782DDCB11B919E83; // 0x14F10(0x0060)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_F4E3940D48026D5649B932BEAB1E9F66; // 0x14F70(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_F06118D64E4854B84AF6A0A9F713B058; // 0x14FB8(0x00A8)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_2291CDFC41BCA6839426CF9E05996203; // 0x15060(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_6238A4864E05ED798737E2A15095607E; // 0x150A8(0x0060)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_515644C14A81D27C109E6A92F1A52F8F; // 0x15108(0x0048)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_28A70A1B4868DF6B6A0C1F90EC9D84CC; // 0x15150(0x00C0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_9D091A584840F78CA15A5F9CBC62AD47; // 0x15210(0x0060)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_B67A74BB4793DD7022C5AD8141247505; // 0x15270(0x0060)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_92B26E294205102337F8218D60317932; // 0x152D0(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_BAAB0B5248907D6140FF4098CE56F974; // 0x15380(0x0060)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_C26789CB45CDE09F741C0E9629BE9206; // 0x153E0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_D1F4BAE645667ADF569200A9F829A043; // 0x15428(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_57A52DDD4AE556E1807C2CAB96A9712C; // 0x15468(0x0040)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_3BBAA4EE41ED876608B24FBB402255BD; // 0x154A8(0x00C0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_1B0154384C1EABBC4520C69A9C1A9DC6; // 0x15568(0x0060)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_11C83FBF4EC11C63C63C9F914A60650E; // 0x155C8(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_29CF7A374414F0DAA94FF5BD72A4A73C; // 0x15610(0x0060)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_1D28739E427B01F64AF823864119E287; // 0x15670(0x0070)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_345CCE7D4B02B8A01F9F7D902B0A54D7; // 0x156E0(0x0050)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_CA4A36934BD751B60300C4A5DEB09520; // 0x15730(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_9795D4564D2DAE68CD830D9EA65DCC0B; // 0x15778(0x0060)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_0CC916914B8ED56C76B7C0A9A7560956; // 0x157D8(0x00C0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_6386A3C44E494EC13EEC6EAD2BD25AD9; // 0x15898(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_FBBB7CC24CF10EDCEAE8F1BF39844C29; // 0x158E0(0x00A8)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_DA18BF644C388E9C64D28FBA3C65513D; // 0x15988(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_D4617AA142CE9E35081CE59BCFE79436; // 0x159D0(0x0060)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_CE2BAB4045B25D33779CDAB7B98D4EDE; // 0x15A30(0x0048)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_4252B08846EC00A0C41040AC3D82792C; // 0x15A78(0x0110)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_9BCFD340486FDBE613DB2EB9D445B28E; // 0x15B88(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_52E036D84EED41F1DED8BF912AD5640B; // 0x15BD0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_3A189C5C4F74B1E5AAA31B88F1995DFA; // 0x15C10(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_AEE5C30B48918F31D8C36BBF9CF07DCB; // 0x15C50(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_835706C24A9B24BDC070C19A5073395D; // 0x15C90(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_FACF014946BD9E3E2372AD80C99C66F6; // 0x15CD0(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_1ED4EF624742582386927E9E2EBABAB1; // 0x15D10(0x0060)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_E231E627493F55F94D1783B011475B66; // 0x15D70(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_A06361A743F89335FA1E4EA66F2EF58C; // 0x15E20(0x0060)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_6DDA5A6D4C9F78D2EE24C6BE3BD1ADD1; // 0x15E80(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_BC34CC6B4494B0BD8D58E492D8DFFAD1; // 0x15EC8(0x0060)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_139E9F7345022EC0685F04B31FD5452B; // 0x15F28(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_54B95FAB42E066488FAEF2B8F3EDAFC7; // 0x15FD8(0x0060)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_540E150C47A2520AC1C306AB58C79DCB; // 0x16038(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_1EFA34DB45C280823224DAABC8A233F6; // 0x16080(0x00A8)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_D85A8BAA472C15758CF09EBB94156FBB; // 0x16128(0x0048)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_43B2FBD745CDD82134B830BB846F1E00; // 0x16170(0x0110)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_B66B1B5240BD89D937A438B53A39E818; // 0x16280(0x00B0)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_340F984649AF58108C788EBCFAE10048; // 0x16330(0x0110)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_DF796E344291B1946AE31A8066053E96; // 0x16440(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_9839965F4F6B6FF222F3268F45221BC5; // 0x16488(0x0060)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_EAF1BFEA46A8FE717F8CFCAC6920A794; // 0x164E8(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_A6EE621845DF9A7B3FB646BF5A11DD1D; // 0x16598(0x0060)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_47DF4D7E4C2231B46CA932964D4B3A17; // 0x165F8(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_EACC97424EEC2540D90616A95D5577F5; // 0x16640(0x00A8)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_6C09643F40CF75409F05E99FE7979641; // 0x166E8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_FF1364674F23DF8D8717BDAB5FF18062; // 0x16730(0x0040)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_979045EC4C6F66B51ADE97BBF0425D84; // 0x16770(0x0070)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_3DE845A84F49BAA1BD54879F6101536B; // 0x167E0(0x0070)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_CB95D4534CDD5EF6D90806917BA4CAA3; // 0x16850(0x0050)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_33364667479023FD67317C98D7A3AD0C; // 0x168A0(0x0050)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_A2776BBA4C431762C50C87B6E32F6649; // 0x168F0(0x0070)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_3535BB164A3D6EA1E3002EBCC2C36182; // 0x16960(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_48D2691A4E670255C8368E9D035ECA8B; // 0x169A0(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_9D21F95D4687726F4B964281EBA0ACE8; // 0x169E0(0x0060)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_AF1EA6D444A9D8F6F0EDF59C51E4B09F; // 0x16A40(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_8ED430774C769C54B8AD4F8563D59ADD; // 0x16A88(0x0060)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_CBFD6761444BB66D2392EEAC45447723; // 0x16AE8(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_52572D6B4B4F930FE99E28B23909FE30; // 0x16B30(0x00A8)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_7838FFDA4AA4DCA66270E08786B8AE19; // 0x16BD8(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_7F766E29483FC1AE9B2D8CBA4589421F; // 0x16C18(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_DFC20B024615280C001F8AB3CD52C152; // 0x16C58(0x0060)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_44F2BE4741380C20E4D47699472A7ED2; // 0x16CB8(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_B6FDF0ED41E4797C3B9150931CD2A778; // 0x16D00(0x0060)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_676EA3854B771E6814FE43B32E6AC749; // 0x16D60(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_3FA3DB2E468344DDD727B2AB6CDE3EBF; // 0x16DA8(0x00A8)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_D2A87BF94F909ADCA66E7C8A35E659CD; // 0x16E50(0x0070)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_BA1DFFBB42A939470D6F16A443707D78; // 0x16EC0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_8F9818B54AB1419F1EF8E5800CCB2C7E; // 0x16F00(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_770AFD814131A7B1AEDB3382982A8736; // 0x16F40(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_54E9685748BFCFABC7AA9BB1B957D818; // 0x16F80(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_E17D7F444F25D03DA69654AA498A6F4C; // 0x16FC0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_DA0384E54F96D7D053627F88E08669CB; // 0x17000(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_3AD377A14A29BB3CAF122C9A9D0D7FDE; // 0x17040(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_AF74C8834B54AEE4A27E83811BDE3CA5; // 0x17080(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_3B8C4ACE4D3BF3DE50C07A98C237ADDF; // 0x170C0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_5FA015DA4FAEB79DE0F3A6B97901F620; // 0x17100(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_D18D0C4342754FEE1820989928D36345; // 0x17140(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_63BFA8DE46AD045F7FFABEA73603D528; // 0x17180(0x0040)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_4E4A01414793CD12F15B10B7E81E63E8; // 0x171C0(0x0050)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_992B1F56461A2481154B59828669F90D; // 0x17210(0x0048)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_9EE53B454BE5BC6BDFF48692B54683B1; // 0x17258(0x0050)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_FAE897E44AF03D11B5B544B0A168EF6B; // 0x172A8(0x0048)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_03393B4A40A186EB033C27A4D94F8990; // 0x172F0(0x0050)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_D029C47847D4D66F921D199E00AF1C02; // 0x17340(0x0048)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_81B0D70F47EB7148BCDE05B6E23E75CE; // 0x17388(0x0050)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_54386DB146A1C52D59217D95270F0174; // 0x173D8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_92A489FA42540ABCAC3AFBB62EF9529E; // 0x17420(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_87D7DFBD45771BBB777DE98ED82E2EBD; // 0x17460(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_FD9172EA400842A93FC51EA7AB5868DA; // 0x174A0(0x0040)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_DD8CB5D64FA811EBE9FF1C9860C450D9; // 0x174E0(0x0110)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_2787646D4FE0067F098BC0BDAB807BD7; // 0x175F0(0x0048)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_E05905F049D97A45B83EB48691139149; // 0x17638(0x0050)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_59BCCD4745865B28CD06E686D9D17208; // 0x17688(0x0048)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_7912B59E4042F1017F3272BA40A1F532; // 0x176D0(0x0110)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_0BD4E3EC4CFC3FD2AFD8B691BF0FD7C7; // 0x177E0(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_525A42304474E8C6E169E9A29D390906; // 0x17828(0x00A8)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_B8F2DE434A9D9AF78D98F8A3D3DEE7F0; // 0x178D0(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_64DC74E1446A67964621DABB91D29D87; // 0x17910(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_F1F5ABAC4CC8171880114EBEF5C6DA30; // 0x17950(0x0040)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_97103FF84815E6466B13FD8A93B9263E; // 0x17990(0x0110)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_DE561F3445C865094F535590722F7F50; // 0x17AA0(0x0048)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_C83100BF4B80EBBD2132BABA0EE5E4D4; // 0x17AE8(0x0050)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_933FA9FC43908395DEB0E9A210CAA7BB; // 0x17B38(0x0048)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_52C6E52B4637E82E823BCBA24175110B; // 0x17B80(0x0110)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_6EAEF841451304B23BE5DB9A84A88833; // 0x17C90(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_1C97CC344EC8BD52A92180A452B6E3C2; // 0x17CD8(0x00A8)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_05997EC140D17EEBFC3355A16159831C; // 0x17D80(0x00A0)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_E5A045ED4AE33F7D5C5300A5CCB4A5FB; // 0x17E20(0x00A0)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_7108FAE744831D00A83359A7AFD06EEF; // 0x17EC0(0x0050)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_8A5D63A841348E27DCD37D97D62E72A8; // 0x17F10(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_B33900DB4A5027D68831ABBF942D6B86; // 0x17F58(0x00A8)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_8426350045323907E207BC9C79FA8574; // 0x18000(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_11B8280F468470C79BC0BE85B88C4EB1; // 0x18048(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_7D62BF41491C23400EDDF3A919B72A40; // 0x18088(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_4FAB512245F8F725FC795F9D6C19AECA; // 0x180C8(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_B23880CA46281EC43C57CE97FA18EF8B; // 0x18108(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_2A521915487BD0375E2FF3A68AFF3F28; // 0x18148(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_894B66DD4D136E5FDF69EA82975DF5F6; // 0x18188(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_CE1FE21D446E8A51C288A0B15AF935AF; // 0x181C8(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_93C5A93540BE5FE1783FC790FDD3E397; // 0x18208(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_67A76BF04ED2F66105CCC6B1B05D4E37; // 0x18248(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_F6CA06DD43554A3690C1EAAFFB742885; // 0x18288(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_EE254727489A4A39467563A7DDFFFB44; // 0x182C8(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_F82A3CF545C45C9424CA58BC769803F4; // 0x18308(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_6727E80348CD4230190E85BC61123F76; // 0x18348(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_231D9420489E474C86B4AAB810368A0E; // 0x18388(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_1155BC6C488562796C7B5AA2661C67EB; // 0x183C8(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_89EE80EF4D5A9DEAFFBDA8857A264B14; // 0x18408(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_727F31A048C3938140E5F9859FCBB426; // 0x18448(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_CC1D03CB4C3F556F6521E5BB5D74B64C; // 0x18488(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_873DE3B24C11E74E321E4983E3D350D5; // 0x184C8(0x0060)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_99F19DDF45EC43CFB6C6978F841A1ED5; // 0x18528(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_A9CE2B8A441368124786C5A4A93A29D0; // 0x18570(0x0040)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_9DF45A2B4D27863BF377C7A7FA0A3F1C; // 0x185B0(0x0110)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_0A1191C343F2E0073771DDB8437ABA28; // 0x186C0(0x0048)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_72EA10674FFD3878120DEEA20BA660CD; // 0x18708(0x0110)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_72B91D6B430BBE767DA290B688F11C43; // 0x18818(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_F17FD9914A568EA3933B40A8F0C46E3A; // 0x18860(0x0060)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_D73561A34C8391C6E80CE1A21158B127; // 0x188C0(0x0048)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_8F0D5597473564D6818E7FA3FCA2D781; // 0x18908(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_A107D739425ABD1D8F2192B6CD1CFA75; // 0x189B8(0x0060)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_F26398C544B4F5AF1E499B965DE34811; // 0x18A18(0x0110)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_500C00FE4B1E462CFB5FF9BD89D31B42; // 0x18B28(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_14A241094514D7AC08AF2D9D648CD21F; // 0x18B70(0x0060)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_EF21CD4C4FD496871F1564A6716656E6; // 0x18BD0(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_19418384401D047BEA93868D4A08F2C4; // 0x18C18(0x00A8)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_06E0247C4D7CED0F9B7DE2B41E667F75; // 0x18CC0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_6487C8764696032E1B74FAA7BB8FA9CC; // 0x18D08(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_C923ECE94529D346878585B6BBDE981D; // 0x18D48(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_94DB998940A7BF876C8EDA8303827EFF; // 0x18D88(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_E61ACB884206408767A7F58191D9AB2F; // 0x18DC8(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_535159DD42454B2041459FA5C6B8549F; // 0x18E08(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_BC4E9B79417E537B26EC6CAF14D33837; // 0x18E48(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_A7E10B4442D6F6725A589CB170B690F5; // 0x18E88(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_BBCC6A804DC7338DB36823824C0A08CA; // 0x18EC8(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_64CF38F14250D8AC9DE8A9BB1E73BD4E; // 0x18F08(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_059CC46A45B37AB57290909B5462472A; // 0x18F48(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_77D3DB2C438A1416704FE3985AF839CC; // 0x18F88(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_FC6AB72349457E258AE068B39C9C2594; // 0x18FC8(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_6E561CB24BCAC71E315426B4A1508713; // 0x19008(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_E872A71B44E8854EB5CFB2AE65C77682; // 0x19048(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_F62CDC95405C937ADC3EE6A4117AD40D; // 0x19088(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_DB6043184FF6E877191A33B79D43B898; // 0x190C8(0x0040)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_72485C45485871AD898D90B2744B1A58; // 0x19108(0x0110)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_44F111154FFF993EE74E6D866431F16D; // 0x19218(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_1719C6C14D195494430CA3B7D4237A42; // 0x19260(0x0060)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_4069D5294969EC79633418A26E03B3C7; // 0x192C0(0x0048)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_172D2F374DA5F379615C80AEB0153105; // 0x19308(0x0050)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_952CF4AA427481757CBBCB9ECF3D7F7A; // 0x19358(0x0048)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_5357D82C4D3D47BDEBF889998236AB19; // 0x193A0(0x0050)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_051C9C544EDBF73ECC0AFC98395B9B53; // 0x193F0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_CCE90CA344F247D6ECD843B193AEECF4; // 0x19438(0x0040)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_356CD13F4AD66EDC45CA91B49CFD6AC7; // 0x19478(0x0110)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_0A7809BD4083683A736DACB91193518E; // 0x19588(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_9FEE86304D012098B1E4ADA25D4DC874; // 0x195D0(0x0060)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_4296EB4B4DAA36D934A780A820FECA08; // 0x19630(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_1C19981D48DFAD3CE1453CB9A9D8DCED; // 0x19678(0x00A8)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_48E2DA1C4B68D9823B3AFCAE19E12FDA; // 0x19720(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_9E9304F044DACDE33415F18A883FBFAE; // 0x19768(0x00A8)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_77BAEC0B454FAB9177B86887F10A5CBD;       // 0x19810(0x0060)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_AC10C99548114CF51ABC2D9499C447B2; // 0x19870(0x0048)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_7623E6AF46BD4AC349AB789A99CD4CAF; // 0x198B8(0x00B0)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_787AB0784DAB91CD62BD08AD23FFEFAC; // 0x19968(0x0090)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_12A760774ACB60E43098029BEB05978B; // 0x199F8(0x0048)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_1941DE8B448E37DD8660CFAD8DABD0C8; // 0x19A40(0x0048)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_E96598BF46ACF4C6AF46D391D3E641D3; // 0x19A88(0x0090)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_1103CBD948AD60C898B3848FCC475622; // 0x19B18(0x00C0)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_34F8BD844EF9873F3A9CB38DED4F1F72; // 0x19BD8(0x0090)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_7B1F2FE344014482C07B5B9D773FDF0E; // 0x19C68(0x0048)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_6CAB69E84167D694DD4706B6F7430FF9; // 0x19CB0(0x0048)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_6459E0CD4418225059AD519E9F254E1F; // 0x19CF8(0x0090)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_39A65C1D4871E78CC6DE9E9EB0D0E714; // 0x19D88(0x0048)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_C41587F14FE941888EFD2585733E931C; // 0x19DD0(0x0048)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_ED965A744BD79BF82D5351A1B4DF5D9B; // 0x19E18(0x0048)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_C7950B754A9067EDA60263AFBF25C8BC; // 0x19E60(0x0090)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_47EEE190494242CE41106AAE49F5EF48; // 0x19EF0(0x0048)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_82BCF1CE44A69F25099C0FB1A78C6EDD; // 0x19F38(0x0048)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_3099A91147875EB98BA64CA4FB8EA0AB; // 0x19F80(0x0048)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_B6502AF344DF2E3629FC3F89BA192E48; // 0x19FC8(0x0090)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_FE73416E4AA9169E045C8797AD339CCA; // 0x1A058(0x0048)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_6B6290204DD1AC9D1773F0B045B1C84B; // 0x1A0A0(0x0048)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_0543155845BBC29CC3AC90A79D2C4F45; // 0x1A0E8(0x00B0)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_7643933C400B12E8BAF606BB456ADC67; // 0x1A198(0x0048)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_CFF0489742B071CB9AA291B93B4FD189; // 0x1A1E0(0x0090)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_C9CBC4CF47540937A4D21E9C95BA8381; // 0x1A270(0x0048)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_3CFC6F94421CFDBBBF92E08179A2862F; // 0x1A2B8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_54B23116469575AC6CFA8E8CD367414E; // 0x1A300(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_EB967C35491D8C06B307488306018D20; // 0x1A340(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_413EACC64BAAA3E8BBFF2693605E9E95; // 0x1A380(0x0060)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_14A9F6AB4BF095AF6AADB8A78957DF4F; // 0x1A3E0(0x0048)
	struct FAnimNode_RefPose                           AnimGraphNode_IdentityPose_05B2FAC441DDCEB6F1A7BAAAF890B476; // 0x1A428(0x0038)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_EF7180224FF0094E63CC94AC3867337A; // 0x1A460(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_71300F1B439BD8A661C16CBCD8B8F1B9; // 0x1A4A8(0x00A8)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_A21FA94849CE1EADCEA409B8C178DBE9; // 0x1A550(0x0070)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_C56A548049CBEF7E827CFD8CF6C2D4CE; // 0x1A5C0(0x0090)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_EB93157F4BD562F677E2D896F5B9B2B3; // 0x1A650(0x0048)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_60DBF56E4F68C88C2EC472BEB411F627; // 0x1A698(0x0048)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_1D43CB624449E3CF89B377B8F932807C; // 0x1A6E0(0x00B0)
	struct FScriptMulticastDelegate                    EventUpper;                                                // 0x1A790(0x0010) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	struct FTransform                                  LHIKRelativeOffset;                                        // 0x1A7A0(0x0030) (Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FTransform                                  RHIKRelativeOffset;                                        // 0x1A7D0(0x0030) (Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FTransform                                  ChestIKRelativeOffset;                                     // 0x1A800(0x0030) (Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                              IKStretchSpine;                                            // 0x1A830(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                              IKStretchArms;                                             // 0x1A834(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                              IKStretchLegs;                                             // 0x1A838(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	unsigned char                                      UnknownData_DF2C[0x4];                                     // 0x1A83C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	class UAnimationData*                              AnimationData;                                             // 0x1A840(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class UBlendSpace*                                 LocomotionBlendspaceUpper;                                 // 0x1A848(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FBP_TurningAnimations                       TurnLeftAnimations;                                        // 0x1A850(0x0018) (Edit, BlueprintVisible, DisableEditOnInstance)
	struct FBP_TurningAnimations                       TurnRightAnimations;                                       // 0x1A868(0x0018) (Edit, BlueprintVisible, DisableEditOnInstance)
	class UAnimSequence*                               TurnOutShuffle;                                            // 0x1A880(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class UAnimSequence*                               JumpStartAnimation;                                        // 0x1A888(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class UBlendSpace*                                 JumpCycleBlendspace;                                       // 0x1A890(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class UAnimSequence*                               JumpPreImpact;                                             // 0x1A898(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class AActor*                                      ControlledObject;                                          // 0x1A8A0(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FObjectMessagingHandle                      RelinquishedControlEventHandle;                            // 0x1A8A8(0x0048) (Edit, BlueprintVisible, DisableEditOnInstance)
	struct FObjectMessagingHandle                      TakenControlOfObjectEventHandle;                           // 0x1A8F0(0x0048) (Edit, BlueprintVisible, DisableEditOnInstance)
	class UAnimSequence*                               WheelInto;                                                 // 0x1A938(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FBP_WheelTurns                              WheelLeftTurn;                                             // 0x1A940(0x0018) (Edit, BlueprintVisible, DisableEditOnInstance)
	struct FBP_WheelTurns                              WheelRightTurn;                                            // 0x1A958(0x0018) (Edit, BlueprintVisible, DisableEditOnInstance)
	struct FBP_WheelArmOverlay                         WheelLeftArm;                                              // 0x1A970(0x0010) (Edit, BlueprintVisible, DisableEditOnInstance)
	struct FBP_WheelArmOverlay                         WheelRightArm;                                             // 0x1A980(0x0010) (Edit, BlueprintVisible, DisableEditOnInstance)
	class UAnimSequence*                               CapstanAttach;                                             // 0x1A990(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class UAnimSequence*                               CapstanDetach;                                             // 0x1A998(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	TArray<class UBlendSpace1D*>                       CapstanNeutral;                                            // 0x1A9A0(0x0010) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TArray<class UBlendSpace1D*>                       CapstanPush;                                               // 0x1A9B0(0x0010) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TArray<class UBlendSpace1D*>                       CapstanPull;                                               // 0x1A9C0(0x0010) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	class UBlendSpace1D*                               CapstanUpperIntentBS;                                      // 0x1A9D0(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FBP_AnimSequenceVariants                    WheelLeftFingerIdleAnimations;                             // 0x1A9D8(0x0010) (Edit, BlueprintVisible, DisableEditOnInstance)
	struct FBP_AnimSequenceVariants                    WheelRightFingerIdleAnimations;                            // 0x1A9E8(0x0010) (Edit, BlueprintVisible, DisableEditOnInstance)
	int                                                CurrentRightHandIdle_1;                                    // 0x1A9F8(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	int                                                CurrentRightHandIdle_2;                                    // 0x1A9FC(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	int                                                CurrentLeftHandIdle_1;                                     // 0x1AA00(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	int                                                CurrentLeftHandIdle_2;                                     // 0x1AA04(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FBP_SailControlLogic                        SailControlLogic;                                          // 0x1AA08(0x0028) (Edit, BlueprintVisible, DisableEditOnInstance)
	class UAnimSequence*                               CameraAdditiveDefaultYaw;                                  // 0x1AA30(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class UAnimSequence*                               CameraAdditiveWheelYaw;                                    // 0x1AA38(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class UAnimSequence*                               CameraAdditiveCapstanYaw;                                  // 0x1AA40(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class UAnimSequence*                               CameraAdditiveSailYaw;                                     // 0x1AA48(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class UAnimSequence*                               CameraAdditiveDefaultPitch;                                // 0x1AA50(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class UAnimSequence*                               CameraAdditiveWheelPitch;                                  // 0x1AA58(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class UAnimSequence*                               CameraAdditiveCapstanPitch;                                // 0x1AA60(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class UAnimSequence*                               CameraAdditiveSailPitch;                                   // 0x1AA68(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class UBlendSpace*                                 OutOfRunBlendspace;                                        // 0x1AA70(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class UBlendSpace*                                 JumpLandLightBlendspace;                                   // 0x1AA78(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class UBlendSpace*                                 JumpLandHeavyBlendSpaces;                                  // 0x1AA80(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class UClass*                                      CharacterType_;                                            // 0x1AA88(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	TEnumAsByte<ELadderState_ELadderState>             LadderState;                                               // 0x1AA90(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	unsigned char                                      UnknownData_J2G3[0x3];                                     // 0x1AA91(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	float                                              LadderAnimationTime;                                       // 0x1AA94(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class UAnimSequence*                               IdleAnimation;                                             // 0x1AA98(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class UAnimMontage*                                HandOverlayMontage;                                        // 0x1AAA0(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FAthenaAnimationDeathAnimData               DeathAnims;                                                // 0x1AAA8(0x0040) (Edit, BlueprintVisible, DisableEditOnInstance)
	struct FAthenaAnimationSwimmingAnimData            SwimmingAnims;                                             // 0x1AAE8(0x0068) (Edit, BlueprintVisible, DisableEditOnInstance)
	struct FAthenaAnimationCannonConcealedAnimData     ConcealedCannonAnims;                                      // 0x1AB50(0x0010) (Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                               ContinuousUse1Chosen;                                      // 0x1AB60(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	unsigned char                                      UnknownData_ES9W[0x7];                                     // 0x1AB61(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FObjectMessagingHandle                      EventDockedToObjectHandle;                                 // 0x1AB68(0x0048) (Edit, BlueprintVisible, DisableEditOnInstance)
	struct FObjectMessagingHandle                      EventUndockedFromObjectHandle;                             // 0x1ABB0(0x0048) (Edit, BlueprintVisible, DisableEditOnInstance)
	class UAnimSequence*                               Camera_Additive_Ladder_Yaw;                                // 0x1ABF8(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class UAnimSequence*                               Camera_Additive_Ladder_Pitch;                              // 0x1AC00(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                               IsFemale;                                                  // 0x1AC08(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                               LeftOarActive;                                             // 0x1AC09(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                               RightOarActive;                                            // 0x1AC0A(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	unsigned char                                      UnknownData_GVEO[0x5];                                     // 0x1AC0B(0x0005) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	class UAnimSequence*                               SwimmingIdleDefault;                                       // 0x1AC10(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class UAnimSequence*                               SwimmingUnderwaterIdleDefault;                             // 0x1AC18(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FAthenaAnimationSwimmingSprintAnimData      SwimSprintAnimations;                                      // 0x1AC20(0x0020) (Edit, BlueprintVisible, DisableEditOnInstance)
	struct FAthenaAnimationRowboatAnimationsFirstPerson RowboatFirstPersonAnims;                                   // 0x1AC40(0x0030) (Edit, BlueprintVisible, DisableEditOnInstance)
	struct FAthenaAnimationRowboatAnimationsPassenger  RowboatPassengerAnims;                                     // 0x1AC70(0x0018) (Edit, BlueprintVisible, DisableEditOnInstance)
	class UAnimSequence*                               LeftHandGrab;                                              // 0x1AC88(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class UAnimSequence*                               RightHandGrab;                                             // 0x1AC90(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                               UsePrimaryOutOfContinuous;                                 // 0x1AC98(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)


	static UClass* StaticClass()
	{
		static UClass* ptr = UObject::FindClass("AnimBlueprintGeneratedClass BP_Humanoid_FirstPerson.BP_Humanoid_FirstPerson_C");
		return ptr;
	}



	void CheckIsFemale(bool* IsFemale);
	void SetInitialAthenaCharacterAndAnimSet(class UClass* CharacterType);
	void ItemWielded(struct FWieldAnimationParams* AnimParams);
	void Start_Stow(bool InputPin);
	void Start_Wield();
	void Update_Athena_Character(class AAthenaCharacter* AthenaCharacter);
	void CapstanRotationSpeed(float RotationSpeed);
	void DockingInterface(const struct FBP_Docking& Docking);
	void CapstanForce(float IndividualForce, const struct FTransform& LH_IK, const struct FTransform& RH_IK, class AActor* Actor);
