#pragma once

// Name: SoT, Version: 2.4.0


/*!!DEFINE!!*/

/*!!HELPER_DEF!!*/

/*!!HELPER_INC!!*/

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
//---------------------------------------------------------------------------
// Parameters
//---------------------------------------------------------------------------

// Function BP_TotD_PortalController.BP_TotD_PortalController_C.SetParameters
struct ABP_TotD_PortalController_C_SetParameters_Params
{
	float                                              PortalOpen;                                                // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                              LightScale;                                                // 0x0004(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                              CrackVisibility;                                           // 0x0008(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                              PortalSwirlVisibility;                                     // 0x000C(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                              CloudVisibility;                                           // 0x0010(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function BP_TotD_PortalController.BP_TotD_PortalController_C.SetPortalPositionAndOrientation
struct ABP_TotD_PortalController_C_SetPortalPositionAndOrientation_Params
{
};

// Function BP_TotD_PortalController.BP_TotD_PortalController_C.CollectMaterialsAndLights
struct ABP_TotD_PortalController_C_CollectMaterialsAndLights_Params
{
};

// Function BP_TotD_PortalController.BP_TotD_PortalController_C.UserConstructionScript
struct ABP_TotD_PortalController_C_UserConstructionScript_Params
{
};

// Function BP_TotD_PortalController.BP_TotD_PortalController_C.Timeline_0__FinishedFunc
struct ABP_TotD_PortalController_C_Timeline_0__FinishedFunc_Params
{
};

// Function BP_TotD_PortalController.BP_TotD_PortalController_C.Timeline_0__UpdateFunc
struct ABP_TotD_PortalController_C_Timeline_0__UpdateFunc_Params
{
};

// Function BP_TotD_PortalController.BP_TotD_PortalController_C.ReceiveBeginPlay
struct ABP_TotD_PortalController_C_ReceiveBeginPlay_Params
{
};

// Function BP_TotD_PortalController.BP_TotD_PortalController_C.ReceiveTick
struct ABP_TotD_PortalController_C_ReceiveTick_Params
{
	float                                              DeltaSeconds;                                              // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function BP_TotD_PortalController.BP_TotD_PortalController_C.OpenPortal
struct ABP_TotD_PortalController_C_OpenPortal_Params
{
};

// Function BP_TotD_PortalController.BP_TotD_PortalController_C.ExecuteUbergraph_BP_TotD_PortalController
struct ABP_TotD_PortalController_C_ExecuteUbergraph_BP_TotD_PortalController_Params
{
	int                                                EntryPoint;                                                // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
