// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x18
class BP_AIShipStorageBarrel_Wood_C: public StorageContainer
{
public:
	Class ReplenishableComponent*                                Replenishable;                                     // 0x4c0(0x8)
	Class ShipTelemetrySubjectComponent*                         ShipTelemetrySubject;                              // 0x4c8(0x8)
	Class StorageContainerComponent*                             StorageContainer;                                  // 0x4d0(0x8)
};


// Size 0x20
class BP_AIShipStorageBarrel_Food_C: public StorageContainer
{
public:
	Class ReplenishableComponent*                                Replenishable;                                     // 0x4c0(0x8)
	Class ShipTelemetrySubjectComponent*                         ShipTelemetrySubject;                              // 0x4c8(0x8)
	Class StorageContainerComponent*                             StorageContainer;                                  // 0x4d0(0x8)
	Class StaticMeshComponent*                                   StaticMesh;                                        // 0x4d8(0x8)
};


// Size 0x18
class BP_AIShipStorageBarrel_Cannonball_C: public StorageContainer
{
public:
	Class ReplenishableComponent*                                Replenishable;                                     // 0x4c0(0x8)
	Class ShipTelemetrySubjectComponent*                         ShipTelemetrySubject;                              // 0x4c8(0x8)
	Class StorageContainerComponent*                             StorageContainer;                                  // 0x4d0(0x8)
};


}