// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0xc0
class CharacterSocketCollisionResult: public None
{
public:
	bool                                                         HasHit;                                            // 0x0(0x1)
	Struct HitResult                                             HitResult;                                         // 0x4(0x80)
	Struct Vector                                                SocketVelocity;                                    // 0x84(0xc)
	Struct Transform                                             SocketTransform;                                   // 0x90(0x30)
};


// Size 0xc
class CharacterSocketCollisionHandle: public None
{
public:
};


// Size 0x58
class ImpactDamageEvent: public None
{
public:
	Struct Guid                                                  AttackId;                                          // 0x0(0x10)
	class                                                        DamagerType;                                       // 0x10(0x8)
	Class Actor*                                                 DirectInstigator;                                  // 0x18(0x8)
	Class Actor*                                                 RootInstigator;                                    // 0x20(0x8)
	Struct Vector                                                Location;                                          // 0x28(0xc)
	Struct Vector                                                SurfaceNormal;                                     // 0x34(0xc)
	Struct Vector                                                Velocity;                                          // 0x40(0xc)
	float                                                        DamageAmount;                                      // 0x4c(0x4)
	int                                                          DamageSpread;                                      // 0x50(0x4)
	byte                                                         Reason;                                            // 0x54(0x1)
	bool                                                         DealFriendlyFireDamage;                            // 0x55(0x1)
};


// Size 0x50
class ProjectileAim: public None
{
public:
	Struct Vector                                                AimDirection;                                      // 0x0(0xc)
	Struct Vector                                                AimPosition;                                       // 0xc(0xc)
	Class PrimitiveComponent*                                    AimBase;                                           // 0x18(0x8)
	Struct Transform                                             AimBaseTransform;                                  // 0x20(0x30)
};


// Size 0x8
class RewardId: public None
{
public:
	struct FName                                                 RewardId;                                          // 0x0(0x8)
};


// Size 0x18
class AchievementDefinition: public None
{
public:
	struct FName                                                 DevCenterId;                                       // 0x0(0x8)
	TArray<Struct AchievementCriteria>                           UnlockCriteria;                                    // 0x8(0x10)
};


// Size 0x18
class AchievementCriteria: public None
{
public:
	Struct PlayerStat                                            PlayerStat;                                        // 0x0(0x4)
	byte                                                         Operator;                                          // 0x10(0x1)
};


// Size 0x4
class PlayerStat: public None
{
public:
};


// Size 0x10
class FogBankManagerFogAvoidanceArea: public None
{
public:
	Struct Vector                                                Location;                                          // 0x0(0xc)
	float                                                        Radius;                                            // 0xc(0x4)
};


// Size 0xc
class WaterPuzzleWaterLevel: public None
{
public:
	float                                                        WaterLevel;                                        // 0x0(0x4)
	float                                                        FillTransitionTime;                                // 0x4(0x4)
	float                                                        DrainTransitionTime;                               // 0x8(0x4)
};


// Size 0x8
class WaterPuzzleRepData: public None
{
public:
	int                                                          CurrentWaterLevelIndex;                            // 0x0(0x4)
	bool                                                         TransitionDueToReset;                              // 0x4(0x1)
};


// Size 0x10
class AudioEmitterParameters: public None
{
public:
	Class WwiseObjectPoolWrapper*                                LocalEmitterPool;                                  // 0x0(0x8)
	Class WwiseObjectPoolWrapper*                                RemoteEmitterPool;                                 // 0x8(0x8)
};


// Size 0x68
class WeaponProjectileEffectParams: public None
{
public:
	bool                                                         ApplyStun;                                         // 0x0(0x1)
	float                                                        StunDuration;                                      // 0x4(0x4)
	bool                                                         ApplyKnockback;                                    // 0x8(0x1)
	Struct KnockBackInfo                                         KnockbackParams;                                   // 0xc(0x50)
	int                                                          MinimumHitProjectilesForKnockback;                 // 0x5c(0x4)
	float                                                        MaximumKnockbackDistance;                          // 0x60(0x4)
	bool                                                         EnableKnockbackFalloffOverDistance;                // 0x64(0x1)
};


// Size 0x50
class KnockBackInfo: public None
{
public:
	struct FName                                                 FeatureName;                                       // 0x0(0x8)
	float                                                        HorizontalVelocity;                                // 0x8(0x4)
	float                                                        VerticalVelocity;                                  // 0xc(0x4)
	float                                                        MinHorizontalVelocity;                             // 0x10(0x4)
	float                                                        MinVerticalVelocity;                               // 0x14(0x4)
	float                                                        SwimmingVelocity;                                  // 0x18(0x4)
	float                                                        DockedHorizontalVelocity;                          // 0x1c(0x4)
	float                                                        DockedVerticalVelocity;                            // 0x20(0x4)
	bool                                                         UseDockedVelocitiesWhenDocked;                     // 0x24(0x1)
	struct FName                                                 RumbleTag;                                         // 0x28(0x8)
	float                                                        StunDuration;                                      // 0x30(0x4)
	float                                                        AIKnockbackDistance;                               // 0x34(0x4)
	float                                                        AIKnockbackSpeed;                                  // 0x38(0x4)
	float                                                        AIKnockbackAcceleration;                           // 0x3c(0x4)
	byte                                                         AIKnockbackStrengthType;                           // 0x40(0x1)
	bool                                                         UseOverrideLaunchDirection;                        // 0x41(0x1)
	Struct Vector                                                OverrideLaunchDirectionInWorldSpace;               // 0x44(0xc)
};


// Size 0xb8
class WeaponProjectileParams: public None
{
public:
	float                                                        Damage;                                            // 0x0(0x4)
	float                                                        DamageMultiplierAtMaximumRange;                    // 0x4(0x4)
	float                                                        LifeTime;                                          // 0x8(0x4)
	float                                                        TrailFadeOutTime;                                  // 0xc(0x4)
	float                                                        Velocity;                                          // 0x10(0x4)
	float                                                        TimeBeforeApplyingGravity;                         // 0x14(0x4)
	float                                                        DownForceVelocityFractionPerSecond;                // 0x18(0x4)
	float                                                        VelocityDampeningPerSecond;                        // 0x1c(0x4)
	Struct LinearColor                                           Color;                                             // 0x20(0x10)
	class                                                        ProjectileId;                                      // 0x30(0x8)
	byte                                                         HealthChangeReason;                                // 0x38(0x1)
	Struct WeaponProjectileEffectParams                          ProjectileEffects;                                 // 0x3c(0x68)
	int                                                          SuggestedMaxSimulationIterations;                  // 0xa4(0x4)
	float                                                        SuggestedMinTickTimeSecs;                          // 0xa8(0x4)
	float                                                        SuggestedMaxSimulationTimeStep;                    // 0xac(0x4)
	float                                                        HitScanTrailUpdateModifier;                        // 0xb0(0x4)
};


// Size 0x1e0
class ProjectileWeaponParameters: public None
{
public:
	int                                                          AmmoClipSize;                                      // 0x0(0x4)
	int                                                          AmmoCostPerShot;                                   // 0x4(0x4)
	float                                                        EquipDuration;                                     // 0x8(0x4)
	float                                                        IntoAimingDuration;                                // 0xc(0x4)
	float                                                        RecoilDuration;                                    // 0x10(0x4)
	float                                                        ReloadDuration;                                    // 0x14(0x4)
	Struct ProjectileShotParams                                  HipFireProjectileShotParams;                       // 0x18(0x18)
	Struct ProjectileShotParams                                  AimDownSightsProjectileShotParams;                 // 0x30(0x18)
	int                                                          Seed;                                              // 0x48(0x4)
	float                                                        ProjectileDistributionMaxAngle;                    // 0x4c(0x4)
	int                                                          NumberOfProjectiles;                               // 0x50(0x4)
	float                                                        ProjectileMaximumRange;                            // 0x54(0x4)
	float                                                        ProjectileDamage;                                  // 0x58(0x4)
	float                                                        ProjectileDamageMultiplierAtMaximumRange;          // 0x5c(0x4)
	class                                                        DamagerType;                                       // 0x60(0x8)
	class                                                        ProjectileId;                                      // 0x68(0x8)
	Struct WeaponProjectileParams                                AmmoParams;                                        // 0x70(0xb8)
	bool                                                         UsesScope;                                         // 0x128(0x1)
	float                                                        ZoomedRecoilDurationIncrease;                      // 0x12c(0x4)
	float                                                        SecondsUntilZoomStarts;                            // 0x130(0x4)
	float                                                        SecondsUntilPostStarts;                            // 0x134(0x4)
	float                                                        WeaponFiredAINoiseRange;                           // 0x138(0x4)
	float                                                        MaximumRequestPositionDelta;                       // 0x13c(0x4)
	float                                                        MaximumRequestAngleDelta;                          // 0x140(0x4)
	float                                                        TimeoutTolerance;                                  // 0x144(0x4)
	float                                                        AimingMoveSpeedScalar;                             // 0x148(0x4)
	byte                                                         AimSensitivitySettingCategory;                     // 0x14c(0x1)
	float                                                        InAimFOV;                                          // 0x150(0x4)
	float                                                        BlendSpeed;                                        // 0x154(0x4)
	Class WwiseEvent*                                            DryFireSfx;                                        // 0x158(0x8)
	Struct AudioEmitterParameters                                AudioEmitterParameters;                            // 0x160(0x10)
	struct FName                                                 RumbleTag;                                         // 0x170(0x8)
	bool                                                         KnockbackEnabled;                                  // 0x178(0x1)
	Struct KnockBackInfo                                         KnockbackParams;                                   // 0x17c(0x50)
	bool                                                         StunEnabled;                                       // 0x1cc(0x1)
	float                                                        StunDuration;                                      // 0x1d0(0x4)
	Struct Vector                                                TargetingOffset;                                   // 0x1d4(0xc)
};


// Size 0x18
class ProjectileShotParams: public None
{
public:
	int                                                          Seed;                                              // 0x0(0x4)
	float                                                        ProjectileDistributionMaxAngle;                    // 0x4(0x4)
	int                                                          NumberOfProjectiles;                               // 0x8(0x4)
	float                                                        ProjectileMaximumRange;                            // 0xc(0x4)
	float                                                        ProjectileDamage;                                  // 0x10(0x4)
	float                                                        ProjectileDamageMultiplierAtMaximumRange;          // 0x14(0x4)
};


// Size 0x1c
class Projectile: public None
{
public:
	Struct Vector                                                Origin;                                            // 0x0(0xc)
	Struct Vector                                                Direction;                                         // 0xc(0xc)
	float                                                        MaxDistance;                                       // 0x18(0x4)
};


// Size 0x90
class FireBroadcast: public None
{
public:
	Class Actor*                                                 Instigator;                                        // 0x0(0x8)
	TArray<Struct Instigator>                                    HitResults;                                        // 0x8(0x10)
	Struct Vector                                                FirePosition;                                      // 0x18(0xc)
	Struct Vector                                                FireDirection;                                     // 0x24(0xc)
	Struct ProjectileAim                                         ProjectileAim;                                     // 0x30(0x50)
	int                                                          ProjectileSeed;                                    // 0x80(0x4)
};


// Size 0x90
class FireRequest: public None
{
public:
	Class Actor*                                                 Instigator;                                        // 0x0(0x8)
	Struct RemoteProjectileAim                                   RemoteAimData;                                     // 0x10(0x60)
	TArray<Struct RemoteAimData>                                 HitResults;                                        // 0x70(0x10)
	Struct Guid                                                  TelemetryAttackId;                                 // 0x80(0x10)
};


// Size 0x60
class RemoteProjectileAim: public None
{
public:
	Struct ProjectileAim                                         AimData;                                           // 0x0(0x50)
	bool                                                         IsRelativeAim;                                     // 0x50(0x1)
	Struct ProjectileTimeStamp                                   TimeStamp;                                         // 0x58(0x8)
};


// Size 0x8
class ProjectileTimeStamp: public None
{
public:
};


// Size 0x10
class AchievementBlockThenHitAndGetBlockedThenTakeHit: public None
{
public:
	Class AthenaPlayerCharacter*                                 Character;                                         // 0x0(0x8)
	float                                                        TimeWindowInSeconds;                               // 0x8(0x4)
};


// Size 0x20
class AchievementHaveADrinkWithAnotherCrewAtAnOutpost: public None
{
public:
	Class AthenaPlayerCharacter*                                 Character;                                         // 0x0(0x8)
	float                                                        RangeOfCheckInMetres;                              // 0x18(0x4)
	float                                                        DrinkConsumedVolumeThreshold;                      // 0x1c(0x4)
};


// Size 0x10
class AchievementHeavyAttackRivalOffTheirShip: public None
{
public:
	Class AthenaCharacter*                                       Character;                                         // 0x0(0x8)
	float                                                        TimeWindowInSeconds;                               // 0x8(0x4)
};


// Size 0x4
class AchievementKillOpponentFromBehindWithBlunderbuss: public None
{
public:
	float                                                        FacingDirAngleTolerance;                           // 0x0(0x4)
};


// Size 0x8
class AchievementKillOpponentInContest: public None
{
public:
};


// Size 0xc
class SprintConditionsParams: public None
{
public:
	float                                                        ForwardInputVectorTolerance;                       // 0x0(0x4)
	float                                                        MinVelocityForwardDot;                             // 0x4(0x4)
	float                                                        MinVelocityMagnitude;                              // 0x8(0x4)
};


// Size 0x48
class SprintLogicHandler: public None
{
public:
};


// Size 0x18
class CloudTypeNormalizedWeight: public None
{
public:
	Struct LinearColor                                           LodScreenPercentages;                              // 0x0(0x10)
	float                                                        ProbabilityWeight;                                 // 0x10(0x4)
	float                                                        MeshRadius;                                        // 0x14(0x4)
};


// Size 0x30
class CloudTypeDefinition: public None
{
public:
	Class StaticMesh*                                            CloudMesh;                                         // 0x0(0x8)
	Class StaticMesh*                                            CloudFluffyMesh;                                   // 0x8(0x8)
	Struct Vector2D                                              ScaleRange;                                        // 0x10(0x8)
	Struct Vector2D                                              StorminessRange;                                   // 0x18(0x8)
	float                                                        ProbabilityWeight;                                 // 0x20(0x4)
	float                                                        OverlapTolerance;                                  // 0x24(0x4)
	bool                                                         IsStreetCloud;                                     // 0x28(0x1)
	bool                                                         CastsShadow;                                       // 0x29(0x1)
};


// Size 0x30
class RenderedCloudProperties: public None
{
public:
	Struct Vector                                                WorldPosition;                                     // 0x0(0xc)
	float                                                        Fade;                                              // 0xc(0x4)
	float                                                        Storminess;                                        // 0x10(0x4)
	float                                                        RotationYaw;                                       // 0x14(0x4)
	float                                                        StreetRotationFront;                               // 0x18(0x4)
	float                                                        StreetRotationBack;                                // 0x1c(0x4)
	bool                                                         Visible;                                           // 0x20(0x1)
	bool                                                         FluffVisible;                                      // 0x21(0x1)
	bool                                                         IsStreetCloud;                                     // 0x22(0x1)
	bool                                                         UpdatesThisFrame;                                  // 0x23(0x1)
};


// Size 0x24
class TiledCloudProperties: public None
{
public:
	Struct Vector2D                                              TilePosition;                                      // 0x0(0x8)
	int                                                          CloudTypeIndex;                                    // 0x8(0x4)
	float                                                        RelativeRadius;                                    // 0xc(0x4)
	float                                                        Scale;                                             // 0x10(0x4)
	float                                                        PressureThreshold;                                 // 0x14(0x4)
	float                                                        RotationYaw;                                       // 0x18(0x4)
	float                                                        OverlapTolerance;                                  // 0x1c(0x4)
};


// Size 0x70
class CloudVisualParameters: public None
{
public:
	bool                                                         RenderInMainPass;                                  // 0x0(0x1)
	Struct Vector                                                ScalingVector;                                     // 0x4(0xc)
	Struct Vector2D                                              BillboardScale;                                    // 0x10(0x8)
	Struct Vector2D                                              BillboardRandomScale;                              // 0x18(0x8)
	Struct Vector2D                                              BillboardRearCutOff;                               // 0x20(0x8)
	Struct Vector2D                                              BillboardForeCutOff;                               // 0x28(0x8)
	Struct Vector2D                                              BillboardSink;                                     // 0x30(0x8)
	float                                                        BillboardScaleAlphaDependence;                     // 0x38(0x4)
	float                                                        BillboardRotationRate;                             // 0x3c(0x4)
	float                                                        DistanceFadeExponent;                              // 0x40(0x4)
	float                                                        TurbulenceScale;                                   // 0x44(0x4)
	float                                                        TurbulenceStrength;                                // 0x48(0x4)
	float                                                        FluffCullDistance;                                 // 0x4c(0x4)
	Class MaterialInterface*                                     MaterialTemplatePointCloudSolid;                   // 0x50(0x8)
	Class MaterialInterface*                                     MaterialTemplatePointCloudFluffy;                  // 0x58(0x8)
	Class MaterialInterface*                                     MaterialTemplateStreetCloudSolid;                  // 0x60(0x8)
	Class MaterialInterface*                                     MaterialTemplateStreetCloudFluffy;                 // 0x68(0x8)
};


// Size 0x8
class WalkConditionsParams: public None
{
public:
	float                                                        WalkSpeedMultiplier;                               // 0x0(0x4)
	float                                                        WalkStopThreshold;                                 // 0x4(0x4)
};


// Size 0xc
class WalkLogicHandler: public None
{
public:
};


// Size 0x28
class AthenaPlayerCharacterModelSwap: public None
{
public:
	Class SkeletalMesh*                                          FirstPersonMesh;                                   // 0x0(0x8)
	class                                                        FirstPersonAnimSetDataId;                          // 0x8(0x8)
	Class SkeletalMesh*                                          ThirdPersonMesh;                                   // 0x10(0x8)
	class                                                        ThirdPersonAnimSetDataId;                          // 0x18(0x8)
};


// Size 0x28
class Alliance: public None
{
public:
	Struct Guid                                                  AllianceId;                                        // 0x0(0x10)
	TArray<Struct AllianceId>                                    Crews;                                             // 0x10(0x10)
	byte                                                         AllianceIndex;                                     // 0x20(0x1)
};


// Size 0x14
class CrewAllianceJoinStatus: public None
{
public:
	Struct Guid                                                  CrewId;                                            // 0x0(0x10)
	byte                                                         AllianceJoinStatus;                                // 0x10(0x1)
	byte                                                         LastAllianceJoinStatus;                            // 0x11(0x1)
};


// Size 0x68
class NPCCustomAnimationBlueprintData: public None
{
public:
	bool                                                         SequenceActive;                                    // 0x0(0x1)
	bool                                                         LoopActive;                                        // 0x1(0x1)
	int                                                          ActiveSequenceIndex;                               // 0x4(0x4)
	bool                                                         IsOneShot;                                         // 0x8(0x1)
	Struct NPCCustomAnimationBlueprintPlayingAnimations          BlueprintPlayingAnimations;                        // 0x10(0x28)
	Struct NPCCustomAnimationBlueprintPlayingMontage             BlueprintPlayingFacialMontages;                    // 0x38(0x28)
	byte                                                         CustomAnimationState;                              // 0x60(0x1)
};


// Size 0x28
class NPCCustomAnimationBlueprintPlayingMontage: public None
{
public:
	Class AnimMontage*                                           OneShot;                                           // 0x0(0x8)
	Class AnimMontage*                                           ContinouousIn;                                     // 0x8(0x8)
	Class AnimMontage*                                           ContinouousLoop_A;                                 // 0x10(0x8)
	Class AnimMontage*                                           ContinouousLoop_B;                                 // 0x18(0x8)
	Class AnimMontage*                                           ContinouousOut;                                    // 0x20(0x8)
};


// Size 0x28
class NPCCustomAnimationBlueprintPlayingAnimations: public None
{
public:
	Class AnimSequenceBase*                                      OneShot;                                           // 0x0(0x8)
	Class AnimSequenceBase*                                      ContinouousIn;                                     // 0x8(0x8)
	Class AnimSequenceBase*                                      ContinouousLoop_A;                                 // 0x10(0x8)
	Class AnimSequenceBase*                                      ContinouousLoop_B;                                 // 0x18(0x8)
	Class AnimSequenceBase*                                      ContinouousOut;                                    // 0x20(0x8)
};


// Size 0x38
class NPCCustomAnimationDataStructure: public None
{
public:
	TArray<Struct NPCOneShotAnimationElement>                    OneShotSequences;                                  // 0x0(0x10)
	TArray<Struct NPCContinuousAnimationElement>                 ContinuousSequences;                               // 0x10(0x10)
	Class NPCHeldObjectData*                                     WieldableCosmeticItemList;                         // 0x20(0x8)
	TArray<Struct NPCInitialSpawnedCosmeticItems>                InitialSpawnedCosmeticItems;                       // 0x28(0x10)
};


// Size 0x10
class NPCInitialSpawnedCosmeticItems: public None
{
public:
	class                                                        CosmeticItemObject;                                // 0x0(0x8)
	struct FName                                                 AttachSocketName;                                  // 0x8(0x8)
};


// Size 0x38
class NPCContinuousAnimationElement: public None
{
public:
	struct FName                                                 SequenceName;                                      // 0x0(0x8)
	Struct NPCAnimationContinuousCycle                           ContinuousSequence;                                // 0x8(0x30)
};


// Size 0x30
class NPCAnimationContinuousCycle: public None
{
public:
	Struct NPCAnimationSequence                                  In;                                                // 0x0(0x10)
	TArray<Struct In>                                            Loop;                                              // 0x10(0x10)
	Struct NPCAnimationSequence                                  Out;                                               // 0x20(0x10)
};


// Size 0x10
class NPCAnimationSequence: public None
{
public:
	Class AnimSequenceBase*                                      AnimationSequence;                                 // 0x0(0x8)
	Class AnimMontage*                                           FacialAdditive;                                    // 0x8(0x8)
};


// Size 0x18
class NPCOneShotAnimationElement: public None
{
public:
	struct FName                                                 SequenceName;                                      // 0x0(0x8)
	TArray<Struct SequenceName>                                  OneShotSequence;                                   // 0x8(0x10)
};


// Size 0x20
class AnimNotifyWwiseObserver: public None
{
public:
	Class WwiseEvent*                                            OnEventPosted;                                     // 0x0(0x8)
	bool                                                         PreventPlayingPostedEvent;                         // 0x8(0x1)
	TArray<class AdditionalEventsToTrigger*>                     AdditionalEventsToTrigger;                         // 0x10(0x10)
};


// Size 0x14
class JoinedCrew: public None
{
public:
};


// Size 0x58
class AthenaAnimationCustomSkeletonAnimationBlueprintData: public None
{
public:
	bool                                                         SequenceActive;                                    // 0x0(0x1)
	bool                                                         LoopActive;                                        // 0x1(0x1)
	int                                                          ActiveSequenceIndex;                               // 0x4(0x4)
	bool                                                         IsOneShot;                                         // 0x8(0x1)
	Struct SkeletonCustomAnimationBlueprintPlayingAnimations     BlueprintPlayingAnimations;                        // 0x10(0x38)
	Class NPCHeldObjectData*                                     WieldableCosmeticItemList;                         // 0x48(0x8)
	byte                                                         CustomAnimationState;                              // 0x50(0x1)
	float                                                        BlendTime;                                         // 0x54(0x4)
};


// Size 0x38
class SkeletonCustomAnimationBlueprintPlayingAnimations: public None
{
public:
	Class AnimSequence*                                          OneShot;                                           // 0x0(0x8)
	Class AnimSequence*                                          ContinuousIn;                                      // 0x8(0x8)
	Class AnimSequence*                                          ContinuousLoop_A;                                  // 0x10(0x8)
	Class AnimSequence*                                          ContinuousLoop_B;                                  // 0x18(0x8)
	Class AnimSequence*                                          ContinuousOut;                                     // 0x20(0x8)
	TArray<class AlternateContinuousOuts*>                       AlternateContinuousOuts;                           // 0x28(0x10)
};


// Size 0x38
class SkeletonCustomAnimationDataStructure: public None
{
public:
	TArray<Struct OneShotAnimationElement>                       OneShotSequences;                                  // 0x0(0x10)
	TArray<Struct ContinuousAnimationElement>                    ContinuousSequences;                               // 0x10(0x10)
	Class NPCHeldObjectData*                                     WieldableCosmeticItemList;                         // 0x20(0x8)
	TArray<class AudioEvents*>                                   AudioEvents;                                       // 0x28(0x10)
};


// Size 0x58
class ContinuousAnimationElement: public None
{
public:
	struct FName                                                 SequenceName;                                      // 0x0(0x8)
	Struct AnimationContinuousCycle                              ContinuousSequence;                                // 0x8(0x48)
	float                                                        BlendTime;                                         // 0x50(0x4)
};


// Size 0x48
class AnimationContinuousCycle: public None
{
public:
	Class AnimSequence*                                          In;                                                // 0x0(0x8)
	float                                                        InEffectTime;                                      // 0x8(0x4)
	TArray<class Loop*>                                          Loop;                                              // 0x10(0x10)
	Class BlendSpace1D*                                          LoopHitReact;                                      // 0x20(0x8)
	Class AnimSequence*                                          Out;                                               // 0x28(0x8)
	TArray<class OutAlternates*>                                 OutAlternates;                                     // 0x30(0x10)
	float                                                        OutUndockTime;                                     // 0x40(0x4)
};


// Size 0x20
class OneShotAnimationElement: public None
{
public:
	struct FName                                                 SequenceName;                                      // 0x0(0x8)
	TArray<class OneShotSequence*>                               OneShotSequence;                                   // 0x8(0x10)
	float                                                        EffectTime;                                        // 0x18(0x4)
	float                                                        BlendTime;                                         // 0x1c(0x4)
};


// Size 0x68
class AthenaAnimationLocomotion: public None
{
public:
	Struct Vector                                                CharacterVelocity;                                 // 0x0(0xc)
	float                                                        WantedMovementSpeed;                               // 0xc(0x4)
	float                                                        HalfWantedMovementSpeed;                           // 0x10(0x4)
	bool                                                         CharacterMoving;                                   // 0x14(0x1)
	bool                                                         RunStopWanted;                                     // 0x15(0x1)
	float                                                        TurnRate;                                          // 0x18(0x4)
	float                                                        CurrentYaw;                                        // 0x1c(0x4)
	float                                                        CurrentDirection;                                  // 0x20(0x4)
	bool                                                         TurningActive;                                     // 0x24(0x1)
	bool                                                         TurningLeft;                                       // 0x25(0x1)
	bool                                                         IsSwimming;                                        // 0x26(0x1)
	bool                                                         IsUnderwaterSwimming;                              // 0x27(0x1)
	float                                                        BlendedTurnRate;                                   // 0x28(0x4)
	float                                                        MinimumMoveSpeedToTriggerRunStop;                  // 0x2c(0x4)
	float                                                        InterpSpeed;                                       // 0x30(0x4)
	float                                                        TurnRateToDisableTurns;                            // 0x34(0x4)
	float                                                        TurningAnimationExplicitTime;                      // 0x38(0x4)
	float                                                        FixedBlendedTurnRateForAI;                         // 0x3c(0x4)
	bool                                                         IsInAITurn;                                        // 0x40(0x1)
	Class AthenaAnimationInstance*                               CachedOwner;                                       // 0x58(0x8)
};


// Size 0x340
class AthenaAnimationFishing: public None
{
public:
	bool                                                         AnimationOverride;                                 // 0x0(0x1)
	Class Actor*                                                 FishingRodActor;                                   // 0x320(0x8)
	Class Actor*                                                 FishingFloat;                                      // 0x328(0x8)
	Class AthenaAnimationInstance*                               OwningAnimationInstance;                           // 0x330(0x8)
};


// Size 0x34
class AthenaAnimationFishingParams: public None
{
public:
	byte                                                         FishingState;                                      // 0x0(0x1)
	bool                                                         InFishing;                                         // 0x1(0x1)
	Struct Vector2D                                              RodBend;                                           // 0x4(0x8)
	float                                                        ReelSpeed;                                         // 0xc(0x4)
	bool                                                         CastFailed;                                        // 0x10(0x1)
	bool                                                         IsFishHookedAndVisible;                            // 0x11(0x1)
	Struct Vector2D                                              PlayerInputForce;                                  // 0x14(0x8)
	float                                                        TensionShake;                                      // 0x1c(0x4)
	float                                                        LineSnapShake;                                     // 0x20(0x4)
	bool                                                         IKIsActive;                                        // 0x24(0x1)
	float                                                        IKBlendInSpeed;                                    // 0x28(0x4)
	float                                                        IKBlendIOutSpeed;                                  // 0x2c(0x4)
	bool                                                         IsComedyItem;                                      // 0x30(0x1)
	byte                                                         FishingJIPState;                                   // 0x31(0x1)
};


// Size 0x10
class AthenaAnimationIdleVariantChange: public None
{
public:
	float                                                        CurrentTime;                                       // 0x0(0x4)
	float                                                        TriggerTime;                                       // 0x4(0x4)
	int                                                          VariantID;                                         // 0x8(0x4)
	bool                                                         VariantCompleted;                                  // 0xc(0x1)
};


// Size 0xc8
class AthenaAnimationRowboatParams: public None
{
public:
	bool                                                         InLeftArmRow;                                      // 0x0(0x1)
	bool                                                         InLeftArmRecover;                                  // 0x1(0x1)
	bool                                                         InRightArmRow;                                     // 0x2(0x1)
	bool                                                         InRightArmRecover;                                 // 0x3(0x1)
	float                                                        LeftArmForce;                                      // 0x4(0x4)
	float                                                        LeftArmRecover;                                    // 0x8(0x4)
	float                                                        RightArmForce;                                     // 0xc(0x4)
	float                                                        RightArmRecover;                                   // 0x10(0x4)
	byte                                                         Braking;                                           // 0x14(0x1)
	bool                                                         BrakingLeftOrBoth;                                 // 0x15(0x1)
	bool                                                         BrakingRightOrBoth;                                // 0x16(0x1)
	int                                                          Direction;                                         // 0x18(0x4)
	bool                                                         PlayIdle;                                          // 0x1c(0x1)
	bool                                                         LeftArmInactive;                                   // 0x1d(0x1)
	bool                                                         RightArmInactive;                                  // 0x1e(0x1)
	Struct Vector                                                CameraAdjustment;                                  // 0x20(0xc)
	bool                                                         IsSeated;                                          // 0x2c(0x1)
	Struct AthenaAnimationRowboatAnimationsFirstPerson           RowBoatAnimationsFirstPerson;                      // 0x30(0x30)
	Struct AthenaAnimationRowboatAnimationsThirdPerson           RowBoatAnimationsThirdPerson;                      // 0x60(0x50)
	Struct AthenaAnimationRowboatAnimationsPassenger             RowBoatAnimationsPassenger;                        // 0xb0(0x18)
};


// Size 0x18
class AthenaAnimationRowboatAnimationsPassenger: public None
{
public:
	Class AnimSequence*                                          PassengerIntoSitting;                              // 0x0(0x8)
	Class AnimSequence*                                          PassengerSittingIdle;                              // 0x8(0x8)
	Class AnimSequence*                                          PassengerStand;                                    // 0x10(0x8)
};


// Size 0x50
class AthenaAnimationRowboatAnimationsThirdPerson: public None
{
public:
	Class AnimSequence*                                          SitDown;                                           // 0x0(0x8)
	Class AnimSequence*                                          Stand;                                             // 0x8(0x8)
	Class AnimSequence*                                          Idle;                                              // 0x10(0x8)
	Class BlendSpace1D*                                          Row;                                               // 0x18(0x8)
	Class BlendSpace1D*                                          Recover;                                           // 0x20(0x8)
	Class BlendSpace1D*                                          IntoRow;                                           // 0x28(0x8)
	Class BlendSpace1D*                                          IntoRowBrake;                                      // 0x30(0x8)
	Class BlendSpace1D*                                          BrakeRow;                                          // 0x38(0x8)
	Class BlendSpace1D*                                          BrakeRecover;                                      // 0x40(0x8)
	Class BlendSpace1D*                                          BrakeIdle;                                         // 0x48(0x8)
};


// Size 0x30
class AthenaAnimationRowboatAnimationsFirstPerson: public None
{
public:
	Class AnimSequence*                                          SitDown;                                           // 0x0(0x8)
	Class AnimSequence*                                          Stand;                                             // 0x8(0x8)
	Class AnimSequence*                                          Idle;                                              // 0x10(0x8)
	Class AnimSequence*                                          Row;                                               // 0x18(0x8)
	Class AnimSequence*                                          Recover;                                           // 0x20(0x8)
	Class AnimSequence*                                          Brake;                                             // 0x28(0x8)
};


// Size 0xc0
class AthenaAnimationRowing: public None
{
public:
	Class Actor*                                                 ControlledObject;                                  // 0x0(0x8)
	Class Actor*                                                 CachedPlayerCharacter;                             // 0x8(0x8)
	class                                                        CosmeticOarClass;                                  // 0x10(0x8)
};


// Size 0x510
class AthenaAnimationWieldedItemStateMachine: public None
{
public:
	byte                                                         CurrentState;                                      // 0x0(0x1)
	byte                                                         PreviousState;                                     // 0x1(0x1)
	bool                                                         ExpectingTransition;                               // 0x2(0x1)
	class                                                        ContinuousUseInputId;                              // 0x8(0x8)
	class                                                        OutOfContinuousUseInputId;                         // 0x10(0x8)
	class                                                        OneShotUseInputId;                                 // 0x18(0x8)
	bool                                                         OneShotIsAlternate;                                // 0x20(0x1)
	bool                                                         ContinuousIsAlternate;                             // 0x21(0x1)
	byte                                                         OneShotAnimationVariant;                           // 0x22(0x1)
	bool                                                         IdleIsAlternate;                                   // 0x23(0x1)
	bool                                                         UsePrimaryContinuousAnimations;                    // 0x24(0x1)
	bool                                                         UsePrimaryContinuousOutOfAnimations;               // 0x25(0x1)
	bool                                                         UsePrimaryOneShotAnimations;                       // 0x26(0x1)
	Class AnimSequence*                                          LastValidAnimSequence;                             // 0x50(0x8)
	Class BlendSpace1D*                                          LastValidBlendspace;                               // 0x58(0x8)
	Class Actor*                                                 PreviousWieldedItem;                               // 0x60(0x8)
	bool                                                         DuplicateTransition;                               // 0x68(0x1)
	struct FName                                                 WieldSockets;                                      // 0x6c(0x8)
};


// Size 0x28
class AthenaAnimationSkeletonCurseAnimations: public None
{
public:
	Class AnimSequence*                                          SkeletonDrunk;                                     // 0x0(0x8)
	Class AnimSequence*                                          SkeletonDance;                                     // 0x8(0x8)
	Class AnimSequence*                                          SkeletonSleepInto;                                 // 0x10(0x8)
	Class AnimSequence*                                          SkeletonSleepLoop;                                 // 0x18(0x8)
	Class AnimSequence*                                          SkeletonSleepOut;                                  // 0x20(0x8)
};


// Size 0x8
class AthenaAnimationSkeletonScream: public None
{
public:
	Class AnimSequence*                                          SkeletonScream;                                    // 0x0(0x8)
};


// Size 0x38
class AthenaAnimationSkeletonFleeInGraph: public None
{
public:
	Class AnimSequence*                                          TurnLeft;                                          // 0x0(0x8)
	Class AnimSequence*                                          TurnRight;                                         // 0x8(0x8)
	Class BlendSpace*                                            LocomotionBase;                                    // 0x10(0x8)
	Class BlendSpace*                                            LocomotionVariant;                                 // 0x18(0x8)
	TArray<class LocomotionVariantSelection*>                    LocomotionVariantSelection;                        // 0x20(0x10)
	int                                                          PrecentageChanceOfVariantOccuring;                 // 0x30(0x4)
};


// Size 0x40
class AthenaAnimationSkeletonFlee: public None
{
public:
	class                                                        UseWithObject;                                     // 0x0(0x8)
	TArray<class FleeTurnLeft*>                                  FleeTurnLeft;                                      // 0x8(0x10)
	TArray<class FleeTurnRight*>                                 FleeTurnRight;                                     // 0x18(0x10)
	Class BlendSpace*                                            FleeLocomotionBase;                                // 0x28(0x8)
	TArray<class FleeLocomotionVariants*>                        FleeLocomotionVariants;                            // 0x30(0x10)
};


// Size 0x38
class AthenaAnimationSkeletonEmoteActionParams: public None
{
public:
	TArray<Struct AthenaAnimationSkeletonEmoteActionAnimations>  AllLoadedAIEmoteActionAnimations;                  // 0x0(0x10)
	byte                                                         CurrentEmoteActionState;                           // 0x10(0x1)
	Class AnimSequence*                                          TauntAnimation;                                    // 0x18(0x8)
	Class AnimSequence*                                          CheerAnimation;                                    // 0x20(0x8)
	Class AnimSequence*                                          TauntAnimationB;                                   // 0x28(0x8)
	Class AnimSequence*                                          CheerAnimationB;                                   // 0x30(0x8)
};


// Size 0x28
class AthenaAnimationSkeletonEmoteActionAnimations: public None
{
public:
	class                                                        UseWithObject;                                     // 0x0(0x8)
	TArray<class Taunt*>                                         Taunt;                                             // 0x8(0x10)
	TArray<class Cheer*>                                         Cheer;                                             // 0x18(0x10)
};


// Size 0x60
class AthenaAnimationSkeletonShipCaptainParams: public None
{
public:
	Struct AthenaAnimationSkeletonShipCaptainAnimations          AllSkeletonShipCaptainAnimations;                  // 0x0(0x48)
	Class AnimSequence*                                          ShipCaptainIdleCycleA;                             // 0x48(0x8)
	Class AnimSequence*                                          ShipCaptainIdleCycleB;                             // 0x50(0x8)
	byte                                                         DockedAnimationState;                              // 0x58(0x1)
};


// Size 0x48
class AthenaAnimationSkeletonShipCaptainAnimations: public None
{
public:
	Class AnimSequence*                                          EnterDockedPose;                                   // 0x0(0x8)
	TArray<class DockedIdles*>                                   DockedIdles;                                       // 0x8(0x10)
	Class AnimSequence*                                          ExitDockedPose;                                    // 0x18(0x8)
	Class AnimSequence*                                          Taunt;                                             // 0x20(0x8)
	Class AnimSequence*                                          RamInto;                                           // 0x28(0x8)
	Class AnimSequence*                                          RamCycle;                                          // 0x30(0x8)
	Class AnimSequence*                                          RamImpact;                                         // 0x38(0x8)
	Class AnimSequence*                                          RamOutOf;                                          // 0x40(0x8)
};


// Size 0x38
class AthenaAnimationSkeletonSensingParams: public None
{
public:
	TArray<Struct AthenaAnimationSkeletonSensingAnimations>      AllLoadedAISensingAnimations;                      // 0x0(0x10)
	byte                                                         CurrentSensingState;                               // 0x10(0x1)
	Class AnimSequence*                                          InitialReactionAnimation;                          // 0x18(0x8)
	Class BlendSpace1D*                                          SearchingAnimation;                                // 0x20(0x8)
	Class AnimSequence*                                          AlertingOthersAnimation;                           // 0x28(0x8)
	Class BlendSpace1D*                                          PursuitAnimation;                                  // 0x30(0x8)
};


// Size 0x28
class AthenaAnimationSkeletonSensingAnimations: public None
{
public:
	class                                                        UseWithObject;                                     // 0x0(0x8)
	Class AnimSequence*                                          InitialReaction;                                   // 0x8(0x8)
	Class BlendSpace1D*                                          Searching;                                         // 0x10(0x8)
	Class AnimSequence*                                          AlertingOthers;                                    // 0x18(0x8)
	Class BlendSpace1D*                                          Pursuit;                                           // 0x20(0x8)
};


// Size 0x2e8
class AthenaAnimationAI: public None
{
public:
	bool                                                         SpawnAnimationActive;                              // 0x0(0x1)
	bool                                                         SpawnAnimationReadyToBegin;                        // 0x1(0x1)
	Class AnimSequence*                                          AISpawn;                                           // 0x8(0x8)
	Class AnimSequence*                                          AIDespawn;                                         // 0x10(0x8)
	float                                                        AIAnimationSpawnTime;                              // 0x18(0x4)
	bool                                                         AISpawnOnLand;                                     // 0x1c(0x1)
	bool                                                         AIFleeActive;                                      // 0x1d(0x1)
	Struct AthenaAnimationSkeletonSensingParams                  AISensing;                                         // 0x20(0x38)
	Struct AthenaAnimationSkeletonEmoteActionParams              AIEmoteActions;                                    // 0x58(0x38)
	Struct AthenaAnimationSkeletonShipCaptainParams              SkeletonShipCaptainParams;                         // 0x90(0x60)
};


// Size 0x30
class AthenaAnimationAIKnockback: public None
{
public:
	Struct AthenaAnimationSkeletonKnockbackLocomotionStrength    KnockbackAnimations;                               // 0x0(0x20)
	byte                                                         AIKnockbackDirection;                              // 0x20(0x1)
	bool                                                         KnockbackActive;                                   // 0x24(0x1)
	Class AnimSequence*                                          KnockbackAnimToUse;                                // 0x28(0x8)
};


// Size 0x20
class AthenaAnimationSkeletonKnockbackLocomotionStrength: public None
{
public:
	Struct AthenaAnimationSkeletonKnockbackLocomotion            LowStrength;                                       // 0x0(0x10)
	Struct AthenaAnimationSkeletonKnockbackLocomotion            HighStrength;                                      // 0x10(0x10)
};


// Size 0x10
class AthenaAnimationSkeletonKnockbackLocomotion: public None
{
public:
	Class AnimSequence*                                          Forwards;                                          // 0x0(0x8)
	Class AnimSequence*                                          Backwards;                                         // 0x8(0x8)
};


// Size 0x58
class AthenaAnimationFootPlanting: public None
{
public:
	Struct CollisionResponseContainer                            OverrideRaycast;                                   // 0x8(0x20)
	float                                                        HipHeight;                                         // 0x28(0x4)
	float                                                        HipPullStrength;                                   // 0x2c(0x4)
	float                                                        FloorContactDownDistance;                          // 0x30(0x4)
	float                                                        RelativePlantDownDistance;                         // 0x34(0x4)
	float                                                        FloorContactToRangeStart;                          // 0x38(0x4)
	float                                                        FloorContactToRangeEnd;                            // 0x3c(0x4)
	float                                                        RelativePlantToRangeStart;                         // 0x40(0x4)
	float                                                        RelativePlantToRangeEnd;                           // 0x44(0x4)
	float                                                        IKLegStretch;                                      // 0x48(0x4)
	float                                                        SlopeAngle;                                        // 0x4c(0x4)
	bool                                                         Active;                                            // 0x50(0x1)
	bool                                                         FeetContact;                                       // 0x51(0x1)
};


// Size 0x8
class AthenaAnimationStunData: public None
{
public:
	byte                                                         StunAnimType;                                      // 0x0(0x1)
	bool                                                         IsCursedVariant;                                   // 0x4(0x1)
};


// Size 0x28
class AthenaAnimationHarpoonLauncherAnimData: public None
{
public:
	TArray<class Idle*>                                          Idle;                                              // 0x0(0x10)
	Class BlendSpace1D*                                          FireInto;                                          // 0x10(0x8)
	Class BlendSpace1D*                                          FireOutOf;                                         // 0x18(0x8)
	Class BlendSpace1D*                                          FireAction;                                        // 0x20(0x8)
};


// Size 0xf8
class AthenaAnimationMountedWeapon: public None
{
public:
	bool                                                         IsFiring;                                          // 0x0(0x1)
	float                                                        Pitch;                                             // 0x4(0x4)
	float                                                        Yaw;                                               // 0x8(0x4)
	Class Actor*                                                 ControlledObject;                                  // 0x10(0x8)
};


// Size 0x38
class AssetDelayLoadEntry: public None
{
public:
	Struct FString                                               Comment;                                           // 0x0(0x10)
	byte                                                         LoadAtPhase;                                       // 0x10(0x1)
	byte                                                         Persistence;                                       // 0x11(0x1)
	bool                                                         LoadForClient;                                     // 0x12(0x1)
	bool                                                         LoadForServer;                                     // 0x13(0x1)
	TArray<Struct LoadForServer>                                 AssetsToLoad;                                      // 0x18(0x10)
	TArray<AssetClass AssetsToLoad>                              BlueprintsToLoad;                                  // 0x28(0x10)
};


// Size 0x10
class RequestedLoopAnims: public None
{
public:
	struct FName                                                 RequestedLoopingAnimName;                          // 0x0(0x8)
	int                                                          RequestedOutOfAnimIndex;                           // 0x8(0x4)
	int                                                          AnimationAssetRequired;                            // 0xc(0x4)
};


// Size 0xc8
class VoyageParticipantViewContainer: public None
{
public:
	Struct VoyageParticipantView                                 State;                                             // 0x0(0xc8)
};


// Size 0xc8
class VoyageParticipantView: public None
{
public:
	Struct FText                                                 Title;                                             // 0x0(0x38)
	Struct Guid                                                  Id;                                                // 0x38(0x10)
	int                                                          ChapterIndex;                                      // 0x48(0x4)
	int                                                          ChapterCount;                                      // 0x4c(0x4)
	int                                                          ActiveQuestCount;                                  // 0x50(0x4)
	byte                                                         History;                                           // 0x54(0x1)
	class                                                        Company;                                           // 0x58(0x8)
	bool                                                         IsEmergent;                                        // 0x60(0x1)
	bool                                                         IsTale;                                            // 0x61(0x1)
	byte                                                         EmergentSource;                                    // 0x62(0x1)
	Struct ViewVoyageBanners                                     ViewVoyageBanners;                                 // 0x63(0x2)
	bool                                                         DoNotNotifyParticipantsOnVoyageComplete;           // 0x65(0x1)
	int                                                          Rank;                                              // 0x68(0x4)
	Struct NetActorPtr                                           PlayerStateOfDiscoverer;                           // 0x6c(0x14)
	bool                                                         IsDiscovererMe;                                    // 0x80(0x1)
	struct FName                                                 ChestRarity;                                       // 0x84(0x8)
	bool                                                         PlayAudio;                                         // 0x8c(0x1)
	int                                                          ChestDiscoveredId;                                 // 0x90(0x4)
	Class PopUpMessageDesc*                                      PopUpDesc;                                         // 0x98(0x8)
	int                                                          CollectCratesPopUpId;                              // 0xa0(0x4)
	TArray<Struct CollectCratesPopUpId>                          VoyageCompletionStats;                             // 0xa8(0x10)
	TArray<Struct VoyageCompletionStats>                         ReapersMarkCompletionStats;                        // 0xb8(0x10)
};


// Size 0x2
class ViewVoyageBanners: public None
{
public:
	byte                                                         ShowIntroBanners;                                  // 0x0(0x1)
	byte                                                         ShowOutroBanners;                                  // 0x1(0x1)
};


// Size 0x9c
class AthenaCharacterSwimParams: public None
{
public:
	float                                                        EnterSwimmingDepth;                                // 0x0(0x4)
	float                                                        ExitSwimmingDepth;                                 // 0x4(0x4)
	float                                                        FloatHeight;                                       // 0x8(0x4)
	float                                                        ThirdPersonMeshOffset;                             // 0xc(0x4)
	float                                                        ThirdPersonMeshAdjustTime;                         // 0x10(0x4)
	float                                                        FullGravityHeight;                                 // 0x14(0x4)
	float                                                        SurfaceSwimDepth;                                  // 0x18(0x4)
	float                                                        SurfaceSwimExitDepth;                              // 0x1c(0x4)
	float                                                        SubmergedBuoyancyDepth;                            // 0x20(0x4)
	float                                                        ZeroDragDepth;                                     // 0x24(0x4)
	float                                                        MaxBuoyancyAcceleration;                           // 0x28(0x4)
	float                                                        SubmergedBuoyancyAcceleration;                     // 0x2c(0x4)
	float                                                        SubmergedBuoyancyTime;                             // 0x30(0x4)
	float                                                        DragFactor;                                        // 0x34(0x4)
	float                                                        MaxDragAcceleration;                               // 0x38(0x4)
	float                                                        MinPushDownRoofAngle;                              // 0x3c(0x4)
	float                                                        MinPushDownRoofZ;                                  // 0x40(0x4)
	float                                                        MinCorrectionVelForSurfaceSwim;                    // 0x44(0x4)
	float                                                        SurfaceVelBlendTime;                               // 0x48(0x4)
	float                                                        UnderwaterSwimmingEntryPitch;                      // 0x4c(0x4)
	float                                                        UnderwaterSwimmingEntryAccel;                      // 0x50(0x4)
	float                                                        UnderwaterSwimDepth;                               // 0x54(0x4)
	float                                                        UnderwaterSwimmingDragSpeed;                       // 0x58(0x4)
	float                                                        UnderwaterSwimmingSpeed;                           // 0x5c(0x4)
	float                                                        PitchBlendOffRate;                                 // 0x60(0x4)
	float                                                        MaxSwimDepth;                                      // 0x64(0x4)
	float                                                        MaxSwimDepthBuoyancy;                              // 0x68(0x4)
	float                                                        MaxSwimDepthBuoyancyRange;                         // 0x6c(0x4)
	float                                                        MaxSwimDepthDragFactor;                            // 0x70(0x4)
	float                                                        CharacterCentreOffset;                             // 0x74(0x4)
	byte                                                         WaterDepthTraceQueryType;                          // 0x78(0x1)
	Struct AthenaCharacterSwimSpeed                              SurfaceSwimSpeeds;                                 // 0x7c(0xc)
	Struct AthenaCharacterSwimSpeed                              UnderwaterSwimSpeeds;                              // 0x88(0xc)
	float                                                        SurfaceSwimmingDepthWhenEnteredWater;              // 0x94(0x4)
};


// Size 0xc
class AthenaCharacterSwimSpeed: public None
{
public:
	float                                                        SprintSpdAmp;                                      // 0x0(0x4)
	float                                                        SprintAccelAmp;                                    // 0x4(0x4)
	float                                                        TurnSpeedScalar;                                   // 0x8(0x4)
};


// Size 0x10
class AthenaCharacterDodgeParams: public None
{
public:
	float                                                        DodgeCooldown;                                     // 0x0(0x4)
	float                                                        DodgeForce;                                        // 0x4(0x4)
	float                                                        GroundLaunchAngle;                                 // 0x8(0x4)
	bool                                                         DodgePerpendicularToGround;                        // 0xc(0x1)
	bool                                                         Disabled;                                          // 0xd(0x1)
};


// Size 0x8
class NetPositionErrorTolerance: public None
{
public:
	float                                                        ZDistance;                                         // 0x0(0x4)
	float                                                        XYDistance;                                        // 0x4(0x4)
};


// Size 0x48
class AthenaAnimationOverrideEntry: public None
{
public:
	struct FName                                                 Name;                                              // 0x0(0x8)
	Struct StringAssetReference                                  MeshFirstPerson;                                   // 0x8(0x10)
	Struct StringAssetReference                                  MeshThirdPerson;                                   // 0x18(0x10)
	Struct StringAssetReference                                  AnimationDataStore;                                // 0x28(0x10)
	class                                                        ALKFirstPerson;                                    // 0x38(0x8)
	class                                                        ALKThirdPerson;                                    // 0x40(0x8)
};


// Size 0x18
class FeatureToggledLevel: public None
{
public:
	struct FName                                                 Feature;                                           // 0x0(0x8)
	Struct StringAssetReference                                  Level;                                             // 0x8(0x10)
};


// Size 0x18
class FeatureToggledLevels: public None
{
public:
	struct FName                                                 Feature;                                           // 0x0(0x8)
	TArray<Struct Feature>                                       Levels;                                            // 0x8(0x10)
};


// Size 0x20
class PlayModeLevelArray: public None
{
public:
	TArray<Struct FirstInteractableTelemetryEvent>               PlayModeLevels;                                    // 0x0(0x10)
	TArray<Struct SubModeLevel>                                  SubModes;                                          // 0x10(0x10)
};


// Size 0x20
class SubModeLevel: public None
{
public:
	Struct FString                                               SubMode;                                           // 0x0(0x10)
	Struct StringAssetReference                                  Level;                                             // 0x10(0x10)
};


// Size 0x18
class FirstInteractableTelemetryEvent: public None
{
public:
	float                                                        StartTime;                                         // 0x0(0x4)
	float                                                        FirstSpinnerShownTime;                             // 0x4(0x4)
	float                                                        StartEntryLevelLoadTime;                           // 0x8(0x4)
	float                                                        StartLegalSplashTime;                              // 0xc(0x4)
	float                                                        EndLegalSplashTime;                                // 0x10(0x4)
	float                                                        FirstInteractableTime;                             // 0x14(0x4)
};


// Size 0x28
class LoadingTelemetryEvent: public None
{
public:
	Struct FString                                               LoadingEvent;                                      // 0x0(0x10)
	Struct FString                                               MapName;                                           // 0x10(0x10)
	float                                                        StartTime;                                         // 0x20(0x4)
	float                                                        EndTime;                                           // 0x24(0x4)
};


// Size 0xd8
class StorageContainerRefresher: public None
{
public:
};


// Size 0x18
class OnlineAthenaGameModeConfigurationSettings: public None
{
public:
	Struct Timespan                                              PreLoginEntitlementQueryTimeout;                   // 0x0(0x8)
	Struct Timespan                                              PreLoginPirateValidationTimeout;                   // 0x8(0x8)
	bool                                                         ConfigAllowCrossWorld;                             // 0x10(0x1)
};


// Size 0xc
class ServerLifetimeConfigurationSettings: public None
{
public:
	float                                                        ServerTimeToLiveSeconds;                           // 0x0(0x4)
	float                                                        HeartbeatFrequencySeconds;                         // 0x4(0x4)
	float                                                        MaxTimeToAcceptShutdownRequestSeconds;             // 0x8(0x4)
};


// Size 0x14
class ServerTelemetryConfigurationSettings: public None
{
public:
	float                                                        PlayerHeartbeatInterval;                           // 0x0(0x4)
	float                                                        PlayerHeartbeatAggregatePositionInterval;          // 0x4(0x4)
	bool                                                         TelemetryEnabled_ItemEquip;                        // 0x8(0x1)
	bool                                                         TelemetryEnabled_ItemUsageEnd;                     // 0x9(0x1)
	bool                                                         TelemetryEnabled_ItemUsageStart;                   // 0xa(0x1)
	bool                                                         TelemetryEnabled_ObjectUsageEnd;                   // 0xb(0x1)
	bool                                                         TelemetryEnabled_ObjectUsageStart;                 // 0xc(0x1)
	bool                                                         TelemetryEnabled_PlayerAction;                     // 0xd(0x1)
	bool                                                         TelemetryEnabled_PlayerChangedLoadout;             // 0xe(0x1)
	bool                                                         TelemetryEnabled_PlayerChangedShipLoadout;         // 0xf(0x1)
	bool                                                         TelemetryEnabled_PlayerHeartbeat;                  // 0x10(0x1)
	bool                                                         TelemetryEnabled_PlayerPerformedEmote;             // 0x11(0x1)
};


// Size 0x20
class DebugReplicatedAbilityData: public None
{
public:
	Struct AIAbilityDebugReplicatedIntervals                     AbilityIntervals;                                  // 0x0(0xc)
	class                                                        TypeClass;                                         // 0x10(0x8)
	bool                                                         AbilityInRange;                                    // 0x18(0x1)
	bool                                                         AbilityDebugBlocked;                               // 0x19(0x1)
	bool                                                         UseTimerBetween;                                   // 0x1a(0x1)
	bool                                                         UseDamageBetween;                                  // 0x1b(0x1)
	byte                                                         DamageIntervalBlockMode;                           // 0x1c(0x1)
};


// Size 0x14
class AthenaAICharacterParams: public None
{
public:
	float                                                        MissFiringHeightOffset;                            // 0x0(0x4)
	float                                                        MissFiringTargetInFrontOffset;                     // 0x4(0x4)
	float                                                        MinMissFiringTargetInFrontOffset;                  // 0x8(0x4)
	float                                                        MaxMissFiringTargetInFrontOffset;                  // 0xc(0x4)
	float                                                        BufferTimeWhenChangingItems;                       // 0x10(0x4)
};


// Size 0x18
class MakeFriendsEmoteParams: public None
{
public:
	TArray<Name None>                                            TriggerEmoteNames;                                 // 0x0(0x10)
	float                                                        TriggerDistanceThreshold;                          // 0x10(0x4)
};


// Size 0x8
class CharacterSocketCollisionServiceParams: public None
{
public:
	float                                                        MaxCharacterDistanceSqr;                           // 0x0(0x4)
	int                                                          MaxSockets;                                        // 0x4(0x4)
};


// Size 0x28
class MermaidRespawnConfig: public None
{
public:
	float                                                        ScorePenaltyForEachMeterAwayFromShipwreck;         // 0x0(0x4)
	float                                                        MinRespawnLocDistanceFromSunkShip;                 // 0x4(0x4)
	float                                                        MinScorePenaltyForEnemyShipProximity;              // 0x8(0x4)
	float                                                        MaxScorePenaltyForEnemyShipProximity;              // 0xc(0x4)
	float                                                        MaxDistanceFromEnemyShipToApplyPenalty;            // 0x10(0x4)
	float                                                        MinScorePenaltyForAlliedShipProximity;             // 0x14(0x4)
	float                                                        MaxScorePenaltyForAlliedShipProximity;             // 0x18(0x4)
	float                                                        MaxDistanceFromAlliedShipToApplyPenalty;           // 0x1c(0x4)
	float                                                        MaxDistanceFromIslandWeHaveMapForToApplyPenalty;   // 0x20(0x4)
	float                                                        ScorePenaltyForIslandsWeHaveMapFor;                // 0x24(0x4)
};


// Size 0x38
class DigSurfaceTypeParams: public None
{
public:
	byte                                                         SurfaceType;                                       // 0x0(0x1)
	Struct DigEventFxParams                                      EnterGroundFx;                                     // 0x8(0x18)
	Struct DigEventFxParams                                      LeaveGroundFx;                                     // 0x20(0x18)
};


// Size 0x18
class DigEventFxParams: public None
{
public:
	Class Object*                                                Particles;                                         // 0x0(0x8)
	bool                                                         bAttachParticlesToShovel;                          // 0x8(0x1)
	Class ForceFeedbackEffect*                                   Rumble;                                            // 0x10(0x8)
};


// Size 0x18
class SurfaceDigHole: public None
{
public:
	byte                                                         SurfaceType;                                       // 0x0(0x1)
	class                                                        DigHoleClass;                                      // 0x8(0x8)
	float                                                        DigAINoiseRange;                                   // 0x10(0x4)
};


// Size 0x60
class SharedShovelParams: public None
{
public:
	Struct ShovelSurfaceDigType                                  DigSurfaceDigType;                                 // 0x0(0x10)
	byte                                                         SandSurfaceType;                                   // 0x10(0x1)
	byte                                                         WetSandSurfaceType;                                // 0x11(0x1)
	float                                                        MaxHeightDifferenceToNotBeConsideredWetSand;       // 0x14(0x4)
	Struct Vector                                                DigPosOffsetFromPlayerPos;                         // 0x18(0xc)
	float                                                        SurfaceTypeRaycastLength;                          // 0x24(0x4)
	float                                                        MaxSurfaceAngleForDig;                             // 0x28(0x4)
	float                                                        InitialSphereCastRadiusForSuccessfulDig;           // 0x2c(0x4)
	byte                                                         ItemProxyCollisionChannel;                         // 0x30(0x1)
	float                                                        SphereRadiusForItemProxySweep;                     // 0x34(0x4)
	float                                                        RequiredObstacleFreeRadiusForSuccessfulDig;        // 0x38(0x4)
	float                                                        ObstacleCheckStartOffsetZFromSphereTestPos;        // 0x3c(0x4)
	int                                                          NumSamplesForBlockingSurfacesTest;                 // 0x40(0x4)
	float                                                        MaxWaterDepthToStartSuccessfulDig;                 // 0x44(0x4)
	byte                                                         HitTestTraceChannel;                               // 0x48(0x1)
	float                                                        MinPlanarTestRadius;                               // 0x4c(0x4)
	int                                                          NumSamplesForPlanarityTest;                        // 0x50(0x4)
	float                                                        MaxBumpinessForPlanarityTestInCm;                  // 0x54(0x4)
	float                                                        AssumedPlayerWaistHeight;                          // 0x58(0x4)
	bool                                                         bDrawDebug;                                        // 0x5c(0x1)
};


// Size 0x10
class ShovelSurfaceDigType: public None
{
public:
	TArray<Struct SurfaceDigType>                                SurfaceDigType;                                    // 0x0(0x10)
};


// Size 0x2
class SurfaceDigType: public None
{
public:
	byte                                                         SurfaceType;                                       // 0x0(0x1)
	byte                                                         DigType;                                           // 0x1(0x1)
};


// Size 0x60
class CrewServiceParams: public None
{
public:
	float                                                        MinSafeDistanceToShip;                             // 0x0(0x4)
	float                                                        SpawnDistAroundSunkenShip;                         // 0x4(0x4)
	TArray<Int >                                                 VotesRequiredForSendToBrig;                        // 0x8(0x10)
	TArray<Int >                                                 VotesRequiredForReleaseFromBrig;                   // 0x18(0x10)
	TArray<Int >                                                 VotesRequiredForScuttleShip;                       // 0x28(0x10)
	TArray<Int >                                                 VotesRequiredForChangeMatchmakingVisibility;       // 0x38(0x10)
	TArray<Int >                                                 VotesRequiredForArenaRivalVote;                    // 0x48(0x10)
	float                                                        BrigMinReleaseTime;                                // 0x58(0x4)
	float                                                        BrigServerTimeToRememberPastCrewMates;             // 0x5c(0x4)
};


// Size 0x88
class MermaidServiceParams: public None
{
public:
	float                                                        LocallyActiveMermaidCheckInterval;                 // 0x0(0x4)
	float                                                        PlayerAbandonedCheckInterval;                      // 0x4(0x4)
	float                                                        MinDestroyDistancePlayerToMermaidIfPlayerNearEnemyShip; // 0x8(0x4)
	float                                                        MinDestroyDistancePlayerToMermaidIfPlayerNearIsland; // 0xc(0x4)
	float                                                        MinDestroyDistancePlayerToMermaidIfPlayerNotNearIsland; // 0x10(0x4)
	float                                                        MaxDistFromCoastForPlayerToCountAsNearIsland;      // 0x14(0x4)
	float                                                        MaxDistFromCoastForShipToCountAsNearIsland;        // 0x18(0x4)
	float                                                        MinPlayerToShipDistForPlayerToQualifyAsAbandoned;  // 0x1c(0x4)
	float                                                        MinPlayerToShipDistForPlayerToBeClearedOfAbandonedStatus; // 0x20(0x4)
	float                                                        MinPlayerToEnemyShipDistForPlayerToQualifyForStealthSpawns; // 0x24(0x4)
	float                                                        MinPlayerToWatercraftDistForPlayerToQualifyAsAbandoned; // 0x28(0x4)
	float                                                        MinDistFromAnyMermaidForPlayerToBeAbandonedIfPlayerNotNearIslan; // 0x2c(0x4)
	float                                                        MinDistFromAnyMermaidForPlayerToBeAbandonedIfPlayerNearIsland; // 0x30(0x4)
	int                                                          MaxNumberOfConcurrentMermaids;                     // 0x34(0x4)
	float                                                        MinLifeTimeOfMermaidBeforeCanBeCulledInPopulationCheck; // 0x38(0x4)
	float                                                        SpawnDistAroundSaviourMermaid;                     // 0x3c(0x4)
	Struct MermaidServiceMermaidSpawnParams                      SpawnParams;                                       // 0x40(0x48)
};


// Size 0x48
class MermaidServiceMermaidSpawnParams: public None
{
public:
	float                                                        MinDistFromSpawnOrigin;                            // 0x0(0x4)
	float                                                        MinDistFromSpawnOriginForDestroyedShip;            // 0x4(0x4)
	float                                                        MaxDistFromSpawnOriginBeforeGivingUp;              // 0x8(0x4)
	float                                                        DistIncrementPerFailedSpawnCircle;                 // 0xc(0x4)
	int                                                          NumSamplesInSpawnCircle;                           // 0x10(0x4)
	float                                                        SpawnCastStartZ;                                   // 0x14(0x4)
	float                                                        MinSpawnDepth;                                     // 0x18(0x4)
	float                                                        SpawnHalfConeAngleRestrictIfSpawningForPlayer;     // 0x1c(0x4)
	byte                                                         HitTestTraceChannel;                               // 0x20(0x1)
	float                                                        AssumedMermaidRadius;                              // 0x24(0x4)
	float                                                        MinDistanceOfFinalSpawnPosToAnyActiveMermaid;      // 0x28(0x4)
	float                                                        MinDistanceOfFinalSpawnPosToAnyActiveMermaidWhenNearEnemyShip; // 0x2c(0x4)
	float                                                        MinDistFromEdgeOfWorld;                            // 0x30(0x4)
	float                                                        MinAngularStepSize;                                // 0x34(0x4)
	float                                                        MaxAngularStepSize;                                // 0x38(0x4)
	float                                                        MinDistanceIncrementPerFail;                       // 0x3c(0x4)
	float                                                        MaxDistanceIncrementPerFail;                       // 0x40(0x4)
	float                                                        AdditionalDistanceFromOriginMultiplierPerMeter;    // 0x44(0x4)
};


// Size 0xc
class PlayerModerationParams: public None
{
public:
	float                                                        PlayerReportableDistance;                          // 0x0(0x4)
	float                                                        PlayerReportableTimeBetweenChecksInSeconds;        // 0x4(0x4)
	float                                                        RemovePlayerFromListAfterSeconds;                  // 0x8(0x4)
};


// Size 0x18
class ToggleableAIShipServiceDataAssetFileLocation: public None
{
public:
	struct FName                                                 ToggleName;                                        // 0x0(0x8)
	Struct StringAssetReference                                  Location;                                          // 0x8(0x10)
};


// Size 0x60
class FirstPersonAnimaticActionStateConstructionInfo: public None
{
public:
	Struct FirstPersonAnimaticSettings                           FirstPersonAnimaticSettings;                       // 0x30(0x2c)
};


// Size 0x2c
class FirstPersonAnimaticSettings: public None
{
public:
	Struct Vector                                                CutsceneFirstPersonMeshOffset;                     // 0x0(0xc)
	Struct Rotator                                               CutsceneRotation;                                  // 0xc(0xc)
	float                                                        TimeBeforeFadeIn;                                  // 0x18(0x4)
	float                                                        FadeInDuration;                                    // 0x1c(0x4)
	float                                                        FirstPersonMeshBoundsScale;                        // 0x20(0x4)
	struct FName                                                 FirstPersonAnimName;                               // 0x24(0x8)
};


// Size 0x58
class CharacterAnimaticSettings: public None
{
public:
};


// Size 0x10
class UIReturnedToPlayerEvent: public None
{
public:
};


// Size 0x10
class NetworkEventStruct: public None
{
public:
};


// Size 0x1
class EventPlayerControllerHitNotification: public None
{
public:
	bool                                                         PlaySfx;                                           // 0x0(0x1)
};


// Size 0x10
class EventClientPlayerSpawnedBeforeGameState: public None
{
public:
};


// Size 0x10
class EventPlayerTeleportToSafety: public None
{
public:
};


// Size 0x8
class EventPlayerControllerUnPossess: public None
{
public:
	Class Pawn*                                                  Pawn;                                              // 0x0(0x8)
};


// Size 0x8
class EventPlayerControllerPossess: public None
{
public:
	Class Pawn*                                                  Pawn;                                              // 0x0(0x8)
};


// Size 0x8
class EventAthenaPlayerControllerEndingPlay: public None
{
public:
	Class AthenaPlayerController*                                Controller;                                        // 0x0(0x8)
};


// Size 0x8
class EventAthenaPlayerControllerBegunPlay: public None
{
public:
	Class AthenaPlayerController*                                Controller;                                        // 0x0(0x8)
};


// Size 0x8
class EventPlayerControllerDestroyedCalled: public None
{
public:
	Class AthenaPlayerController*                                Controller;                                        // 0x0(0x8)
};


// Size 0x30
class QuestTypeParams: public None
{
public:
	Class WeightedTreasureChestDescAsset*                        ReferencedRewards;                                 // 0x8(0x8)
	TArray<Struct WeightedTreasureChestDesc>                     Rewards;                                           // 0x10(0x10)
	Class WeightedItemDescSpawnDataAsset*                        RewardsAsset;                                      // 0x20(0x8)
	class                                                        OverrideTreasureMapItemDesc;                       // 0x28(0x8)
};


// Size 0x18
class WeightedTreasureChestDesc: public None
{
public:
	float                                                        Weight;                                            // 0x0(0x4)
	struct FName                                                 Feature;                                           // 0x4(0x8)
	class                                                        Desc;                                              // 0x10(0x8)
};


// Size 0x148
class BountyQuestParams: public None
{
public:
	Class AIBountySpawner*                                       Spawner;                                           // 0x30(0x8)
	Struct BountyQuestRandomSpawnGeneratorParams                 BountyQuestRandomSpawnGeneratorParams;             // 0x38(0x110)
};


// Size 0x110
class BountyQuestRandomSpawnGeneratorParams: public None
{
public:
	Struct WeightedProbabilityRange                              NumberOfWaves;                                     // 0x0(0x20)
	Struct WeightedProbabilityRange                              NumberOfWaveGroups;                                // 0x20(0x20)
	int                                                          MinNumberOfAIPerWave;                              // 0x40(0x4)
	int                                                          MaxNumberOfAIPerWave;                              // 0x44(0x4)
	int                                                          MinFormsPerEncounter;                              // 0x48(0x4)
	int                                                          MaxFormsPerEncounter;                              // 0x4c(0x4)
	int                                                          MinVarietiesPerEncounter;                          // 0x50(0x4)
	int                                                          MaxVarietiesPerEncounter;                          // 0x54(0x4)
	float                                                        MinTimeBetweenSpawns;                              // 0x58(0x4)
	float                                                        MaxTimeBetweenSpawns;                              // 0x5c(0x4)
	float                                                        MinTimeBetweenWaves;                               // 0x60(0x4)
	float                                                        MaxTimeBetweenWaves;                               // 0x64(0x4)
	Struct WeightedProbabilityRange                              WavesPerRelocate;                                  // 0x68(0x20)
	Struct WeightedProbabilityRange                              WaveSplitChance;                                   // 0x88(0x20)
	TArray<Float >                                               WaveSuicideTime;                                   // 0xa8(0x10)
	float                                                        WaveSuicideMinDist;                                // 0xb8(0x4)
	Class AIEncounterGenerationRecipeRankOrderList*              Recipes;                                           // 0xc0(0x8)
	Struct WeightedProbabilityRange                              NumberOfTargetsTotal;                              // 0xc8(0x20)
	Struct WeightedProbabilityRange                              NumberOfTargetsWhichAreCaptains;                   // 0xe8(0x20)
	float                                                        ChanceOfAllTargetsBeingOnTheLastWave;              // 0x108(0x4)
	float                                                        ChanceOfFemale;                                    // 0x10c(0x4)
};


// Size 0x88
class CargoRunQuestParams: public None
{
public:
	Struct WeightedProbabilityRange                              NumberOfRequiredItems;                             // 0x30(0x20)
	Struct WeightedProbabilityRangeOfRanges                      TimeLimitInMinutes;                                // 0x50(0x30)
	Class CargoRunQuestRandomRequiredItemsDataAsset*             RequiredItemsDataAsset;                            // 0x80(0x8)
};


// Size 0x1
class EmergantVoyageQuestParams: public None
{
public:
};


// Size 0x1
class MatchmakingQuestParams: public None
{
public:
};


// Size 0x1
class RewardQuestParams: public None
{
public:
};


// Size 0x1
class StagingQuestParams: public None
{
public:
};


// Size 0x18
class MerchantQuestCategoryGroup: public None
{
public:
	struct FName                                                 GroupName;                                         // 0x0(0x8)
	TArray<Struct MerchantQuestRandomRequiredItemsEntry>         RequiredItemEntries;                               // 0x8(0x10)
};


// Size 0x10
class MerchantQuestRandomRequiredItemsEntry: public None
{
public:
	float                                                        Weight;                                            // 0x0(0x4)
	int                                                          MaxNum;                                            // 0x4(0x4)
	Class MerchantQuestItemData*                                 RequiredItem;                                      // 0x8(0x8)
};


// Size 0x1c
class MerchantQuestCategoryGroupBounds: public None
{
public:
	struct FName                                                 GroupName;                                         // 0x0(0x8)
	float                                                        Weight;                                            // 0x8(0x4)
	int                                                          MinNum;                                            // 0xc(0x4)
	int                                                          MaxNum;                                            // 0x10(0x4)
	int                                                          MinDifferent;                                      // 0x14(0x4)
	int                                                          MaxDifferent;                                      // 0x18(0x4)
};


// Size 0xc0
class MerchantQuestParams: public None
{
public:
	Struct WeightedProbabilityRange                              NumberOfRequiredItems;                             // 0x30(0x20)
	Struct WeightedProbabilityRangeOfRanges                      TimeLimitInMinutes;                                // 0x50(0x30)
	Class MerchantQuestRequiredItemsDataAsset*                   RequiredItemsDataAsset;                            // 0x80(0x8)
	Class MerchantQuestRandomRequiredItemsDataAsset*             RandomRequiredItemsDataAsset;                      // 0x88(0x8)
	Struct WeightedProbabilityRange                              NumberOfGroups;                                    // 0x90(0x20)
	TArray<Struct NumberOfGroups>                                CategoryGroupBounds;                               // 0xb0(0x10)
};


// Size 0x40
class RiddleQuestParams: public None
{
public:
	Class BoobyTrapSpawnerDataAsset*                             BoobyTrapSpawnerDataAsset;                         // 0x38(0x8)
};


// Size 0x38
class TaleQuestParams: public None
{
public:
	Class TaleQuestDescAsset*                                    TaleQuestAsset;                                    // 0x30(0x8)
};


// Size 0x88
class XMarksTheSpotQuestParams: public None
{
public:
	Struct WeightedProbabilityRange                              NumTreasureLocations;                              // 0x30(0x20)
	Class BoobyTrapSpawnerDataAsset*                             BoobyTrapSpawnerDataAsset;                         // 0x50(0x8)
	TArray<class UniqueTreasureLocationBoobyTraps*>              UniqueTreasureLocationBoobyTraps;                  // 0x58(0x10)
	TArray<class UniqueTreasureLocationRewards*>                 UniqueTreasureLocationRewards;                     // 0x68(0x10)
	TArray<class UniqueTreasureLocationRewardsAssets*>           UniqueTreasureLocationRewardsAssets;               // 0x78(0x10)
};


// Size 0x3a8
class WeightedQuestParams: public None
{
public:
	float                                                        Weight;                                            // 0x0(0x4)
	Struct QuestParams                                           Params;                                            // 0x8(0x3a0)
};


// Size 0x3a0
class QuestParams: public None
{
public:
	byte                                                         Type;                                              // 0x0(0x1)
	Struct XMarksTheSpotQuestParams                              XMarksTheSpot;                                     // 0x8(0x88)
	Struct RiddleQuestParams                                     Riddle;                                            // 0x90(0x40)
	Struct BountyQuestParams                                     Bounty;                                            // 0xd0(0x148)
	Struct MerchantQuestParams                                   Merchant;                                          // 0x218(0xc0)
	Struct CargoRunQuestParams                                   CargoRun;                                          // 0x2d8(0x88)
	Struct TaleQuestParams                                       Tale;                                              // 0x360(0x38)
	Struct MatchmakingQuestParams                                Matchmake;                                         // 0x398(0x1)
	Struct StagingQuestParams                                    Staging;                                           // 0x399(0x1)
	Struct EmergantVoyageQuestParams                             EmergantVoyage;                                    // 0x39a(0x1)
	Struct RewardQuestParams                                     Reward;                                            // 0x39b(0x1)
};


// Size 0x18
class WeightedVoyageLocationParams: public None
{
public:
	float                                                        Weight;                                            // 0x0(0x4)
	TArray<Struct VoyageLocationParams>                          Locations;                                         // 0x8(0x10)
};


// Size 0x58
class VoyageLocationParams: public None
{
public:
	byte                                                         Type;                                              // 0x0(0x1)
	Struct VoyageLocationFixedParams                             Fixed;                                             // 0x4(0x8)
	Struct VoyageLocationRandomParams                            Random;                                            // 0x10(0x48)
};


// Size 0x48
class VoyageLocationRandomParams: public None
{
public:
	bool                                                         NPCsOnly;                                          // 0x0(0x1)
	bool                                                         CargoRunNPCsOnly;                                  // 0x1(0x1)
	bool                                                         Feature;                                           // 0x2(0x1)
	bool                                                         Resource;                                          // 0x3(0x1)
	bool                                                         Outpost;                                           // 0x4(0x1)
	bool                                                         Fort;                                              // 0x5(0x1)
	bool                                                         SeaPost;                                           // 0x6(0x1)
	bool                                                         HasLandmarks;                                      // 0x7(0x1)
	bool                                                         OnlyNamedIslands;                                  // 0x8(0x1)
	Class VoyageLocationOnlyNamedIslandListDataAsset*            OnlyNamedIslandsListDataAsset;                     // 0x10(0x8)
	TArray<Class OnlyNamedIslandsListDataAsset>                  Seas;                                              // 0x18(0x10)
	bool                                                         WithinDistance;                                    // 0x28(0x1)
	Struct VoyageLocationDistance                                Distance;                                          // 0x2c(0x8)
};


// Size 0x8
class VoyageLocationDistance: public None
{
public:
	float                                                        Min;                                               // 0x0(0x4)
	float                                                        Max;                                               // 0x4(0x4)
};


// Size 0x8
class VoyageLocationFixedParams: public None
{
public:
	struct FName                                                 Name;                                              // 0x0(0x8)
};


// Size 0x30
class QuestPoolParams: public None
{
public:
	float                                                        Weight;                                            // 0x0(0x4)
	TArray<Struct Weight>                                        Quests;                                            // 0x8(0x10)
	TArray<Struct Quests>                                        Location;                                          // 0x18(0x10)
	bool                                                         AllowRepeatIslandsWithinQuest;                     // 0x28(0x1)
	bool                                                         LimitTimesCanBeSelected;                           // 0x29(0x1)
	int                                                          MaxTimesCanBeSelected;                             // 0x2c(0x4)
};


// Size 0x140
class VoyageRecipe: public None
{
public:
	Struct QuestDistributionParams                               QuestDistribution;                                 // 0x0(0xc8)
	Struct QuestSelectionParams                                  QuestSelection;                                    // 0xc8(0x8)
	TArray<Struct QuestSelection>                                QuestPools;                                        // 0xd0(0x10)
	bool                                                         UseFixedFinalQuestPool;                            // 0xe0(0x1)
	bool                                                         RandomiseChapters;                                 // 0xe1(0x1)
	Struct QuestPoolParams                                       FixedFinalQuestPool;                               // 0xe8(0x30)
	bool                                                         DoNotNotifyParticipantsOnVoyageComplete;           // 0x118(0x1)
	TArray<Struct DoNotNotifyParticipantsOnVoyageComplete>       CompletionStats;                                   // 0x120(0x10)
	TArray<Struct CompletionStats>                               ReapersMarkCompletionStats;                        // 0x130(0x10)
};


// Size 0x8
class QuestSelectionParams: public None
{
public:
	byte                                                         PoolSelectionMethod;                               // 0x0(0x1)
	byte                                                         LocationSelectionMethod;                           // 0x1(0x1)
	bool                                                         UseChapterBasedVoyageHistory;                      // 0x2(0x1)
	int                                                          MaxNumberOfPoolRetries;                            // 0x4(0x4)
};


// Size 0xc8
class QuestDistributionParams: public None
{
public:
	byte                                                         Method;                                            // 0x0(0x1)
	Struct QuestDistributionAllAtOnceParams                      AllAtOnce;                                         // 0x8(0x40)
	Struct QuestDistributionPerChapterParams                     PerChapter;                                        // 0x48(0x68)
	Struct QuestDistributionFixedChaptersParams                  FixedChapters;                                     // 0xb0(0x18)
};


// Size 0x18
class QuestDistributionFixedChaptersParams: public None
{
public:
	bool                                                         UseProceduralQuestRewards;                         // 0x0(0x1)
	int                                                          NumChapters;                                       // 0x4(0x4)
	TArray<Struct ChapterDataEntry>                              Chapters;                                          // 0x8(0x10)
};


// Size 0x10
class ChapterDataEntry: public None
{
public:
	int                                                          NumQuests;                                         // 0x0(0x4)
	Class VoyageRewardDataAsset*                                 PerChapterRewardAsset;                             // 0x8(0x8)
};


// Size 0x68
class QuestDistributionPerChapterParams: public None
{
public:
	int                                                          MinNumChapters;                                    // 0x0(0x4)
	Struct WeightedProbabilityRange                              NumQuests;                                         // 0x8(0x20)
	Struct WeightedProbabilityRange                              NumQuestsInFirstChapter;                           // 0x28(0x20)
	Struct WeightedProbabilityRange                              NumQuestsInOtherChapters;                          // 0x48(0x20)
};


// Size 0x40
class QuestDistributionAllAtOnceParams: public None
{
public:
	Struct WeightedProbabilityRange                              NumQuests;                                         // 0x0(0x20)
	Struct WeightedProbabilityRange                              QuestsPerChapter;                                  // 0x20(0x20)
};


// Size 0x18
class ContestTimerData: public None
{
public:
	float                                                        Time;                                              // 0x0(0x4)
	Struct FString                                               ServicesConfigRetrievalString;                     // 0x8(0x10)
};


// Size 0x1b8
class EmergentContestVoyageRecipe: public None
{
public:
	bool                                                         IsSharableVoyage;                                  // 0x140(0x1)
	Struct ContestZoneDistribution                               WeightedContestZonesToActivate;                    // 0x148(0x10)
	Struct ContestTimerData                                      ContestVoyageTime;                                 // 0x158(0x18)
	Struct StringClassReference                                  ScoreSystemToLoad;                                 // 0x170(0x10)
	Struct FText                                                 ContestArenaName;                                  // 0x180(0x38)
};


// Size 0x10
class ContestZoneDistribution: public None
{
public:
	TArray<Struct WeightedContestZone>                           WeightedContestZones;                              // 0x0(0x10)
};


// Size 0xc
class WeightedContestZone: public None
{
public:
	struct FName                                                 ContestZoneName;                                   // 0x0(0x8)
	int                                                          Weight;                                            // 0x8(0x4)
};


// Size 0x10
class ContestIslandArchetype: public None
{
public:
	TArray<Struct WeightedContestIslandData>                     AvailableIslands;                                  // 0x0(0x10)
};


// Size 0x10
class WeightedContestIslandData: public None
{
public:
	Struct ContestVoyageIslandData                               IslandData;                                        // 0x0(0xc)
	int                                                          WeightedChance;                                    // 0xc(0x4)
};


// Size 0xc
class ContestVoyageIslandData: public None
{
public:
	struct FName                                                 IslandName;                                        // 0x0(0x8)
	int                                                          MaxItemCountForIsland;                             // 0x8(0x4)
};


// Size 0x58
class EventCharacterHitReaction: public None
{
public:
	Struct ImpactDamageEvent                                     ImpactDamage;                                      // 0x0(0x58)
};


// Size 0x1
class EventPlayerCharacterPuzzleVaultIncorrect: public None
{
public:
};


// Size 0x1
class EventPlayerCharacterPuzzleVaultComplete: public None
{
public:
};


// Size 0x8
class EventPlayerCharacterInPuzzleVaultChanged: public None
{
public:
	bool                                                         IsInPuzzleVault;                                   // 0x0(0x1)
	float                                                        CurrentWaterLevel;                                 // 0x4(0x4)
};


// Size 0xc
class EventItemUseAINoiseEvent: public None
{
public:
	float                                                        NoiseRange;                                        // 0x0(0x4)
	struct FName                                                 NoiseTag;                                          // 0x4(0x8)
};


// Size 0x2
class EventAnimationShopInteraction: public None
{
public:
	bool                                                         Active;                                            // 0x0(0x1)
	byte                                                         Type;                                              // 0x1(0x1)
};


// Size 0x1
class EventFaceTargetEnabled: public None
{
public:
	bool                                                         Enabled;                                           // 0x0(0x1)
};


// Size 0x1
class EventRemoteCharacterStartedDig: public None
{
public:
};


// Size 0xc
class EventRequestVomit: public None
{
public:
};


// Size 0x1
class EventIsDrunk: public None
{
public:
	bool                                                         bIsDrunk;                                          // 0x0(0x1)
};


// Size 0x8
class EventFallWithDamageLegNotBroken: public None
{
public:
	struct FName                                                 RumbleTag;                                         // 0x0(0x8)
};


// Size 0x1
class EventHealedLeg: public None
{
public:
};


// Size 0x8
class EventBrokeLeg: public None
{
public:
	struct FName                                                 RumbleTag;                                         // 0x0(0x8)
};


// Size 0x1
class EventPlayerGhostShipWhiteOutStarted: public None
{
public:
};


// Size 0x1
class EventCharacterRestarted: public None
{
public:
};


// Size 0x84
class EventCharacterLanded: public None
{
public:
	Struct HitResult                                             HitResult;                                         // 0x0(0x80)
	float                                                        VerticalSpeed;                                     // 0x80(0x4)
};


// Size 0x1
class EventCharacterJumped: public None
{
public:
};


// Size 0x1
class EventCharacterDestroyed: public None
{
public:
};


// Size 0x8
class EventCharacterInteraction: public None
{
public:
	Class Object*                                                Interactable;                                      // 0x0(0x8)
};


// Size 0x18
class ClientTelemetryConfigurationSettings: public None
{
public:
	float                                                        HighMemoryPerformanceHeartbeatIntervalSeconds;     // 0x0(0x4)
	float                                                        HighMemoryThresholdDurango;                        // 0x4(0x4)
	float                                                        HighMemoryThresholdEdmonton;                       // 0x8(0x4)
	float                                                        HighMemoryThresholdScorpio;                        // 0xc(0x4)
	float                                                        HighMemoryThresholdLockhart;                       // 0x10(0x4)
	float                                                        HighMemoryThresholdAnaconda;                       // 0x14(0x4)
};


// Size 0x10
class ResolutionTelemetryFragment: public None
{
public:
	float                                                        ScreenPercentage;                                  // 0x8(0x4)
	bool                                                         DynamicResolution;                                 // 0xc(0x1)
};


// Size 0x18
class ShippingStatsTelemetryFragment: public None
{
public:
	Struct JsonObjectWrapper                                     Json;                                              // 0x0(0x18)
};


// Size 0xb0
class AudioDataTelemetryFragment: public None
{
public:
	TArray<UInt32 >                                              WwiseStateGroups;                                  // 0x20(0x10)
	TArray<UInt32 >                                              WwiseStateValues;                                  // 0x30(0x10)
	TArray<UInt32 >                                              PeakProxyCountsPools;                              // 0x40(0x10)
	TArray<UInt32 >                                              PeakProxyCounts;                                   // 0x50(0x10)
	TArray<UInt32 >                                              StreamFindFailedIDs;                               // 0x60(0x10)
	TArray<UInt32 >                                              StreamOpenFailedIDs;                               // 0x70(0x10)
	TArray<UInt32 >                                              StreamReadFailedIDs;                               // 0x80(0x10)
	TArray<Struct SoundBankFailureTelemetryEntry>                FailedToLoadBankIDs;                               // 0x90(0x10)
	float                                                        AverageIOBytesPerSecondRead;                       // 0xac(0x4)
};


// Size 0x8
class SoundBankFailureTelemetryEntry: public None
{
public:
};


// Size 0x18
class FrameTypeTelemetryFragment: public None
{
public:
};


// Size 0x8
class RefreshRateTelemetryFragment: public None
{
public:
	bool                                                         Supports120Hz;                                     // 0x0(0x1)
};


// Size 0x1
class HDRTelemetryFragment: public None
{
public:
	bool                                                         HDR;                                               // 0x0(0x1)
};


// Size 0x18
class GarbageCollectionFrametimeTelemetryFragment: public None
{
public:
	TArray<Float None>                                           GCFrametimesMs;                                    // 0x0(0x10)
	float                                                        MaxGCFrametimeMs;                                  // 0x10(0x4)
};


// Size 0x20
class HitchDataTelemetryFragment: public None
{
public:
};


// Size 0xc
class StutterDataTelemetryFragment: public None
{
public:
	float                                                        StutterFramePercentage;                            // 0x0(0x4)
	float                                                        StutterFrameDeltaMax;                              // 0x4(0x4)
	float                                                        StutterFrameDeltaAverage;                          // 0x8(0x4)
};


// Size 0x20
class ServerNetworkDataTelemetryFragment: public None
{
public:
	Struct PacketDiscardStats                                    DiscardedPackets;                                  // 0x0(0x20)
};


// Size 0x28
class NetworkDataTelemetryFragmentInput: public None
{
public:
};


// Size 0x1
class TelemetryFragmentInput: public None
{
public:
};


// Size 0x28
class NetworkDataTelemetryFragment: public None
{
public:
};


// Size 0x18
class PerformanceTelemetryFragmentInput: public None
{
public:
};


// Size 0x170
class MemoryDataTelemetryFragment: public None
{
public:
	TArray<Struct MemoryTableData>                               TableInfo;                                         // 0xd0(0x10)
	int                                                          HighMemoryThresholdPercentage;                     // 0x118(0x4)
};


// Size 0x18
class MemoryTableData: public None
{
public:
};


// Size 0x50
class InventoryMemory: public None
{
public:
};


// Size 0x10
class IslandEventIcons: public None
{
public:
	Class Texture*                                               ActiveEventIcon;                                   // 0x0(0x8)
	Class Texture*                                               InactiveEventIcon;                                 // 0x8(0x8)
};


// Size 0x48
class CanvasWorldMapShipLocation: public None
{
public:
	Struct Guid                                                  CrewId;                                            // 0x0(0x10)
	class                                                        ShipSize;                                          // 0x10(0x8)
	Struct Vector2D                                              Location;                                          // 0x18(0x8)
	float                                                        Rotation;                                          // 0x20(0x4)
	Struct CanvasLerpData                                        LerpData;                                          // 0x24(0x10)
	bool                                                         IsInAlliance;                                      // 0x34(0x1)
	byte                                                         ReapersMarkLevel;                                  // 0x35(0x1)
	byte                                                         EmissaryLevel;                                     // 0x36(0x1)
	bool                                                         IsContestShip;                                     // 0x37(0x1)
	Class Texture*                                               CrewLiveryOverlayIcon;                             // 0x38(0x8)
	bool                                                         IsReapersTrackedShip;                              // 0x40(0x1)
	bool                                                         IsInTunnel;                                        // 0x41(0x1)
};


// Size 0x10
class CanvasLerpData: public None
{
public:
	float                                                        LerpTime;                                          // 0x0(0x4)
	float                                                        EaseExponent;                                      // 0x4(0x4)
};


// Size 0x20
class CanvasWorldMapGeneric: public None
{
public:
	Class Actor*                                                 MarkerActor;                                       // 0x0(0x8)
	Class Texture*                                               Icon;                                              // 0x8(0x8)
	Struct Vector                                                Location;                                          // 0x10(0xc)
};


// Size 0x18
class CanvasWorldMapReaperTrackedBootItemIcon: public None
{
public:
	byte                                                         BootyItemType;                                     // 0x0(0x1)
	Class Texture*                                               Texture;                                           // 0x8(0x8)
};


// Size 0x18
class CanvasWorldMapShipIcons: public None
{
public:
	class                                                        ShipSize;                                          // 0x0(0x8)
	Class Texture*                                               ShipTexture;                                       // 0x8(0x8)
	Class Texture*                                               OffscreenTexture;                                  // 0x10(0x8)
};


// Size 0x20
class CanvasWorldMapWorldData: public None
{
public:
	Struct Vector2D                                              Min;                                               // 0x0(0x8)
	Struct Vector2D                                              Max;                                               // 0x8(0x8)
	TArray<Struct CanvasWorldMapIslandData>                      Islands;                                           // 0x10(0x10)
};


// Size 0x60
class CanvasWorldMapIslandData: public None
{
public:
	Struct FText                                                 Name;                                              // 0x0(0x38)
	Class Texture*                                               IslandTex;                                         // 0x38(0x8)
	Struct Box2D                                                 Bounds;                                            // 0x40(0x14)
	float                                                        Rotation;                                          // 0x54(0x4)
	float                                                        LabelOffset;                                       // 0x58(0x4)
};


// Size 0x30
class MapTableCanvasDetails: public None
{
public:
	TArray<Struct CanvasWorldMapBackgroundItems>                 BackgroundDetails;                                 // 0x0(0x10)
	TArray<Struct CanvasWorldMapForegroundItems>                 ForegroundDetails;                                 // 0x10(0x10)
	TArray<Struct CanvasWorldMapSeaAreaItems>                    SeaDetails;                                        // 0x20(0x10)
};


// Size 0x50
class CanvasWorldMapSeaAreaItems: public None
{
public:
	Class Texture*                                               Texture;                                           // 0x0(0x8)
	Struct FText                                                 Name;                                              // 0x8(0x38)
	Struct Vector2D                                              Location;                                          // 0x40(0x8)
	struct FName                                                 FeatureName;                                       // 0x48(0x8)
};


// Size 0x20
class CanvasWorldMapForegroundItems: public None
{
public:
	Class Texture*                                               Texture;                                           // 0x0(0x8)
	struct FName                                                 FeatureToggle;                                     // 0x8(0x8)
	TArray<Struct FeatureToggle>                                 Locations;                                         // 0x10(0x10)
};


// Size 0x20
class CanvasWorldMapBackgroundItems: public None
{
public:
	Class Texture*                                               Texture;                                           // 0x0(0x8)
	Struct Vector2D                                              WorldSize;                                         // 0x8(0x8)
	TArray<Struct WorldSize>                                     Locations;                                         // 0x10(0x10)
};


// Size 0xb0
class VoyageProposalDescViewModel: public None
{
public:
	Struct FString                                               ProposalDesc;                                      // 0x98(0x10)
	byte                                                         State;                                             // 0xa8(0x1)
	int                                                          VoyageIndex;                                       // 0xac(0x4)
};


// Size 0x98
class VoyageDisplayInformation: public None
{
public:
	Struct FText                                                 Title;                                             // 0x0(0x38)
	Struct FText                                                 Description;                                       // 0x38(0x38)
	Struct FString                                               KeyArtUrl;                                         // 0x70(0x10)
	Struct FString                                               IconUrl;                                           // 0x80(0x10)
	int                                                          RumouredHaulMin;                                   // 0x90(0x4)
	bool                                                         Locked;                                            // 0x94(0x1)
};


// Size 0x1c
class EventUpdateIslandEventToggle: public None
{
public:
	Struct Guid                                                  EventID;                                           // 0x0(0x10)
	Struct Vector2D                                              EventScreenPos;                                    // 0x10(0x8)
	bool                                                         IsInverted;                                        // 0x18(0x1)
};


// Size 0x1
class EventRefreshIslandEventData: public None
{
public:
};


// Size 0x1
class EventUpdateIslandEventHighlight: public None
{
public:
	bool                                                         IsHighlightActive;                                 // 0x0(0x1)
};


// Size 0xa8
class IslandEventTooltipData: public None
{
public:
	Struct VoyageDisplayInformation                              DisplayInfo;                                       // 0x0(0x98)
	Struct Guid                                                  EventID;                                           // 0x98(0x10)
};


// Size 0x58
class IslandEventIconData: public None
{
public:
	Struct IslandEventData                                       EventData;                                         // 0x0(0x38)
	Struct IslandEventIcons                                      IslandIcons;                                       // 0x38(0x10)
	Struct IslandEventIcons                                      HeaderIcons;                                       // 0x48(0x10)
};


// Size 0x38
class IslandEventData: public None
{
public:
	class                                                        EventType;                                         // 0x0(0x8)
	Struct FString                                               VoyageDescAssetString;                             // 0x8(0x10)
	Struct Vector2D                                              WorldPos;                                          // 0x18(0x8)
	bool                                                         IsActive;                                          // 0x20(0x1)
	Struct Guid                                                  EventID;                                           // 0x24(0x10)
};


// Size 0x1c
class IslandNameAndBounds: public None
{
public:
	struct FName                                                 IslandName;                                        // 0x0(0x8)
	Struct Box2D                                                 IslandBounds;                                      // 0x8(0x14)
};


// Size 0x1
class EventIslandEventDataChanged: public None
{
public:
};


// Size 0x18
class WorldSafeZone: public None
{
public:
};


// Size 0x18
class AthenaWorldSettingsGameEventSchedulerSettingsConfiguration: public None
{
public:
	struct FName                                                 FeatureFlag;                                       // 0x0(0x8)
	byte                                                         RequiredPlayMode;                                  // 0x8(0x1)
	Class GameEventSchedulerSettingsAsset*                       EventSchedulerSettings;                            // 0x10(0x8)
};


// Size 0x38
class DeferredBakedDecal: public None
{
public:
};


// Size 0xc0
class MerchantCrateItemInfoFaunaBreedRarityEntry: public None
{
public:
	class                                                        FaunaBreed;                                        // 0x0(0x8)
	struct FName                                                 Rarity;                                            // 0x8(0x8)
	Struct BootyItemStats                                        HandInStats;                                       // 0x10(0x90)
	Struct CompanyBootyStatList                                  CompanySpecificStats;                              // 0xa0(0x10)
	TArray<Struct CompanySpecificBootyReward>                    CompanySpecificHandInRewardIds;                    // 0xb0(0x10)
};


// Size 0x18
class CompanySpecificBootyReward: public None
{
public:
	class                                                        CompanyId;                                         // 0x0(0x8)
	Struct RewardId                                              RewardId;                                          // 0x8(0x8)
	bool                                                         RequirePirateLegend;                               // 0x10(0x1)
};


// Size 0x10
class CompanyBootyStatList: public None
{
public:
	TArray<Struct CompanyBootyStats>                             CompanyList;                                       // 0x0(0x10)
};


// Size 0x98
class CompanyBootyStats: public None
{
public:
	class                                                        CompanyId;                                         // 0x0(0x8)
	Struct BootyItemStats                                        Stats;                                             // 0x8(0x90)
};


// Size 0x90
class BootyItemStats: public None
{
public:
	TArray<Struct CompanyId>                                     HandInPlayerStats;                                 // 0x0(0x10)
	TArray<Struct HandInPlayerStats>                             HandInStolenPlayerStats;                           // 0x10(0x10)
	TArray<Struct HandInStolenPlayerStats>                       HandInAsPirateLegendPlayerStats;                   // 0x20(0x10)
	TArray<Struct HandInAsPirateLegendPlayerStats>               HandInOnSchedulePlayerStats;                       // 0x30(0x10)
	TArray<Struct HandInOnSchedulePlayerStats>                   HandInAsPirateLegendOnSchedulePlayerStats;         // 0x40(0x10)
	TArray<Struct HandInAsPirateLegendOnSchedulePlayerStats>     HandInAsEmissaryPlayerStats;                       // 0x50(0x10)
	TArray<Struct HandInAsEmissaryPlayerStats>                   HandInAsMaxLevelEmissaryPlayerStats;               // 0x60(0x10)
	TArray<Struct HandInAsMaxLevelEmissaryPlayerStats>           HandInStolenAsEmissaryPlayerStats;                 // 0x70(0x10)
	TArray<Struct EmissaryBootyItemStats>                        HandInStolenAsMaxLevelEmissaryPlayerStats;         // 0x80(0x10)
};


// Size 0x18
class EmissaryBootyItemStats: public None
{
public:
	class                                                        EmissaryCompany;                                   // 0x0(0x8)
	TArray<Struct EmissaryCompany>                               Stats;                                             // 0x8(0x10)
};


// Size 0x20
class MerchantCrateSfx: public None
{
public:
	Class WwiseEvent*                                            EquipSfx;                                          // 0x0(0x8)
	Class WwiseEvent*                                            UnequipSfx;                                        // 0x8(0x8)
	Class WwiseEvent*                                            WielderLandedJumpSfx;                              // 0x10(0x8)
	Class WwiseEvent*                                            WielderFootstepLayerOneshot;                       // 0x18(0x8)
};


// Size 0x18
class BeaconLitWithFlameOfFateStatsToFire: public None
{
public:
	byte                                                         FlameOfFateType;                                   // 0x0(0x1)
	TArray<Struct FlameOfFateType>                               StatsToFire;                                       // 0x8(0x10)
};


// Size 0x2
class BeaconData: public None
{
public:
	bool                                                         LightIsOn_Server;                                  // 0x0(0x1)
	byte                                                         FlameOfFateType;                                   // 0x1(0x1)
};


// Size 0x1
class BeaconExtinguishedEvent: public None
{
public:
};


// Size 0x1
class BeaconLitEvent: public None
{
public:
};


// Size 0x10
class BellPlayerStats: public None
{
public:
	TArray<Struct BellDesc>                                      StatsToFireUponBellRing;                           // 0x0(0x10)
};


// Size 0x18
class BellDesc: public None
{
public:
	Class StaticMesh*                                            BellMesh;                                          // 0x0(0x8)
	Class WwiseEvent*                                            BellRingSFX;                                       // 0x8(0x8)
	Class WwiseEvent*                                            BellRingTurbulenceSFX;                             // 0x10(0x8)
};


// Size 0x18
class BoobyTrapSpawnerRankEntry: public None
{
public:
	int                                                          Rank;                                              // 0x0(0x4)
	float                                                        ChanceOfBeingBoobyTrapped;                         // 0x4(0x4)
	TArray<Struct WeightedAIBoobyTrapSpawner>                    WeightedSpawners;                                  // 0x8(0x10)
};


// Size 0x10
class WeightedAIBoobyTrapSpawner: public None
{
public:
	Class AIBoobyTrapSpawner*                                    Spawner;                                           // 0x0(0x8)
	float                                                        Weight;                                            // 0x8(0x4)
};


// Size 0x28
class PageLayoutRepInfo: public None
{
public:
	TArray<Struct TreasureMapWidgetTexture>                      Images;                                            // 0x8(0x10)
	TArray<Struct TreasureMapWidgetLocalisedTextWithFontOverride> GeneralText;                                       // 0x18(0x10)
};


// Size 0x78
class TreasureMapWidgetLocalisedTextWithFontOverride: public None
{
public:
	Class Font*                                                  FontOverride;                                      // 0x70(0x8)
};


// Size 0x70
class TreasureMapWidgetLocalisedText: public None
{
public:
	Struct FText                                                 Text;                                              // 0x38(0x38)
};


// Size 0x38
class TreasureMapWidgetText: public None
{
public:
	float                                                        Scale;                                             // 0x18(0x4)
	bool                                                         CutoutTextStyle;                                   // 0x1c(0x1)
	float                                                        StrikethroughThickness;                            // 0x20(0x4)
	float                                                        StrikethroughOffset;                               // 0x24(0x4)
	Struct LinearColor                                           StrikethroughColor;                                // 0x28(0x10)
};


// Size 0x18
class TreasureMapWidget: public None
{
public:
	Struct Vector2D                                              Position;                                          // 0x0(0x8)
	byte                                                         HorizontalAlignment;                               // 0x8(0x1)
	byte                                                         VerticalAlignment;                                 // 0x9(0x1)
	float                                                        Angle;                                             // 0xc(0x4)
	float                                                        Width;                                             // 0x10(0x4)
	float                                                        Opacity;                                           // 0x14(0x4)
};


// Size 0x28
class TreasureMapWidgetTexture: public None
{
public:
	Class Texture*                                               Image;                                             // 0x18(0x8)
	float                                                        RelativeHeightModifier;                            // 0x20(0x4)
	bool                                                         FlipX;                                             // 0x24(0x1)
};


// Size 0x18
class QuestBookPageRenderer: public None
{
public:
	Class Font*                                                  Font;                                              // 0x0(0x8)
	float                                                        FontScale;                                         // 0x8(0x4)
	float                                                        FontMaxScale;                                      // 0xc(0x4)
	float                                                        FontLineSpacingScale;                              // 0x10(0x4)
};


// Size 0x140
class QuestBookMaterialHandler: public None
{
public:
	int                                                          PageWidth;                                         // 0x0(0x4)
	int                                                          PageHeight;                                        // 0x4(0x4)
	Struct QuestBookPageRenderer                                 PageTextRenderer;                                  // 0x8(0x18)
	Class MaybeCompressedCanvasRenderTarget2D*                   LeftSpreadLeftPageRenderTarget;                    // 0x20(0x8)
	Class MaybeCompressedCanvasRenderTarget2D*                   LeftSpreadRightPageRenderTarget;                   // 0x28(0x8)
	Class MaybeCompressedCanvasRenderTarget2D*                   RightSpreadLeftPageRenderTarget;                   // 0x30(0x8)
	Class MaybeCompressedCanvasRenderTarget2D*                   RightSpreadRightPageRenderTarget;                  // 0x38(0x8)
	Class QuestBookPageLayout*                                   LeftSpreadLeftPageContents;                        // 0x40(0x8)
	Class QuestBookPageLayout*                                   LeftSpreadRightPageContents;                       // 0x58(0x8)
	Class QuestBookPageLayout*                                   RightSpreadLeftPageContents;                       // 0x70(0x8)
	Class QuestBookPageLayout*                                   RightSpreadRightPageContents;                      // 0x88(0x8)
};


// Size 0x18
class PageReference: public None
{
public:
	Struct StringAssetReference                                  PageReference;                                     // 0x0(0x10)
	byte                                                         NumberOfPages;                                     // 0x10(0x1)
};


// Size 0x28
class QuestBookRepInfo: public None
{
public:
	int                                                          LeftPageIndex;                                     // 0x0(0x4)
	TArray<Int >                                                 CurrentBookContents;                               // 0x8(0x10)
	TArray<Struct CurrentBookContents>                           ProcPageList;                                      // 0x18(0x10)
};


// Size 0x50
class BountyMapTargetDesc: public None
{
public:
	Struct TreasureMapTextDesc                                   Name;                                              // 0x0(0x48)
	Class Texture*                                               MugShotImage;                                      // 0x48(0x8)
};


// Size 0x48
class TreasureMapTextDesc: public None
{
public:
	Struct FText                                                 Pattern;                                           // 0x0(0x38)
	TArray<Struct TreasureMapTextEntry>                          Substitutions;                                     // 0x38(0x10)
};


// Size 0x48
class TreasureMapTextEntry: public None
{
public:
	Struct FString                                               Name;                                              // 0x0(0x10)
	Struct FText                                                 Substitution;                                      // 0x10(0x38)
};


// Size 0x68
class BountyMapContents: public None
{
public:
	Struct TreasureMapTextDesc                                   Location;                                          // 0x0(0x48)
	TArray<Struct Location>                                      Descriptions;                                      // 0x48(0x10)
	TArray<Struct Descriptions>                                  Targets;                                           // 0x58(0x10)
};


// Size 0x10
class QuestBootyItemPopUpEntry: public None
{
public:
	struct FName                                                 BootyItemIdentifier;                               // 0x0(0x8)
	Class PopUpMessageDesc*                                      PopUp;                                             // 0x8(0x8)
};


// Size 0x28
class CompanySkillsetProgressions: public None
{
public:
	class                                                        Company;                                           // 0x0(0x8)
	Struct TargetSkillsetProgressionPair                         TargetSkillsets;                                   // 0x8(0x20)
};


// Size 0x20
class LoadoutSubstitution: public None
{
public:
	Struct StringAssetReference                                  LoadoutToSubstituteOut;                            // 0x0(0x10)
	TArray<Struct LoadoutToSubstituteOut>                        LoadoutsToSubstituteIn;                            // 0x10(0x10)
};


// Size 0x28
class BountyQuestMugShotSet: public None
{
public:
	Class AthenaAIFormDataAsset*                                 Form;                                              // 0x0(0x8)
	Class Texture*                                               MaleCaptainMugShot;                                // 0x8(0x8)
	Class Texture*                                               FemaleCaptainMugShot;                              // 0x10(0x8)
	Class Texture*                                               MaleCrewMugShot;                                   // 0x18(0x8)
	Class Texture*                                               FemaleCrewMugShot;                                 // 0x20(0x8)
};


// Size 0x10
class BountyQuestLayoutOption: public None
{
public:
	int                                                          NumCaptains;                                       // 0x0(0x4)
	int                                                          NumCrew;                                           // 0x4(0x4)
	Class BountyMapLayout*                                       Layout;                                            // 0x8(0x8)
};


// Size 0x10
class CannonDesc: public None
{
public:
	Class StaticMesh*                                            CannonBarrelMesh;                                  // 0x0(0x8)
	Class SkeletalMesh*                                          CannonBoxMesh;                                     // 0x8(0x8)
};


// Size 0x8
class EventCannonFiredOnServer: public None
{
public:
	Class Cannon*                                                Cannon;                                            // 0x0(0x8)
};


// Size 0x20
class EventCannonFired: public None
{
public:
	Class Cannon*                                                FiredCannon;                                       // 0x0(0x8)
};


// Size 0x1
class EventCannonAimingStoppedYaw: public None
{
public:
	bool                                                         IsAtEnd;                                           // 0x0(0x1)
};


// Size 0x1
class EventCannonAimingStoppedPitch: public None
{
public:
	bool                                                         IsAtEnd;                                           // 0x0(0x1)
};


// Size 0x1
class EventCannonAimingStartedYaw: public None
{
public:
};


// Size 0x1
class EventCannonAimingStartedPitch: public None
{
public:
};


// Size 0x1
class EventCannonAimingCenteredYaw: public None
{
public:
};


// Size 0x1
class EventCannonAimingCenteredPitch: public None
{
public:
};


// Size 0x18
class AchievementSailCloseToShipWithoutFiring: public None
{
public:
	float                                                        RangeToRemainWithinInMetres;                       // 0x0(0x4)
	float                                                        DistanceToTravelInMetres;                          // 0x4(0x4)
};


// Size 0x8
class AchievementSailFullyWithTheWind: public None
{
public:
	float                                                        DistanceToTravelInMetres;                          // 0x0(0x4)
};


// Size 0x80
class AchievementSailThroughStormAtNightWithLightsOff: public None
{
public:
	Class Ship*                                                  Ship;                                              // 0x50(0x8)
};


// Size 0xf8
class AchievementSailWithFlameOfFateColoursAboard: public None
{
public:
	Class Ship*                                                  Ship;                                              // 0x8(0x8)
	TArray<class ShipLights*>                                    ShipLights;                                        // 0x10(0x10)
};


// Size 0x18
class AchievementSinkAnotherCrewsShip: public None
{
public:
	float                                                        CrewRange;                                         // 0x0(0x4)
};


// Size 0x98
class ShipPartConnections: public None
{
public:
	struct FName                                                 AnchorName;                                        // 0x0(0x8)
	struct FName                                                 CapstanName;                                       // 0x8(0x8)
	struct FName                                                 RudderName;                                        // 0x10(0x8)
	struct FName                                                 WheelName;                                         // 0x18(0x8)
	struct FName                                                 MainMastName;                                      // 0x20(0x8)
	struct FName                                                 MainMastSailHoistRightName;                        // 0x28(0x8)
	struct FName                                                 MainMastSailHoistLeftName;                         // 0x30(0x8)
	struct FName                                                 MainMastSailAngleRightName;                        // 0x38(0x8)
	struct FName                                                 MainMastSailAngleLeftName;                         // 0x40(0x8)
	struct FName                                                 MizzenMastName;                                    // 0x48(0x8)
	struct FName                                                 MizzenMastSailHoistRightName;                      // 0x50(0x8)
	struct FName                                                 MizzenMastSailHoistLeftName;                       // 0x58(0x8)
	struct FName                                                 MizzenMastSailAngleRightName;                      // 0x60(0x8)
	struct FName                                                 MizzenMastSailAngleLeftName;                       // 0x68(0x8)
	struct FName                                                 ForeMastName;                                      // 0x70(0x8)
	struct FName                                                 ForeMastSailHoistRightName;                        // 0x78(0x8)
	struct FName                                                 ForeMastSailHoistLeftName;                         // 0x80(0x8)
	struct FName                                                 ForeMastSailAngleRightName;                        // 0x88(0x8)
	struct FName                                                 ForeMastSailAngleLeftName;                         // 0x90(0x8)
};


// Size 0x30
class ShipCurseFXData: public None
{
public:
	byte                                                         ShipCurseTag;                                      // 0x0(0x1)
	TArray<Struct ShipCurseVFXTemplate>                          VFXTemplates;                                      // 0x8(0x10)
	Struct ShipCurseAudioLoop                                    AudioLoop;                                         // 0x18(0x18)
};


// Size 0x18
class ShipCurseAudioLoop: public None
{
public:
	Class WwiseEvent*                                            PlayLoop;                                          // 0x0(0x8)
	Class WwiseEvent*                                            StopLoop;                                          // 0x8(0x8)
	Class WwiseObjectPoolWrapper*                                PoolWrapper;                                       // 0x10(0x8)
};


// Size 0x20
class ShipCurseVFXTemplate: public None
{
public:
	class                                                        ActorClass;                                        // 0x0(0x8)
	Class ParticleSystem*                                        Template;                                          // 0x8(0x8)
	Struct FString                                               SocketNameSubstring;                               // 0x10(0x10)
};


// Size 0x1
class EventApplyStatusShipCurseEnd: public None
{
public:
};


// Size 0x20
class EventApplyStatusShipCurse: public None
{
public:
	Struct Status                                                Status;                                            // 0x8(0x18)
};


// Size 0x1
class EventCurseWheelLockEnd: public None
{
public:
};


// Size 0x8
class EventCurseWheelLock: public None
{
public:
	byte                                                         CurseTag;                                          // 0x0(0x1)
	float                                                        AngleThreshold;                                    // 0x4(0x4)
};


// Size 0x8
class EventCurseSpawnAIOnShip: public None
{
public:
	Class AIFixedWavesSpawner*                                   AISpawner;                                         // 0x0(0x8)
};


// Size 0x1
class EventCurseBallastEnd: public None
{
public:
};


// Size 0x4
class EventCurseBallast: public None
{
public:
};


// Size 0x30
class EventShipCurseFXEnd: public None
{
public:
	Struct ShipCurseFXData                                       CurseFXData;                                       // 0x0(0x30)
};


// Size 0x30
class EventShipCurseFX: public None
{
public:
	Struct ShipCurseFXData                                       CurseFXData;                                       // 0x0(0x30)
};


// Size 0xc
class CurseShipCannonsEvent: public None
{
public:
	float                                                        PitchAngle;                                        // 0x0(0x4)
	float                                                        YawAngle;                                          // 0x4(0x4)
	float                                                        BlendTime;                                         // 0x8(0x4)
};


// Size 0x18
class EventEnableInteractionPoints: public None
{
public:
	byte                                                         ShipCurseTag;                                      // 0x0(0x1)
	byte                                                         CurseTag;                                          // 0x1(0x1)
	TArray<Class CurseTag>                                       InteractionPointsToEnable;                         // 0x8(0x10)
};


// Size 0x18
class EventDisableInteractionPoints: public None
{
public:
	byte                                                         ShipCurseTag;                                      // 0x0(0x1)
	byte                                                         CurseTag;                                          // 0x1(0x1)
	TArray<Class CurseTag>                                       InteractionPointsToDisable;                        // 0x8(0x10)
};


// Size 0x4
class EventCurseCapstan: public None
{
public:
	float                                                        DurationToToggleCapstanPosition;                   // 0x0(0x4)
};


// Size 0x4
class EventCurseChangeSailHeight: public None
{
public:
	float                                                        Duration;                                          // 0x0(0x4)
};


// Size 0x30
class TimedResponseAction: public None
{
public:
	TArray<class TargetActors*>                                  TargetActors;                                      // 0x0(0x10)
	float                                                        Duration;                                          // 0x10(0x4)
	bool                                                         IsActive;                                          // 0x14(0x1)
};


// Size 0x18
class ShipCurseSpawnedFXForCurse: public None
{
public:
	TArray<Struct ShipCurseSpawnedFXObject>                      SpawnedFXObjects;                                  // 0x8(0x10)
};


// Size 0x30
class ShipCurseSpawnedFXObject: public None
{
public:
	Class WwiseEvent*                                            StopAudioLoopEvent;                                // 0x28(0x8)
};


// Size 0x30
class ShipActiveCurseFXData: public None
{
public:
	Struct ShipCurseFXData                                       CurseFXData;                                       // 0x0(0x30)
};


// Size 0x18
class ShipConfigurationSettings: public None
{
public:
	float                                                        MetresSailedStatSendFrequency;                     // 0x0(0x4)
	float                                                        MinimumDistanceSailedBeforeSendingUpdate;          // 0x4(0x4)
	float                                                        MaxVelocityAllowedForServerMigration;              // 0x8(0x4)
	float                                                        MaxAngularVelocityAllowedForServerMigration;       // 0xc(0x4)
	float                                                        ShipHeartbeatFrequencySeconds;                     // 0x10(0x4)
	bool                                                         MigrationBasedOnVelocityEnabled;                   // 0x14(0x1)
};


// Size 0x38
class SinkingShipParams: public None
{
public:
	float                                                        DragWhenGrindingToHalt;                            // 0x0(0x4)
	float                                                        MinSpdToStopToBeforeLowering;                      // 0x4(0x4)
	float                                                        LowerIntoWaterTime;                                // 0x8(0x4)
	float                                                        TimeIntoLoweringToStartOcclusionZoneShrinkage;     // 0xc(0x4)
	float                                                        AngularDragDuringSinkingSequence;                  // 0x10(0x4)
	float                                                        KeeledOverTime;                                    // 0x14(0x4)
	float                                                        TurnOffBuoyancyTime;                               // 0x18(0x4)
	float                                                        FinalSinkingBuoyancy;                              // 0x1c(0x4)
	float                                                        SinkingTimeUntilDestroy;                           // 0x20(0x4)
	float                                                        ReduceWaterOcclusionZoneTime;                      // 0x24(0x4)
	float                                                        ReduceWaterOcclusionZoneTimeHurryUp;               // 0x28(0x4)
	float                                                        TimeIntoKeelingOverToTeleportPlayer;               // 0x2c(0x4)
	float                                                        MinSampleSubmersionToConsiderInWater;              // 0x30(0x4)
	float                                                        MinPctSamplesRequiredSubmergedToBeAbleToSink;      // 0x34(0x4)
};


// Size 0x40
class LiquidContents: public None
{
public:
	Class Ship*                                                  LiquidSource;                                      // 0x0(0x8)
	TArray<class LiquidTargets*>                                 LiquidTargets;                                     // 0x8(0x10)
	Class Actor*                                                 Container;                                         // 0x18(0x8)
	float                                                        LiquidVolume;                                      // 0x20(0x4)
	Struct Guid                                                  ScoopID;                                           // 0x24(0x10)
	float                                                        LiquidTransferFillAmountModifier;                  // 0x34(0x4)
	byte                                                         ContainerType;                                     // 0x38(0x1)
};


// Size 0x58
class BucketContentsInfo: public None
{
public:
	byte                                                         ThrowableLiquidType;                               // 0x0(0x1)
	class                                                        ProjectileClassToSpawn;                            // 0x8(0x8)
	class                                                        ProjectileClassToSpawnAtWielder;                   // 0x10(0x8)
	Class WwiseEvent*                                            ThrowSfx;                                          // 0x18(0x8)
	Class Object*                                                ThrowVfxFirstPerson;                               // 0x20(0x8)
	Class Object*                                                ThrowVfxThirdPerson;                               // 0x28(0x8)
	Class Object*                                                DrenchWielderVfxThirdPerson;                       // 0x30(0x8)
	Class Object*                                                BucketContentsParticleSystemFirstPerson;           // 0x38(0x8)
	Class Object*                                                BucketContentsParticleSystemThirdPerson;           // 0x40(0x8)
	struct FName                                                 SwitchState;                                       // 0x48(0x8)
	float                                                        LiquidLevel;                                       // 0x50(0x4)
};


// Size 0x20
class QuestVariablePlayerActor: public None
{
public:
};


// Size 0x20
class QuestVariable: public None
{
public:
	struct FName                                                 ParamName;                                         // 0x18(0x8)
};


// Size 0x1c
class LocationGeneratorSample: public None
{
public:
	byte                                                         Type;                                              // 0x0(0x1)
	Struct Vector                                                Location;                                          // 0x4(0xc)
	Struct Vector                                                Normal;                                            // 0x10(0xc)
};


// Size 0x10
class CampaignPopUpNotificationInfo: public None
{
public:
	struct FName                                                 Name;                                              // 0x0(0x8)
	Class PopUpMessageDesc*                                      PopUp;                                             // 0x8(0x8)
};


// Size 0x18
class CannonEnchantmentDesc: public None
{
public:
	Class Object*                                                MuzzleFlashVfxFirstPerson;                         // 0x0(0x8)
	Class Object*                                                MuzzleFlashVfxThirdPerson;                         // 0x8(0x8)
	Class WwiseEvent*                                            FireSfx;                                           // 0x10(0x8)
};


// Size 0x40
class ObjectHitDetectedEvent: public None
{
public:
};


// Size 0x10
class ApplyBoundaryToWorldMapEvent: public None
{
public:
	Struct LinearColor                                           BoundaryData;                                      // 0x0(0x10)
};


// Size 0x4
class WorldMapSetMapLabelsRotation: public None
{
public:
	float                                                        Rotation;                                          // 0x0(0x4)
};


// Size 0xc
class WorldMapSetShipLocation: public None
{
public:
	float                                                        ShipX;                                             // 0x0(0x4)
	float                                                        ShipY;                                             // 0x4(0x4)
	float                                                        Rotation;                                          // 0x8(0x4)
};


// Size 0x28
class WorldMapSetLocation: public None
{
public:
	TArray<Struct WorldMapRequestWorldResponse>                  MapPins;                                           // 0x0(0x10)
	int                                                          MaxMapPins;                                        // 0x10(0x4)
	int                                                          SelectedPin;                                       // 0x14(0x4)
	float                                                        WorldX;                                            // 0x18(0x4)
	float                                                        WorldY;                                            // 0x1c(0x4)
	float                                                        Zoom;                                              // 0x20(0x4)
};


// Size 0x20
class WorldMapRequestWorldResponse: public None
{
public:
	Struct WorldMapWorldData                                     WorldData;                                         // 0x0(0x20)
};


// Size 0x20
class WorldMapWorldData: public None
{
public:
	float                                                        MinX;                                              // 0x0(0x4)
	float                                                        MinY;                                              // 0x4(0x4)
	float                                                        MaxX;                                              // 0x8(0x4)
	float                                                        MaxY;                                              // 0xc(0x4)
	TArray<Struct WorldMapIslandData>                            Islands;                                           // 0x10(0x10)
};


// Size 0x60
class WorldMapIslandData: public None
{
public:
	Struct FText                                                 Name;                                              // 0x0(0x38)
	Struct FString                                               IslandUrl;                                         // 0x38(0x10)
	float                                                        MinX;                                              // 0x48(0x4)
	float                                                        MinY;                                              // 0x4c(0x4)
	float                                                        MaxX;                                              // 0x50(0x4)
	float                                                        MaxY;                                              // 0x54(0x4)
	float                                                        Rotation;                                          // 0x58(0x4)
	float                                                        LabelOffset;                                       // 0x5c(0x4)
};


// Size 0x1
class WorldMapRequestWorld: public None
{
public:
};


// Size 0x20
class CapstanDesc: public None
{
public:
	Class StaticMesh*                                            CapstanBodyMesh;                                   // 0x0(0x8)
	Class StaticMesh*                                            CapstanArmMesh;                                    // 0x8(0x8)
	Class StaticMesh*                                            CapstanReleaseMesh;                                // 0x10(0x8)
	Class StaticMesh*                                            CapstanRopeMesh;                                   // 0x18(0x8)
};


// Size 0x68
class CapstanAudioParams: public None
{
public:
	Class WwiseEvent*                                            CapstanStart;                                      // 0x0(0x8)
	Class WwiseEvent*                                            CapstanStop;                                       // 0x8(0x8)
	Class WwiseEvent*                                            CapstanDamagedStart;                               // 0x10(0x8)
	Class WwiseEvent*                                            CapstanDamagedStop;                                // 0x18(0x8)
	Class WwiseEvent*                                            CapstanStopFullyRaised;                            // 0x20(0x8)
	Class WwiseEvent*                                            CapstanStopFullyLowered;                           // 0x28(0x8)
	Class WwiseObjectPoolWrapper*                                CapstanEmitterPool;                                // 0x30(0x8)
	struct FName                                                 CapstanTurnRateRtpc;                               // 0x38(0x8)
	float                                                        CapstanTurnMinRtpcValue;                           // 0x40(0x4)
	float                                                        CapstanTurnMaxRtpcValue;                           // 0x44(0x4)
	struct FName                                                 BoatVelocityRtpc;                                  // 0x48(0x8)
	float                                                        BoatVelocityMinRtpcValue;                          // 0x50(0x4)
	float                                                        BoatVelocityMaxRtpcValue;                          // 0x54(0x4)
	float                                                        EmpiricalMaxShipVelocity;                          // 0x58(0x4)
	struct FName                                                 CapstanDamageRtpc;                                 // 0x5c(0x8)
	float                                                        CapstanDamageRtpcMaxValue;                         // 0x64(0x4)
};


// Size 0x8
class CapstanNetState: public None
{
public:
	float                                                        TargetRatio;                                       // 0x0(0x4)
	bool                                                         IsLocked;                                          // 0x4(0x1)
};


// Size 0x14
class CapstanParams: public None
{
public:
	float                                                        MaxVelocityPerPlayer;                              // 0x0(0x4)
	float                                                        MaxFreeLoweringVelocity;                           // 0x4(0x4)
	float                                                        MaxError;                                          // 0x8(0x4)
	float                                                        CorrectiveForceMultiplier;                         // 0xc(0x4)
	float                                                        PlayerAnimationOnCapstanMultiplier;                // 0x10(0x4)
};


// Size 0x18
class RepairableAuthoritiveRepairState: public None
{
public:
	byte                                                         RepairableState;                                   // 0x0(0x1)
	TArray<Weakclass RepairableState>                            RepairingList;                                     // 0x8(0x10)
};


// Size 0x10
class BookcaseCompanyFullnessData: public None
{
public:
	float                                                        CurrentFullness;                                   // 0x0(0x4)
	class                                                        Company;                                           // 0x8(0x8)
};


// Size 0x18
class BookcaseIndicatorSetting: public None
{
public:
	float                                                        AppearThreshold;                                   // 0x0(0x4)
	class                                                        RelevantCompany;                                   // 0x8(0x8)
	Class StaticMeshComponent*                                   IndicatorMesh;                                     // 0x10(0x8)
};


// Size 0x28
class CompanyCargoRunHandInStats: public None
{
public:
	class                                                        CompanyId;                                         // 0x0(0x8)
	TArray<Struct CompanyId>                                     StatsToFireOnHandIn;                               // 0x8(0x10)
	TArray<Struct StatsToFireOnHandIn>                           StatsToFireOnDamagedHandIn;                        // 0x18(0x10)
};


// Size 0x18
class CompanySpecificCargoRunStats: public None
{
public:
	class                                                        CompanyId;                                         // 0x0(0x8)
	TArray<Struct CompanyId>                                     StatsToFireUponPerfectOnTimeHandIn;                // 0x8(0x10)
};


// Size 0x28
class CompanySpecificCargoRunReward: public None
{
public:
	class                                                        CompanyId;                                         // 0x0(0x8)
	Struct CargoRunReward                                        Reward;                                            // 0x8(0x20)
};


// Size 0x20
class CargoRunReward: public None
{
public:
	TArray<Struct CompanyId>                                     OnTimeRewards;                                     // 0x0(0x10)
	TArray<Struct OnTimeRewards>                                 LateRewards;                                       // 0x10(0x10)
};


// Size 0x18
class CargoRunMapContents: public None
{
public:
	Struct Guid                                                  NPCId;                                             // 0x0(0x10)
	int                                                          CompanyIndex;                                      // 0x10(0x4)
	int                                                          NumOfItems;                                        // 0x14(0x4)
};


// Size 0x20
class CargoRunQuestCategoryGroup: public None
{
public:
	float                                                        Weight;                                            // 0x0(0x4)
	struct FName                                                 GroupName;                                         // 0x4(0x8)
	TArray<Struct CargoRunQuestRandomRequiredItemsEntry>         RequiredItemEntries;                               // 0x10(0x10)
};


// Size 0x10
class CargoRunQuestRandomRequiredItemsEntry: public None
{
public:
	float                                                        Weight;                                            // 0x0(0x4)
	int                                                          MaxNum;                                            // 0x4(0x4)
	class                                                        RequiredItem;                                      // 0x8(0x8)
};


// Size 0x30
class CarouselPirateDesc: public None
{
public:
	int                                                          Seed;                                              // 0x0(0x4)
	byte                                                         Gender;                                            // 0x4(0x1)
	byte                                                         Ethnicity;                                         // 0x5(0x1)
	float                                                        Age;                                               // 0x8(0x4)
	Struct RadialCoordinate                                      BodyShape;                                         // 0xc(0x8)
	float                                                        Dirtiness;                                         // 0x14(0x4)
	float                                                        Wonkiness;                                         // 0x18(0x4)
	TArray<Class Wonkiness>                                      Outfit;                                            // 0x20(0x10)
};


// Size 0xc8
class CarouselPirateGeneratorParams: public None
{
public:
	int                                                          MinNumOfEachGender;                                // 0x0(0x4)
	int                                                          MinNumOfEachEthnicity;                             // 0x4(0x4)
	TArray<Struct MinNumOfEachEthnicity>                         Groups;                                            // 0x8(0x10)
	Struct CarouselPirateGroup                                   Default;                                           // 0x18(0x6c)
	Struct CarouselPirateClothing                                MaleClothing;                                      // 0x88(0x20)
	Struct CarouselPirateClothing                                FemaleClothing;                                    // 0xa8(0x20)
};


// Size 0x20
class CarouselPirateClothing: public None
{
public:
	TArray<Struct CarouselPirateClothingItem>                    AvailableItems;                                    // 0x0(0x10)
	TArray<Struct CarouselPirateClothingCategoryBias>            Probabilities;                                     // 0x10(0x10)
};


// Size 0x10
class CarouselPirateClothingCategoryBias: public None
{
public:
	class                                                        Category;                                          // 0x0(0x8)
	float                                                        LikelihoodOfHaving;                                // 0x8(0x4)
	bool                                                         ProgressivlyDecreaseChance;                        // 0xc(0x1)
};


// Size 0x10
class CarouselPirateClothingItem: public None
{
public:
	class                                                        Item;                                              // 0x0(0x8)
	byte                                                         EthnicityFilter;                                   // 0x8(0x1)
};


// Size 0x6c
class CarouselPirateGroup: public None
{
public:
	struct FName                                                 Name;                                              // 0x0(0x8)
	int                                                          Count;                                             // 0x8(0x4)
	Struct FloatRange                                            Age;                                               // 0xc(0x10)
	Struct FloatRange                                            Wonkiness;                                         // 0x1c(0x10)
	Struct FloatRange                                            Dirt;                                              // 0x2c(0x10)
	Struct CarouselPirateBodyshape                               MaleBodyShape;                                     // 0x3c(0x18)
	Struct CarouselPirateBodyshape                               FemaleBodyShape;                                   // 0x54(0x18)
};


// Size 0x18
class CarouselPirateBodyshape: public None
{
public:
	float                                                        RandomizationBias;                                 // 0x0(0x4)
	Struct FloatRange                                            ShapeMagnitude;                                    // 0x4(0x10)
	Struct CarouselPirateBodyshapeCompass                        BodyShapeCompass;                                  // 0x14(0x2)
};


// Size 0x2
class CarouselPirateBodyshapeCompass: public None
{
public:
	byte                                                         StartDirection;                                    // 0x0(0x1)
	byte                                                         EndDirection;                                      // 0x1(0x1)
};


// Size 0x18
class CatalogOfferCommodity: public None
{
public:
	class                                                        RequiredEmissary;                                  // 0x0(0x8)
	Struct CommoditySelectionType                                Type;                                              // 0x8(0x8)
	byte                                                         Demand;                                            // 0x10(0x1)
};


// Size 0x20
class CatalogOfferBundleDataAsset: public None
{
public:
	Class CatalogOfferDataAsset*                                 OwningBundle;                                      // 0x0(0x8)
	Struct StringAssetReference                                  TileImage;                                         // 0x10(0x10)
};


// Size 0x10
class CatalogOfferRewardDataAsset: public None
{
public:
	class                                                        Company;                                           // 0x0(0x8)
	Struct RewardId                                              Reward;                                            // 0x8(0x8)
};


// Size 0x28
class CatalogOfferPrerequisitesDataAsset: public None
{
public:
	TArray<Class CategoryDefaultsUnit>                           Entitlements;                                      // 0x0(0x10)
	TArray<Struct CatalogOfferCompanyLevelDataAsset>             CompanyLevel;                                      // 0x10(0x10)
};


// Size 0x10
class CatalogOfferCompanyLevelDataAsset: public None
{
public:
	class                                                        Company;                                           // 0x0(0x8)
};


// Size 0x18
class CategoryDefaultsUnit: public None
{
public:
	TArray<Str None>                                             PartialStrings;                                    // 0x0(0x10)
	class                                                        Category;                                          // 0x10(0x8)
};


// Size 0x1c0
class PlayerMusicController: public None
{
public:
	Class PlayerMusicControllerParams*                           PlayerMusicParams;                                 // 0x0(0x8)
	Class Actor*                                                 LocalPlayerActor;                                  // 0x38(0x8)
	Class PlayerOceanAudioComponent*                             PlayerOceanAudioComponent;                         // 0x40(0x8)
	Class PlayerAtmosphericsAudioComponent*                      AtmosphericsAudioComponent;                        // 0x48(0x8)
	Class AthenaPlayerCharacter*                                 AthenaPlayerCharacter;                             // 0x50(0x8)
	Class AthenaWorldSettings*                                   AthenaWorldSettings;                               // 0x58(0x8)
	TArray<Struct AudioStingRelevantShips>                       RelevantAudioStingShips;                           // 0x198(0x10)
	TArray<Struct AudioStingShipsSpotted>                        AudioStingShipsSpottedRecently;                    // 0x1a8(0x10)
};


// Size 0x10
class AudioStingShipsSpotted: public None
{
public:
	Class Actor*                                                 SpottedShip;                                       // 0x0(0x8)
	double                                                       TimeSpotted;                                       // 0x8(0x8)
};


// Size 0x10
class AudioStingRelevantShips: public None
{
public:
	Class Actor*                                                 Ship;                                              // 0x0(0x8)
	bool                                                         IsAIShip;                                          // 0x8(0x1)
};


// Size 0x18
class NamedStateSelector: public None
{
public:
	TArray<Struct NameActiveStatePair>                           NamedStates;                                       // 0x0(0x10)
	struct FName                                                 DefaultStateName;                                  // 0x10(0x8)
};


// Size 0xc
class NameActiveStatePair: public None
{
public:
	struct FName                                                 StateName;                                         // 0x0(0x8)
	bool                                                         IsActive;                                          // 0x8(0x1)
};


// Size 0x18
class FogTypeToAudio: public None
{
public:
	byte                                                         FogBankType;                                       // 0x0(0x1)
	Class WwiseEvent*                                            FogMusicPlayEvent;                                 // 0x8(0x8)
	Class WwiseEvent*                                            FogMusicStopEvent;                                 // 0x10(0x8)
};


// Size 0x20
class StateCategoryGroup: public None
{
public:
	struct FName                                                 GroupName;                                         // 0x18(0x8)
};


// Size 0x10
class HealthChangeAudio: public None
{
public:
	byte                                                         Reason;                                            // 0x0(0x1)
	Class WwiseEvent*                                            Sfx;                                               // 0x8(0x8)
};


// Size 0x28
class DamageTypeToAudio: public None
{
public:
	class                                                        DamagerType;                                       // 0x0(0x8)
	struct FName                                                 AudioState;                                        // 0x8(0x8)
	Class WwiseEvent*                                            StartAudioEvent;                                   // 0x10(0x8)
	Class WwiseEvent*                                            EndAudioEvent;                                     // 0x18(0x8)
	float                                                        Duration;                                          // 0x20(0x4)
};


// Size 0x1c
class CharacterSocketFootWaterImpactResult: public None
{
public:
	Struct Vector                                                Position;                                          // 0x0(0xc)
	Struct Vector                                                SocketVelocity;                                    // 0xc(0xc)
	int                                                          FootIndex;                                         // 0x18(0x4)
};


// Size 0x20
class CharacterFootWaterImpactResult: public None
{
public:
	Struct CharacterSocketFootWaterImpactResult                  SocketFootImpactResult;                            // 0x0(0x1c)
	int                                                          FootIndex;                                         // 0x1c(0x4)
};


// Size 0xd0
class CharacterFootImpactResult: public None
{
public:
	Struct HitResult                                             HitResult;                                         // 0x0(0x80)
	byte                                                         FootImpactType;                                    // 0x80(0x1)
	Struct Transform                                             SocketTransform;                                   // 0x90(0x30)
	Struct Vector                                                SocketVelocity;                                    // 0xc0(0xc)
	int                                                          FootIndex;                                         // 0xcc(0x4)
};


// Size 0x28
class CharacterSocketCollisionDesc: public None
{
public:
	struct FName                                                 SocketName;                                        // 0x0(0x8)
	Class SkeletalMeshComponent*                                 SkeletalMeshComponent;                             // 0x8(0x8)
	byte                                                         TraceType;                                         // 0x10(0x1)
	float                                                        TraceDistance;                                     // 0x14(0x4)
	float                                                        TraceOffset;                                       // 0x18(0x4)
	byte                                                         ResultType;                                        // 0x1c(0x1)
	int                                                          FootIndex;                                         // 0x20(0x4)
};


// Size 0x28
class SocketCollisionExitWaterEvent: public None
{
public:
};


// Size 0x28
class SocketCollisionEnterWaterEvent: public None
{
public:
};


// Size 0xd0
class SocketCollisionEvent: public None
{
public:
};


// Size 0xc
class ChestOfRageReplicatedData: public None
{
public:
	byte                                                         State;                                             // 0x0(0x1)
	float                                                        RageValue;                                         // 0x4(0x4)
	bool                                                         HasBeenActivated;                                  // 0x8(0x1)
};


// Size 0x8
class EventReceiveChestOfRageComponentState: public None
{
public:
	Class ChestOfRageComponent*                                  Source;                                            // 0x0(0x8)
};


// Size 0x8
class ChestOfRageDamageTableEntry: public None
{
public:
	byte                                                         Reason;                                            // 0x0(0x1)
	float                                                        TimeToAdd;                                         // 0x4(0x4)
};


// Size 0xc0
class EmoteFlourishCategoryMapping: public None
{
public:
	class                                                        ItemCategory;                                      // 0x0(0x8)
	Struct StringAssetReference                                  IconPath;                                          // 0x8(0x10)
	Struct EmoteData                                             EmoteData;                                         // 0x18(0x98)
	Struct FString                                               PairName;                                          // 0xb0(0x10)
};


// Size 0x10
class ClothingLoadout: public None
{
public:
	TArray<Class ClothingLoadoutContainer>                       Items;                                             // 0x0(0x10)
};


// Size 0x18
class ClothingLoadoutContainer: public None
{
public:
	Struct ClothingLoadout                                       Loadout;                                           // 0x0(0x10)
	bool                                                         HasBeenSet;                                        // 0x10(0x1)
};


// Size 0x28
class CloudWeatherParameters: public None
{
public:
	Struct Vector2D                                              DefaultCloudVelocity;                              // 0x0(0x8)
	Class MaterialParameterCollection*                           AtmosphericMaterialParams;                         // 0x8(0x8)
	float                                                        GlobalAtmosphericPressure;                         // 0x10(0x4)
	float                                                        AtmosphericPressureThresholdSize;                  // 0x14(0x4)
	float                                                        MaxWindDelayLength;                                // 0x18(0x4)
	float                                                        WindSpeedMultiplier;                               // 0x1c(0x4)
	bool                                                         UsesGlobalWindService;                             // 0x20(0x1)
	bool                                                         UsesPressureZones;                                 // 0x20(0x1)
	bool                                                         CloudsCastShadows;                                 // 0x20(0x1)
	bool                                                         PressureIsControlledByParameterCollection;         // 0x20(0x1)
};


// Size 0x20
class CloudTileParameters: public None
{
public:
	TArray<Struct CloudDomeParameters>                           Meshes;                                            // 0x0(0x10)
	int                                                          Samples;                                           // 0x10(0x4)
	int                                                          Seed;                                              // 0x14(0x4)
	float                                                        MeshScaleMultiplier;                               // 0x18(0x4)
	bool                                                         ShouldCloudTileBeGenerated;                        // 0x1c(0x1)
};


// Size 0x28
class CloudDomeParameters: public None
{
public:
	float                                                        Width;                                             // 0x0(0x4)
	float                                                        DomeToTileProportion;                              // 0x4(0x4)
	float                                                        Height;                                            // 0x8(0x4)
	float                                                        HighPressureExtraHeight;                           // 0xc(0x4)
	float                                                        FadeProportion;                                    // 0x10(0x4)
	float                                                        DistanceCurvatureOvershoot;                        // 0x14(0x4)
	float                                                        DistantStreetCloudRotation;                        // 0x18(0x4)
	float                                                        ProportionOfCloudDomeToAlwaysUpdate;               // 0x1c(0x4)
	int                                                          SplitRemainingCloudsOverThisManyUpdates;           // 0x20(0x4)
	bool                                                         UpdateClosestProportionEveryOtherFrame;            // 0x24(0x1)
	bool                                                         EnableDistanceCurvature;                           // 0x25(0x1)
};


// Size 0x50
class CoastObject: public None
{
public:
	Class SplineComponent*                                       CoastSplineInternal;                               // 0x0(0x8)
	Class SplineComponent*                                       InnerSplineInternal;                               // 0x8(0x8)
	Struct Vector                                                SplineOrigin;                                      // 0x10(0xc)
	float                                                        CoastalLookupSquaredDistance;                      // 0x1c(0x4)
};


// Size 0x18
class HUDBlur: public None
{
public:
	Class MaterialParameterCollectionInstance*                   ScreenEffectsMaterialParameterCollectionInstance;  // 0x0(0x8)
};


// Size 0x18
class HUDBlurParams: public None
{
public:
	Class MaterialParameterCollection*                           ScreenEffectsMaterialParameterCollection;          // 0x0(0x8)
	Struct HUDBlurSourceParams                                   MenuBlurParams;                                    // 0x8(0x8)
	Struct HUDBlurSourceParams                                   MigrationBlurParams;                               // 0x10(0x8)
};


// Size 0x8
class HUDBlurSourceParams: public None
{
public:
	float                                                        SecondsToFullyBlur;                                // 0x0(0x4)
	float                                                        SecondsToFullyUnblur;                              // 0x4(0x4)
};


// Size 0x98
class HttpClientComponentRequestEvent: public None
{
public:
	Struct FString                                               Uri;                                               // 0x0(0x10)
	Struct FString                                               Body;                                              // 0x10(0x10)
	bool                                                         ShouldEncrypt;                                     // 0x20(0x1)
	bool                                                         ShouldAuthorize;                                   // 0x21(0x1)
	Struct FString                                               Method;                                            // 0x28(0x10)
	Struct FString                                               Id;                                                // 0x88(0x10)
};


// Size 0x28
class HttpClientComponentResponseEvent: public None
{
public:
	bool                                                         Success;                                           // 0x0(0x1)
	Struct FString                                               Body;                                              // 0x8(0x10)
	Struct FString                                               Id;                                                // 0x18(0x10)
};


// Size 0x30
class PlayerTalkingSettings: public None
{
public:
	Struct LinearColor                                           IconTint;                                          // 0x0(0x10)
	Class Texture2D*                                             Icon;                                              // 0x10(0x8)
	float                                                        ScreenEdgePadding;                                 // 0x18(0x4)
	float                                                        Scale;                                             // 0x1c(0x4)
	float                                                        FadeInTimeInSeconds;                               // 0x20(0x4)
};


// Size 0x18
class CoherentToWwiseEventDataAssetEntry: public None
{
public:
	Struct FString                                               CueKey;                                            // 0x0(0x10)
	Class WwiseEvent*                                            AudioEvent;                                        // 0x10(0x8)
};


// Size 0xf8
class AmmoUI: public None
{
public:
	Class Pawn*                                                  TargetPawn;                                        // 0x18(0x8)
};


// Size 0x170
class HealthUI: public None
{
public:
	float                                                        MinVisibleHealth;                                  // 0x0(0x4)
	float                                                        ContinuousTimePerUpdate;                           // 0x4(0x4)
	Class Pawn*                                                  TargetPawn;                                        // 0x20(0x8)
};


// Size 0x10
class CompanyRankData: public None
{
public:
	TArray<Struct CompanyRankGradeData>                          RankGradeData;                                     // 0x0(0x10)
};


// Size 0x18
class CompanyRankGradeData: public None
{
public:
	class                                                        Rank;                                              // 0x0(0x8)
	Struct StringAssetReference                                  Ribbon;                                            // 0x8(0x10)
};


// Size 0x60
class CompanyShopInfo: public None
{
public:
	bool                                                         ShouldShowCompanyInfo;                             // 0x0(0x1)
	Struct StringAssetReference                                  InfoSkin;                                          // 0x8(0x10)
	Struct FText                                                 InfoTitle;                                         // 0x18(0x38)
	TArray<Struct FText>                                         InfoTips;                                          // 0x50(0x10)
};


// Size 0x20
class CompanyShopSkin: public None
{
public:
	Struct StringAssetReference                                  TopBanner;                                         // 0x0(0x10)
	Struct StringAssetReference                                  BottomBanner;                                      // 0x10(0x10)
};


// Size 0xb8
class CompanySkin: public None
{
public:
	Struct StringAssetReference                                  BackgroundImage;                                   // 0x0(0x10)
	Struct StringAssetReference                                  RibbonImage;                                       // 0x10(0x10)
	byte                                                         Style;                                             // 0x20(0x1)
	Struct FString                                               RankIncreaseAudioCue;                              // 0x28(0x10)
	Struct FString                                               RankIncreaseStopAudioCue;                          // 0x38(0x10)
	Struct FString                                               RankLevelUpAudioCue;                               // 0x48(0x10)
	Struct FString                                               RankTriggerAudioCue;                               // 0x58(0x10)
	Struct FString                                               EmissaryRankIncreaseAudioCue;                      // 0x68(0x10)
	Struct FString                                               EmissaryRankIncreaseStopAudioCue;                  // 0x78(0x10)
	Struct FString                                               EmissaryRankLevelUpAudioCue;                       // 0x88(0x10)
	Struct FString                                               EmissaryRankTriggerAudioCue;                       // 0x98(0x10)
	Struct FString                                               EmissaryRankLevelUpMusicCue;                       // 0xa8(0x10)
};


// Size 0x18
class CompanyProgressIcons: public None
{
public:
	TArray<Struct CompanyProgressIcon>                           Icons;                                             // 0x0(0x10)
};


// Size 0x10
class CompanyProgressIcon: public None
{
public:
	Struct StringAssetReference                                  Icon;                                              // 0x0(0x10)
};


// Size 0x10
class CompanyReputationProgressModelCollection: public None
{
public:
	TArray<Struct CompanyReputationProgressModel>                CompanyProgress;                                   // 0x0(0x10)
};


// Size 0x28
class CompanyReputationProgressModel: public None
{
public:
	struct FName                                                 CompanyId;                                         // 0x0(0x8)
	Struct CompanyLevelDefinition                                NextCompanyLevel;                                  // 0x10(0x8)
	Struct FString                                               Sig;                                               // 0x18(0x10)
};


// Size 0x8
class CompanyLevelDefinition: public None
{
public:
};


// Size 0x10
class PlayerNewLevelEvent: public None
{
public:
	struct FName                                                 CompanyId;                                         // 0x8(0x8)
};


// Size 0x10
class EventCompanyRankProgressUpdateNotification: public None
{
public:
	struct FName                                                 Company;                                           // 0x0(0x8)
};


// Size 0x1
class PlayerCompanyProgressUpdatedEvent: public None
{
public:
};


// Size 0x50
class EventCompanyProgressUpdateNotification: public None
{
public:
	Struct CompanyReputationProgressModel                        CurrentProgress;                                   // 0x0(0x28)
	Struct CompanyReputationProgressModel                        PreviousProgress;                                  // 0x28(0x28)
};


// Size 0x10
class CompanyValidationAssetUnit: public None
{
public:
	class                                                        Company;                                           // 0x0(0x8)
	bool                                                         ShouldHaveLevels;                                  // 0x8(0x1)
	bool                                                         ShouldHaveEmblems;                                 // 0x9(0x1)
};


// Size 0x18
class ConstellationAudioPair: public None
{
public:
	class                                                        ConstellationClass;                                // 0x0(0x8)
	Class WwiseEvent*                                            AudioStartEvent;                                   // 0x8(0x8)
	Class WwiseEvent*                                            AudioStopEvent;                                    // 0x10(0x8)
};


// Size 0x10
class RegisterCeremonyInterface: public None
{
public:
};


// Size 0x98
class ContestCeremonyEvent: public None
{
public:
	TArray<class AudioEvents*>                                   AudioEvents;                                       // 0x0(0x10)
	TArray<Byte AudioEvents>                                     SpecialEvents;                                     // 0x10(0x10)
	Struct FText                                                 NPCName;                                           // 0x20(0x38)
	Struct FText                                                 NPCMessageToAllPlayers;                            // 0x58(0x38)
	float                                                        TimeToEvent;                                       // 0x90(0x4)
};


// Size 0x18
class ContestEventSet: public None
{
public:
	TArray<Struct ShipIdentityOwnership>                         Events;                                            // 0x0(0x10)
	byte                                                         BelongingStage;                                    // 0x10(0x1)
	byte                                                         StageTimePivot;                                    // 0x11(0x1)
};


// Size 0x180
class ShipIdentityOwnership: public None
{
public:
	Struct Guid                                                  OwningCrewID;                                      // 0x0(0x10)
	Struct ShipLiveryCatalogueEntry                              Identity;                                          // 0x10(0x170)
};


// Size 0x170
class ShipLiveryCatalogueEntry: public None
{
public:
	Struct Guid                                                  Id;                                                // 0x0(0x10)
	Struct StringAssetReference                                  Desc;                                              // 0x10(0x10)
	Struct StringAssetReference                                  RowboatLiveryDesc;                                 // 0x20(0x10)
	TArray<Struct FText>                                         Names;                                             // 0x30(0x10)
	class                                                        ShipSize;                                          // 0x40(0x8)
	bool                                                         AvailableToGame;                                   // 0x48(0x1)
	struct FName                                                 FeatureName;                                       // 0x4c(0x8)
	Struct FText                                                 ShipTeamName;                                      // 0x58(0x38)
	Struct FText                                                 ArenaCrewWelcomeMessage;                           // 0x90(0x38)
	Struct FText                                                 ShipUINotificationTeamName;                        // 0xc8(0x38)
	Class Texture*                                               ShipScrollTeamIcon;                                // 0x100(0x8)
	Struct StringAssetReference                                  ShipToastTeamIcon;                                 // 0x108(0x10)
	Struct StringAssetReference                                  ShipToastTeamBackgroundImage;                      // 0x118(0x10)
	Struct StringAssetReference                                  ShipToastForegroundArtWork;                        // 0x128(0x10)
	Struct StringAssetReference                                  ShipTeamBackgroundImage;                           // 0x138(0x10)
	struct FName                                                 AudioEventName;                                    // 0x148(0x8)
	Struct StringAssetReference                                  TeamTavernBannerTexture;                           // 0x150(0x10)
	Class Texture*                                               CrewLiveryOverlayIcon;                             // 0x160(0x8)
	bool                                                         AvailableWhenFeatureEnabled;                       // 0x168(0x1)
	bool                                                         AvailableWhenFeatureDisabled;                      // 0x169(0x1)
};


// Size 0x10
class ShipLiveryCatalogue: public None
{
public:
	TArray<Struct OwnedCrewCostumes>                             Liveries;                                          // 0x0(0x10)
};


// Size 0x20
class OwnedCrewCostumes: public None
{
public:
	Struct Guid                                                  CrewId;                                            // 0x0(0x10)
	TArray<AssetClass CrewId>                                    Costumes;                                          // 0x10(0x10)
};


// Size 0xe8
class TimedContestEventAction: public None
{
public:
	Struct FText                                                 NPCName;                                           // 0x8(0x38)
	Struct FText                                                 NPCMessageToAllPlayers;                            // 0x40(0x38)
	float                                                        Duration;                                          // 0x78(0x4)
	TArray<Byte Duration>                                        SpecialEvents;                                     // 0x80(0x10)
	TArray<class AudioEvents*>                                   AudioEvents;                                       // 0x90(0x10)
};


// Size 0x28
class DebugCrewContestInfo: public None
{
public:
	Struct Guid                                                  CrewId;                                            // 0x0(0x10)
	Struct FString                                               ShipName;                                          // 0x10(0x10)
	int                                                          Score;                                             // 0x20(0x4)
};


// Size 0x8
class AchievementCompleteContest: public None
{
public:
};


// Size 0x28
class ContestCrewRequirementData: public None
{
public:
	int                                                          CrewCount;                                         // 0x0(0x4)
	Struct FString                                               CrewCountServicesConfigRetrievalString;            // 0x8(0x10)
	TArray<Struct ShipSizeRequirementData>                       OpenCrewRequirementData;                           // 0x18(0x10)
};


// Size 0x20
class ShipSizeRequirementData: public None
{
public:
	class                                                        ShipSize;                                          // 0x0(0x8)
	int                                                          OpenCrewMemberCount;                               // 0x8(0x4)
	Struct FString                                               OpenCrewCountRetrivalString;                       // 0x10(0x10)
};


// Size 0x1
class UpdateContestUI: public None
{
public:
};


// Size 0x20
class ContestChestDugUpEvent: public None
{
public:
	Struct Guid                                                  CrewId;                                            // 0x0(0x10)
	Class Actor*                                                 DiscoveringCharacter;                              // 0x10(0x8)
	Class ItemInfo*                                              TreasureChestItemInformation;                      // 0x18(0x8)
};


// Size 0x30
class CrewScoreAppendedEvent: public None
{
public:
	byte                                                         ScoreId;                                           // 0x0(0x1)
	Struct Guid                                                  CrewId;                                            // 0x4(0x10)
	int                                                          CrewScore;                                         // 0x14(0x4)
	byte                                                         ScoreReason;                                       // 0x18(0x1)
	Struct StringAssetReference                                  ScoringIconAssetReference;                         // 0x20(0x10)
};


// Size 0x1c
class CrewScoredEvent: public None
{
public:
	byte                                                         ScoreId;                                           // 0x0(0x1)
	Struct Guid                                                  CrewId;                                            // 0x4(0x10)
	int                                                          CrewScore;                                         // 0x14(0x4)
	byte                                                         ReasonForScoring;                                  // 0x18(0x1)
};


// Size 0x1c
class CrewWinEvent: public None
{
public:
	byte                                                         ScoreId;                                           // 0x0(0x1)
	Struct Guid                                                  CrewId;                                            // 0x4(0x10)
	int                                                          CrewScore;                                         // 0x14(0x4)
	byte                                                         ReasonForScoring;                                  // 0x18(0x1)
};


// Size 0x18
class RequestSilverEvent: public None
{
public:
	Struct Guid                                                  CrewId;                                            // 0x0(0x10)
	Class WieldableItem*                                         WieldableItemSold;                                 // 0x10(0x8)
};


// Size 0xe0
class ScoreRewardData: public None
{
public:
	TArray<Struct ScoreRewardWieldableItemData>                  WieldableItemScores;                               // 0x0(0x10)
	TArray<Struct ScoreRewardShipPartData>                       ShipPartScores;                                    // 0x10(0x10)
	Struct ScoreRewardValueData                                  KillingPlayerScore;                                // 0x20(0x30)
	Struct ScoreRewardValueData                                  DownedPlayerScore;                                 // 0x50(0x30)
	Struct ScoreRewardValueData                                  CrewShipSunkScore;                                 // 0x80(0x30)
	Struct ScoreRewardValueData                                  DigUpChestScore;                                   // 0xb0(0x30)
};


// Size 0x30
class ScoreRewardValueData: public None
{
public:
	int                                                          ScoreToAward;                                      // 0x0(0x4)
	Struct FString                                               ServicesConfigRetrievalString;                     // 0x8(0x10)
	byte                                                         ReasonForScore;                                    // 0x18(0x1)
	TArray<Int >                                                 ScoreByPeriod;                                     // 0x20(0x10)
};


// Size 0x38
class ScoreRewardShipPartData: public None
{
public:
	class                                                        ShipPart;                                          // 0x0(0x8)
	Struct ScoreRewardValueData                                  Score;                                             // 0x8(0x30)
};


// Size 0x68
class ScoreRewardWieldableItemData: public None
{
public:
	class                                                        WieldableItemClass;                                // 0x0(0x8)
	Struct ScoreRewardValueData                                  NotStolenScore;                                    // 0x8(0x30)
	Struct ScoreRewardValueData                                  StolenScore;                                       // 0x38(0x30)
};


// Size 0x20
class ScoreReasonIcons: public None
{
public:
	byte                                                         ReasonForScore;                                    // 0x0(0x1)
	Struct StringAssetReference                                  ScoringIconAssetReference;                         // 0x8(0x10)
	Class Texture*                                               ScoreScrollScoringIcon;                            // 0x18(0x8)
};


// Size 0x30
class ContestScoreTelemetryGameEvent: public None
{
public:
	byte                                                         ScoreReason;                                       // 0x0(0x1)
	int                                                          CurrentScore;                                      // 0x4(0x4)
	int                                                          ScoreChangeAmount;                                 // 0x8(0x4)
	Struct FString                                               ScoreContext;                                      // 0x10(0x10)
	Struct Guid                                                  InstigatorId;                                      // 0x20(0x10)
};


// Size 0x80
class ContestUIDescriptions: public None
{
public:
	Class PopUpMessageDesc*                                      NewMapDesc;                                        // 0x0(0x8)
	Class PopUpMessageDesc*                                      ShipSunkDesc;                                      // 0x8(0x8)
	Struct FText                                                 ContestStartBlindText;                             // 0x10(0x38)
	Struct FText                                                 ContestEndBlindText;                               // 0x48(0x38)
};


// Size 0x10
class ShipLiveryTeamSet: public None
{
public:
	TArray<Struct OtherCrewMuteStateResponse>                    ShipCatalogue;                                     // 0x0(0x10)
};


// Size 0x1
class OtherCrewMuteStateResponse: public None
{
public:
	byte                                                         MuteState;                                         // 0x0(0x1)
};


// Size 0x1
class OtherCrewMuteStateRequest: public None
{
public:
};


// Size 0x1
class CrewMuteOthersPhrasesEvent: public None
{
public:
	bool                                                         IsMuted;                                           // 0x0(0x1)
};


// Size 0x18
class CrewMutePlayerPhrasesEvent: public None
{
public:
	Struct FString                                               XUID;                                              // 0x0(0x10)
	bool                                                         IsMuted;                                           // 0x10(0x1)
};


// Size 0x1
class CrewMuteOthersChatEvent: public None
{
public:
	bool                                                         IsMuted;                                           // 0x0(0x1)
};


// Size 0x18
class CrewMutePlayerChatEvent: public None
{
public:
	Struct FString                                               XUID;                                              // 0x0(0x10)
	bool                                                         IsMuted;                                           // 0x10(0x1)
};


// Size 0x1
class CrewMuteOthersVoiceEvent: public None
{
public:
	bool                                                         IsMuted;                                           // 0x0(0x1)
};


// Size 0x18
class CrewMutePlayerVoiceEvent: public None
{
public:
	Struct FString                                               XUID;                                              // 0x0(0x10)
	bool                                                         IsMuted;                                           // 0x10(0x1)
};


// Size 0x10
class ContestCrewManagementMemberDataEvent: public None
{
public:
	TArray<Struct ContestCrewManagementMemberData>               Members;                                           // 0x0(0x10)
};


// Size 0x38
class ContestCrewManagementMemberData: public None
{
public:
	Struct FString                                               XUID;                                              // 0x0(0x10)
	Struct FString                                               GamerTag;                                          // 0x10(0x10)
	byte                                                         Muted;                                             // 0x20(0x1)
	Struct FString                                               CrewIcon;                                          // 0x28(0x10)
};


// Size 0x1
class ContestStopCrewManagementEvent: public None
{
public:
};


// Size 0x1
class ContestRequestCrewManagementEvent: public None
{
public:
};


// Size 0x10
class ContestUpdateScoreBoardTimer: public None
{
public:
	Struct FString                                               TimeRemaining;                                     // 0x0(0x10)
};


// Size 0x28
class ContestLaunchStartBlinds: public None
{
public:
	Struct Guid                                                  CrewId;                                            // 0x10(0x10)
	float                                                        DisplayDuration;                                   // 0x20(0x4)
};


// Size 0x20
class StagingPlayerWelcomingPopup: public None
{
public:
	Struct Guid                                                  LiveryID;                                          // 0x10(0x10)
};


// Size 0x20
class ContestShipSinkNetworkEvent: public None
{
public:
	Struct Guid                                                  CrewLiveryId;                                      // 0x10(0x10)
};


// Size 0x30
class ContestEndEvent: public None
{
public:
	int                                                          Position;                                          // 0x0(0x4)
	Struct FString                                               Message;                                           // 0x8(0x10)
	TArray<Struct ScoreboardItems>                               Scores;                                            // 0x18(0x10)
	float                                                        HoldDuration;                                      // 0x28(0x4)
};


// Size 0x38
class ScoreboardItems: public None
{
public:
	Struct FString                                               Icon;                                              // 0x0(0x10)
	Struct FString                                               CrewName;                                          // 0x10(0x10)
	Struct FString                                               Score;                                             // 0x20(0x10)
	bool                                                         IsMyCrew;                                          // 0x30(0x1)
};


// Size 0x48
class ContestStartEvent: public None
{
public:
	Struct FString                                               Message;                                           // 0x0(0x10)
	Struct FString                                               CrewIcon;                                          // 0x10(0x10)
	Struct FString                                               CrewName;                                          // 0x20(0x10)
	TArray<Str >                                                 CrewMembers;                                       // 0x30(0x10)
	float                                                        HoldDuration;                                      // 0x40(0x4)
};


// Size 0x18
class ContestNotificationNetworkEvent: public None
{
public:
	Class PopUpMessageDesc*                                      PopUpDesc;                                         // 0x10(0x8)
};


// Size 0x10
class ContestRequestScoreBoardData: public None
{
public:
};


// Size 0x10
class RequestContestStateEvent: public None
{
public:
};


// Size 0x18
class ContestStateChangedEvent: public None
{
public:
	byte                                                         ContestState;                                      // 0x10(0x1)
};


// Size 0x20
class UpdateScoreBalanceHUDEvent: public None
{
public:
	TArray<Struct ContestLeaderboardEntry>                       ContestLeaderboard;                                // 0x10(0x10)
};


// Size 0x38
class ContestLeaderboardEntry: public None
{
public:
	Struct FString                                               CrewIconPath;                                      // 0x10(0x10)
	bool                                                         IsMyCrew;                                          // 0x20(0x1)
	int                                                          Amount;                                            // 0x24(0x4)
	Struct FString                                               DisplayAmount;                                     // 0x28(0x10)
};


// Size 0x30
class ScoreGrantedNotificationUIEvent: public None
{
public:
	byte                                                         ScoreId;                                           // 0x0(0x1)
	Struct FString                                               DisplayAmount;                                     // 0x8(0x10)
	int                                                          Amount;                                            // 0x18(0x4)
	Struct FString                                               ScoringIconPath;                                   // 0x20(0x10)
};


// Size 0x28
class TrackedCrewInContest: public None
{
public:
	TArray<Struct PlayersSpawningInTavern>                       PlayersSpawningInTavern;                           // 0x18(0x10)
};


// Size 0x10
class PlayersSpawningInTavern: public None
{
public:
	Class PlayerState*                                           PlayerState;                                       // 0x0(0x8)
};


// Size 0x10
class CrewShipPersistentDataManager: public None
{
public:
	TArray<Struct CrewShipPersistentData>                        Data;                                              // 0x0(0x10)
};


// Size 0x18
class CrewShipPersistentData: public None
{
public:
	Struct Guid                                                  CrewId;                                            // 0x0(0x10)
	Class CrewShipManifest*                                      CrewShipManifest;                                  // 0x10(0x8)
};


// Size 0x4
class VoyageQuestsBegun: public None
{
public:
	int                                                          QuestCount;                                        // 0x0(0x4)
};


// Size 0x8
class VoyageChapterBegun: public None
{
public:
	int                                                          ChapterIndex;                                      // 0x0(0x4)
	int                                                          ChapterCount;                                      // 0x4(0x4)
};


// Size 0x90
class VoyageChestDiscoveredInContest: public None
{
public:
	Struct FString                                               DiscovererName;                                    // 0x10(0x10)
	bool                                                         IsDiscovererMe;                                    // 0x20(0x1)
	bool                                                         PlayAudio;                                         // 0x21(0x1)
	Class PopUpMessageDesc*                                      PopUpDesc;                                         // 0x28(0x8)
	Struct FText                                                 CrewName;                                          // 0x30(0x38)
	Struct StringAssetReference                                  ToastBackgroundImage;                              // 0x68(0x10)
	Struct StringAssetReference                                  BackgroundImage;                                   // 0x78(0x10)
	struct FName                                                 AudioEventName;                                    // 0x88(0x8)
};


// Size 0x30
class VoyageChestDiscovered: public None
{
public:
	Struct NetActorPtr                                           PlayerStateOfDiscoverer;                           // 0x0(0x14)
	bool                                                         IsDiscovererMe;                                    // 0x14(0x1)
	struct FName                                                 ChestRarity;                                       // 0x18(0x8)
	bool                                                         PlayAudio;                                         // 0x20(0x1)
	Class PopUpMessageDesc*                                      PopUpDesc;                                         // 0x28(0x8)
};


// Size 0x38
class VoyageCancelled: public None
{
public:
	Struct FText                                                 Title;                                             // 0x0(0x38)
};


// Size 0x40
class VoyageComplete: public None
{
public:
	bool                                                         DoNotNotifyParticipantsOnVoyageComplete;           // 0x0(0x1)
	Struct FText                                                 Title;                                             // 0x8(0x38)
};


// Size 0x38
class VoyageBegun: public None
{
public:
	Struct FText                                                 Title;                                             // 0x0(0x38)
};


// Size 0x40
class ContestMapCrewData: public None
{
public:
	Struct Guid                                                  CrewId;                                            // 0x0(0x10)
	bool                                                         IsLocalCrew;                                       // 0x10(0x1)
	Class Texture*                                               CrewIcon;                                          // 0x18(0x8)
	Class Texture*                                               ScoreIcon;                                         // 0x20(0x8)
	Class Texture*                                               UnderlineIcon;                                     // 0x28(0x8)
	struct FName                                                 CrewName;                                          // 0x30(0x8)
	int                                                          Score;                                             // 0x38(0x4)
};


// Size 0x68
class ContestMapLayoutScoreInfo: public None
{
public:
	Struct TreasureMapWidgetTexture                              ScoreInfoIcon;                                     // 0x0(0x28)
	Struct TreasureMapWidgetText                                 ScoreInfoText;                                     // 0x28(0x38)
	byte                                                         ScoreReason;                                       // 0x60(0x1)
};


// Size 0xe8
class ContestMapLayoutCrew: public None
{
public:
	Struct TreasureMapWidgetTexture                              CrewIcon;                                          // 0x0(0x28)
	Struct TreasureMapWidgetTexture                              ScoreIcon;                                         // 0x28(0x28)
	Struct TreasureMapWidgetTexture                              UnderlineIcon;                                     // 0x50(0x28)
	Struct TreasureMapWidgetText                                 CrewName;                                          // 0x78(0x38)
	Struct TreasureMapWidgetText                                 Score;                                             // 0xb0(0x38)
};


// Size 0x40
class ContestMapContents: public None
{
public:
	Struct FString                                               VoyageName;                                        // 0x0(0x10)
	Struct FString                                               ScoreboardTitle;                                   // 0x10(0x10)
	TArray<Struct ScoreboardTitle>                               CrewsData;                                         // 0x20(0x10)
	TArray<Byte CrewsData>                                       ScoreReasonsToShowInfo;                            // 0x30(0x10)
};


// Size 0x50
class MerchantSpawnData: public None
{
public:
	Struct Transform                                             MerchantTransform;                                 // 0x20(0x30)
};


// Size 0x30
class ContestMigrationRequestMessage: public None
{
public:
	Struct Guid                                                  MigrationId;                                       // 0x0(0x10)
	Struct FString                                               DestinationEndpoint;                               // 0x10(0x10)
	TArray<Struct DestinationEndpoint>                           CrewIds;                                           // 0x20(0x10)
};


// Size 0x20
class QuestVariableContestIslandArchetype: public None
{
public:
};


// Size 0x60
class ContestShipLiverySet: public None
{
public:
	Struct Guid                                                  OwningCrewID;                                      // 0x0(0x10)
};


// Size 0x28
class WeightedContestList: public None
{
public:
	TArray<Struct WeightedEmergentContestVoyageRecipe>           WeightedContests;                                  // 0x8(0x10)
	TArray<Struct WeightedTallTaleContestRecipe>                 WeightedTallTaleContests;                          // 0x18(0x10)
};


// Size 0x10
class WeightedTallTaleContestRecipe: public None
{
public:
	Class TallTaleContestRecipeDataAsset*                        TallTaleContest;                                   // 0x0(0x8)
	int                                                          WeightedChance;                                    // 0x8(0x4)
};


// Size 0x10
class WeightedEmergentContestVoyageRecipe: public None
{
public:
	Class EmergentContestVoyageRecipeDataAsset*                  ContestVoyage;                                     // 0x0(0x8)
	int                                                          WeightedChance;                                    // 0x8(0x4)
};


// Size 0x20
class TallTaleContestInfo: public None
{
public:
	TArray<Class ContestVoyageInfo>                              ValidShipTypes;                                    // 0x0(0x10)
	Struct WeightedTallTaleContestRecipe                         WeightedTallTaleContest;                           // 0x10(0x10)
};


// Size 0x20
class ContestVoyageInfo: public None
{
public:
	TArray<Class ContestVoyagesSelectorUnit>                     ValidShipTypes;                                    // 0x0(0x10)
	Struct WeightedEmergentContestVoyageRecipe                   WeightedContestVoyage;                             // 0x10(0x10)
};


// Size 0x10
class ContestVoyagesSelectorUnit: public None
{
public:
	struct FName                                                 FeatureToggle;                                     // 0x0(0x8)
	Class ContestVoyagesDataAsset*                               ContestVoyages;                                    // 0x8(0x8)
};


// Size 0x50
class CachedRespawnPoint: public None
{
public:
	Struct Guid                                                  CrewId;                                            // 0x0(0x10)
	Struct Transform                                             AllocatedRespawnPoint;                             // 0x10(0x30)
	Class ShipSpawnLocation*                                     AllocatedSpawnLocation;                            // 0x40(0x8)
};


// Size 0x50
class ContestZoneVendorShipData: public None
{
public:
	Struct Transform                                             ContestZoneWorldLocation;                          // 0x20(0x30)
};


// Size 0xc0
class CoordinatedKrakenTentacleSpawnInfo: public None
{
public:
	Struct Transform                                             SpawnTransform;                                    // 0x0(0x30)
	Struct Transform                                             FinalSpawnTransform;                               // 0x30(0x30)
	int                                                          ClientCapsuleCullCount;                            // 0x60(0x4)
	bool                                                         ShouldDockToTargetActor;                           // 0x64(0x1)
	bool                                                         RequiresBoxCollider;                               // 0x65(0x1)
	bool                                                         RequiresKnockback;                                 // 0x66(0x1)
	Struct Vector                                                BoxExtents;                                        // 0x68(0xc)
	Struct Transform                                             BoxOffset;                                         // 0x80(0x30)
};


// Size 0x18
class ProposedTaleEntry: public None
{
public:
	Class VoyageDescDataAsset*                                   TaleData;                                          // 0x0(0x8)
	Class Actor*                                                 ProposingObject;                                   // 0x8(0x8)
	bool                                                         CanStartTale;                                      // 0x10(0x1)
};


// Size 0x10
class ProposedVoyageEntry: public None
{
public:
	Class VoyageProposalDesc*                                    ProposalDesc;                                      // 0x0(0x8)
	Class AthenaPlayerState*                                     ProposingPlayerState;                              // 0x8(0x8)
};


// Size 0x10
class ShipCustomizationLoadoutPartCustomizations: public None
{
public:
	TArray<Struct PartDesc>                                      Parts;                                             // 0x0(0x10)
};


// Size 0x20
class PartDesc: public None
{
public:
	Struct FString                                               Name;                                              // 0x0(0x10)
	TArray<Struct PartCustomisation>                             Customisations;                                    // 0x10(0x10)
};


// Size 0x20
class PartCustomisation: public None
{
public:
	Struct FString                                               Category;                                          // 0x0(0x10)
	Struct StringAssetReference                                  Customisation;                                     // 0x10(0x10)
};


// Size 0x4
class SinkShipData: public None
{
public:
	int                                                          ShipNetGUID;                                       // 0x0(0x4)
};


// Size 0x60
class CustomTriggerData: public None
{
public:
	Class TriggerBase*                                           TriggerObject;                                     // 0x0(0x8)
	bool                                                         DetectingPlayers;                                  // 0x58(0x1)
	bool                                                         DetectingShips;                                    // 0x59(0x1)
	bool                                                         DetectingEnemies;                                  // 0x5a(0x1)
};


// Size 0x40
class ProjectileLauncherMechanismSourceShipParams: public None
{
public:
	class                                                        ShipSize;                                          // 0x0(0x8)
	Struct ProjectileLauncherMechanismSourceWatercraftParams     Params;                                            // 0x8(0x38)
};


// Size 0x38
class ProjectileLauncherMechanismSourceWatercraftParams: public None
{
public:
	float                                                        ShipBoundsMultiplier;                              // 0x0(0x4)
	float                                                        NearMissChance;                                    // 0x4(0x4)
	Struct WeightedProbabilityRangeOfRanges                      NearMissShipOffsetInMetres;                        // 0x8(0x30)
};


// Size 0x90
class LevelOfDamageProperties: public None
{
public:
	float                                                        LeakAmount;                                        // 0x0(0x4)
	float                                                        RepairTime;                                        // 0x4(0x4)
	float                                                        UndoRepairTime;                                    // 0x8(0x4)
	float                                                        NonOwningCrewUndoRepairTime;                       // 0xc(0x4)
	Class MaterialInterface*                                     HoleDecalMaterial;                                 // 0x10(0x8)
	Struct Transform                                             HoleDecalComponentTransform;                       // 0x20(0x30)
	Struct Vector                                                ParticleSystemComponentLocation;                   // 0x50(0xc)
	float                                                        InternalWaterSamplePositionTopOffset;              // 0x5c(0x4)
	float                                                        InternalWaterSamplePositionBottomOffset;           // 0x60(0x4)
	Class ParticleSystem*                                        ParticleSystem_WaterLeakAboveWater;                // 0x68(0x8)
	Class ParticleSystem*                                        ParticleSystem_WaterLeakBelowWater;                // 0x70(0x8)
	Class ParticleSystem*                                        ParticleSystem_RepairLeakAboveWater;               // 0x78(0x8)
	Class ParticleSystem*                                        ParticleSystem_RepairLeakBelowWater;               // 0x80(0x8)
	Class ParticleSystem*                                        ParticleSystem_SplashOnInternalWaterSurface;       // 0x88(0x8)
};


// Size 0x18
class AuthorityRepairableState: public None
{
public:
	byte                                                         RepairableState;                                   // 0x0(0x1)
	TArray<Weakclass RepairableState>                            RepairingList;                                     // 0x8(0x10)
};


// Size 0x18
class DeferralReasonPopUpNotificationInfo: public None
{
public:
	Struct FString                                               DeferralReason;                                    // 0x0(0x10)
	Class PopUpMessageDesc*                                      PopUp;                                             // 0x10(0x8)
};


// Size 0x48
class MultipleNPCCompaniesRedirectionData: public None
{
public:
	TArray<Class SingleNPCCompanyRedirectionData>                Companies;                                         // 0x0(0x10)
	Struct FText                                                 VisitNPCTooltip;                                   // 0x10(0x38)
};


// Size 0x40
class SingleNPCCompanyRedirectionData: public None
{
public:
	class                                                        Company;                                           // 0x0(0x8)
	Struct FText                                                 VisitNPCTooltip;                                   // 0x8(0x38)
};


// Size 0x18
class ItemDiggingAnimationOverride: public None
{
public:
	TArray<AssetClass ItemDiggingAudioOverride>                  Classes;                                           // 0x0(0x10)
	Class ItemDiggingAnimationConfig*                            DiggingAnimationConfig;                            // 0x10(0x8)
};


// Size 0x18
class ItemDiggingAudioOverride: public None
{
public:
	TArray<AssetClass ItemDiggingBaseOverride>                   Classes;                                           // 0x0(0x10)
	Class ItemDiggingAudioConfig*                                DiggingAudioConfig;                                // 0x10(0x8)
};


// Size 0x18
class ItemDiggingBaseOverride: public None
{
public:
	TArray<AssetClass ItemBuryingBaseOverride>                   Classes;                                           // 0x0(0x10)
	Class ItemDiggingBaseConfig*                                 DiggingBaseConfig;                                 // 0x10(0x8)
};


// Size 0x18
class ItemBuryingBaseOverride: public None
{
public:
	TArray<AssetClass ItemDiggingEffectsOverride>                Classes;                                           // 0x0(0x10)
	Class ItemDiggingBuryConfig*                                 BuryingConfig;                                     // 0x10(0x8)
};


// Size 0x18
class ItemDiggingEffectsOverride: public None
{
public:
	TArray<AssetClass DioramaDebugMenuEntry>                     Classes;                                           // 0x0(0x10)
	Class ItemDiggingEffectsConfig*                              DiggingEffectsConfig;                              // 0x10(0x8)
};


// Size 0x30
class DioramaDebugMenuEntry: public None
{
public:
	Class AISpawner*                                             Spawner;                                           // 0x0(0x8)
	Class AIDioramaDesc*                                         DioramaDesc;                                       // 0x8(0x8)
	Struct FString                                               DioramaName;                                       // 0x10(0x10)
	Struct FString                                               TaleId;                                            // 0x20(0x10)
};


// Size 0x14
class DrunkennessSetupData: public None
{
public:
	byte                                                         DrunkennessType;                                   // 0x0(0x1)
	float                                                        MaxDrunkenness;                                    // 0x4(0x4)
	float                                                        GettingDrunkDrunkennessChangePerSec;               // 0x8(0x4)
	float                                                        SoberingUpDrunkennessChangePerSec;                 // 0xc(0x4)
	bool                                                         AutoSoberUpWhenFullyDrunk;                         // 0x10(0x1)
};


// Size 0x18
class EmissaryRewardMultiplierModel: public None
{
public:
	struct FName                                                 EmissaryName;                                      // 0x0(0x8)
	TArray<Struct EmissaryLevelMultiplierModel>                  Multipliers;                                       // 0x8(0x10)
};


// Size 0x8
class EmissaryLevelMultiplierModel: public None
{
public:
	int                                                          Level;                                             // 0x0(0x4)
	float                                                        Multiplier;                                        // 0x4(0x4)
};


// Size 0x90
class EmissaryDisplayInformation: public None
{
public:
	Struct FText                                                 Title;                                             // 0x0(0x38)
	Struct FText                                                 Description;                                       // 0x38(0x38)
	Struct StringAssetReference                                  KeyArt;                                            // 0x70(0x10)
	Struct StringAssetReference                                  Icon;                                              // 0x80(0x10)
};


// Size 0x10
class EntitlementsFailedEvent: public None
{
public:
	Struct FString                                               Message;                                           // 0x0(0x10)
};


// Size 0x10
class EntitlementsResponseEvent: public None
{
public:
	TArray<Struct EntitlementItem>                               Entitlements;                                      // 0x0(0x10)
};


// Size 0xa8
class EntitlementItem: public None
{
public:
	Struct FText                                                 Description;                                       // 0x0(0x38)
	bool                                                         Owned;                                             // 0x38(0x1)
	Struct StringAssetReference                                  PreviewImageUrl;                                   // 0x40(0x10)
	Struct StringAssetReference                                  ThumbnailImageUrl;                                 // 0x50(0x10)
	Struct FText                                                 DisplayName;                                       // 0x60(0x38)
	Struct FString                                               Id;                                                // 0x98(0x10)
};


// Size 0x10
class EntitlementsRequestEvent: public None
{
public:
	TArray<Str None>                                             EntitlementIds;                                    // 0x0(0x10)
};


// Size 0x18
class RequiredClothingData: public None
{
public:
	int                                                          RequiredNumberToMatch;                             // 0x0(0x4)
	TArray<Class RequiredNumberToMatch>                          RequiredClothing;                                  // 0x8(0x10)
};


// Size 0x18
class ItemRequirementData: public None
{
public:
	int                                                          RequiredNumberToMatch;                             // 0x0(0x4)
	TArray<Class RequiredNumberToMatch>                          RequiredItemsInLoadout;                            // 0x8(0x10)
};


// Size 0x18
class EventTaleQuestServiceEntry: public None
{
public:
};


// Size 0x10
class EventObjectStateMigrationImpl: public None
{
public:
};


// Size 0x8
class EventReceiveExplosiveComponentState: public None
{
public:
	Class ExplosiveComponent*                                    Source;                                            // 0x0(0x8)
};


// Size 0x10
class ShipHullDamageParams: public None
{
public:
	TArray<Struct ShipHullDamageLevel>                           DamageLevels;                                      // 0x0(0x10)
};


// Size 0x18
class ShipHullDamageLevel: public None
{
public:
	class                                                        SpeedBand;                                         // 0x0(0x8)
	TArray<Struct ShipHullDamageTypeEntry>                       Params;                                            // 0x8(0x10)
};


// Size 0x48
class ShipHullDamageTypeEntry: public None
{
public:
	byte                                                         DamageType;                                        // 0x0(0x1)
	Struct ShipHullLandscapeDamageEntry                          LandscapeDamageParams;                             // 0x8(0x30)
	Struct ShipHullRammingSpurDamageEntry                        RammingSpurDamageParams;                           // 0x38(0x10)
};


// Size 0x10
class ShipHullRammingSpurDamageEntry: public None
{
public:
	TArray<Struct ShipDamageEntry>                               DamageAppliedToSelf;                               // 0x0(0x10)
};


// Size 0x50
class ShipDamageEntry: public None
{
public:
	class                                                        OtherShipSize;                                     // 0x0(0x8)
	Class ForceFeedbackEffect*                                   ForceFeedbackEffect;                               // 0x8(0x8)
	Struct Int32Range                                            NumZonesToDamageForInstigator;                     // 0x10(0x10)
	Struct Int32Range                                            DamageLevelForInstigator;                          // 0x20(0x10)
	Struct Int32Range                                            NumZonesToDamageForReceiver;                       // 0x30(0x10)
	Struct Int32Range                                            DamageLevelForReceiver;                            // 0x40(0x10)
};


// Size 0x30
class ShipHullLandscapeDamageEntry: public None
{
public:
	byte                                                         PhysicalSurface;                                   // 0x0(0x1)
	Class ForceFeedbackEffect*                                   ForceFeedbackEffect;                               // 0x8(0x8)
	Struct Int32Range                                            NumZonesToDamage;                                  // 0x10(0x10)
	Struct Int32Range                                            DamageLevel;                                       // 0x20(0x10)
};


// Size 0x10
class RammableExplosiveEntry: public None
{
public:
	class                                                        RammerType;                                        // 0x0(0x8)
	class                                                        MinimumSpeedForExplosion;                          // 0x8(0x8)
};


// Size 0x8
class ChargedAttackProjectileWeights: public None
{
public:
	float                                                        ChargeTime;                                        // 0x0(0x4)
	float                                                        Weight;                                            // 0x4(0x4)
};


// Size 0x20
class QuestVariablePlayerStat: public None
{
public:
};


// Size 0x70
class ClassicFireworkDebugList: public None
{
public:
	TArray<class Peony*>                                         Peony;                                             // 0x0(0x10)
	TArray<class Crackle*>                                       Crackle;                                           // 0x10(0x10)
	TArray<class Strobe*>                                        Strobe;                                            // 0x20(0x10)
	TArray<class Brocade*>                                       Brocade;                                           // 0x30(0x10)
	TArray<class Comet*>                                         Comet;                                             // 0x40(0x10)
	TArray<class HummingSnakes*>                                 HummingSnakes;                                     // 0x50(0x10)
	TArray<class Cakes*>                                         Cakes;                                             // 0x60(0x10)
};


// Size 0x20
class FireworkDebugListByFireworkType: public None
{
public:
	TArray<class Rockets*>                                       Rockets;                                           // 0x0(0x10)
	TArray<class Cakes*>                                         Cakes;                                             // 0x10(0x10)
};


// Size 0xc
class SailWithFlameOfFateColoursAboardStatData: public None
{
public:
	Struct PlayerStat                                            DefaultStatToFire;                                 // 0x4(0x4)
	Struct PlayerStat                                            AllianceStatToFire;                                // 0x8(0x4)
};


// Size 0x10
class FlamesOfFateShipInfo: public None
{
public:
	class                                                        ShipSize;                                          // 0x0(0x8)
};


// Size 0x28
class FlamesOfFateFlameInfo: public None
{
public:
	byte                                                         FlameOfFateType;                                   // 0x0(0x1)
	Struct Color                                                 LightColour;                                       // 0x4(0x4)
	Struct Color                                                 FXColour;                                          // 0x8(0x4)
	Struct Color                                                 GlowColour;                                        // 0xc(0x4)
	Struct Color                                                 FlameColour;                                       // 0x10(0x4)
	Class Texture*                                               FlameTexture;                                      // 0x18(0x8)
	Struct PlayerStat                                            StatToFireWhenTaken;                               // 0x20(0x4)
	Struct PlayerStat                                            StatToFireWhenTakenInAlliance;                     // 0x24(0x4)
};


// Size 0x34
class FogBankSettings: public None
{
public:
	byte                                                         FogState;                                          // 0x0(0x1)
	float                                                        Density;                                           // 0x4(0x4)
	Struct Vector                                                Scale;                                             // 0x8(0xc)
	Struct LinearColor                                           FogColour;                                         // 0x14(0x10)
	float                                                        FadeInDuration;                                    // 0x24(0x4)
	float                                                        ActiveDuration;                                    // 0x28(0x4)
	float                                                        FadeOutDuration;                                   // 0x2c(0x4)
	bool                                                         Persistent;                                        // 0x30(0x1)
};


// Size 0x18
class FogColourForSea: public None
{
public:
	class                                                        Sea;                                               // 0x0(0x8)
	Struct LinearColor                                           Colour;                                            // 0x8(0x10)
};


// Size 0xc
class FogBankManagerIslandNamesToKeepAwayFrom: public None
{
public:
	struct FName                                                 IslandName;                                        // 0x0(0x8)
	float                                                        MinimumDistanceFromIslandInKm;                     // 0x8(0x4)
};


// Size 0x8
class FogBankManagerIslandTypesToKeepAwayFrom: public None
{
public:
	byte                                                         IslandType;                                        // 0x0(0x1)
	float                                                        MinimumDistanceFromIslandInKm;                     // 0x4(0x4)
};


// Size 0x48
class FogBankManagerFogBankTemplate: public None
{
public:
	float                                                        Weight;                                            // 0x0(0x4)
	TArray<Class Weight>                                         FogBanks;                                          // 0x8(0x10)
	Struct WeightedProbabilityRangeOfRanges                      DistanceFromIslandInKm;                            // 0x18(0x30)
};


// Size 0x28
class DecalEntry: public None
{
public:
	Class DecalComponent*                                        DecalComponent;                                    // 0x0(0x8)
	Class MaterialInstanceDynamic*                               DecalMaterial;                                     // 0x8(0x8)
	Struct LinearColor                                           DecalColour;                                       // 0x10(0x10)
	int                                                          LocationIndex;                                     // 0x20(0x4)
};


// Size 0x18
class FootstepLocation: public None
{
public:
	Struct Vector                                                Location;                                          // 0x0(0xc)
	Struct Rotator                                               Rotation;                                          // 0xc(0xc)
};


// Size 0x8
class FragileComponentHealthScalarEntry: public None
{
public:
	byte                                                         HealthChangedReason;                               // 0x0(0x1)
	float                                                        HealthChangeScalar;                                // 0x4(0x4)
};


// Size 0x10
class FragileComponentShipDamageTypeEntry: public None
{
public:
	class                                                        ShipDamagerType;                                   // 0x0(0x8)
	float                                                        HealthChangePropagated;                            // 0x8(0x4)
};


// Size 0x28
class FuseComponentMetaWrapper: public None
{
public:
	bool                                                         FuseEnabled;                                       // 0x20(0x1)
	float                                                        FuseTimeScale;                                     // 0x24(0x4)
};


// Size 0x18
class ItemMetaBase: public None
{
public:
	Struct StringAssetReference                                  StoredStructType;                                  // 0x8(0x10)
};


// Size 0x10
class AnimationLODParameters: public None
{
public:
	int                                                          MaxIKEntities;                                     // 0x0(0x4)
	float                                                        MaxIKDistance;                                     // 0x4(0x4)
	float                                                        MinLODSolverDistance;                              // 0x8(0x4)
	float                                                        MinFootPlantingActiveDistance;                     // 0xc(0x4)
};


// Size 0x8
class GenericPartDesc: public None
{
public:
	Class StaticMesh*                                            Mesh;                                              // 0x0(0x8)
};


// Size 0x78
class TQStructGenParams: public None
{
public:
	int                                                          GenerationIterations;                              // 0x0(0x4)
	bool                                                         FailIfNoLocationData;                              // 0x4(0x1)
	float                                                        PreferredDistance;                                 // 0x8(0x4)
	float                                                        EventExclusionZoneRadius;                          // 0xc(0x4)
	float                                                        TransientActorExclusionZoneRadius;                 // 0x10(0x4)
	int                                                          ModuleCount;                                       // 0x14(0x4)
	Struct TQStructGenEntry                                      FinalModuleOverride;                               // 0x18(0x30)
	float                                                        CombatWeight;                                      // 0x48(0x4)
	int                                                          MaxCombatOccurrences;                              // 0x4c(0x4)
	TArray<Struct MaxCombatOccurrences>                          CombatGroups;                                      // 0x50(0x10)
	int                                                          MaxNonCombatOccurrences;                           // 0x60(0x4)
	TArray<Struct TQStructGenGroup>                              NonCombatGroups;                                   // 0x68(0x10)
};


// Size 0x28
class TQStructGenGroup: public None
{
public:
	struct FName                                                 FeatureName;                                       // 0x10(0x8)
	TArray<Struct TQStructGenEntry>                              Entries;                                           // 0x18(0x10)
};


// Size 0x10
class TQStructGenWeightedContainer: public None
{
public:
	struct FName                                                 Name;                                              // 0x0(0x8)
	float                                                        Weight;                                            // 0x8(0x4)
	int                                                          MaxOccurrences;                                    // 0xc(0x4)
};


// Size 0x30
class TQStructGenEntry: public None
{
public:
	Class TaleQuestDescAsset*                                    TaleQuestDesc;                                     // 0x10(0x8)
	Class PLQuestLocationDataBundle*                             LocationBundle;                                    // 0x18(0x8)
	bool                                                         LocationFiltering;                                 // 0x20(0x1)
	Struct Vector2D                                              AcceptableAreaLocation;                            // 0x24(0x8)
	float                                                        AcceptableAreaRadius;                              // 0x2c(0x4)
};


// Size 0x10
class TQStructGenSelection: public None
{
public:
	Class TaleQuestDescAsset*                                    TaleQuestDesc;                                     // 0x0(0x8)
	Class PLQuestLocationDataAsset*                              LocationData;                                      // 0x8(0x8)
};


// Size 0x20
class QuestVarLocationData: public None
{
public:
};


// Size 0x20
class QuestVarTaleQuest: public None
{
public:
};


// Size 0x10
class VoyageHandInEntry: public None
{
public:
	Class VoyageRecipeDataAsset*                                 VoyageRecipe;                                      // 0x0(0x8)
	class                                                        Item;                                              // 0x8(0x8)
};


// Size 0x1
class GlintVisibilityLock: public None
{
public:
};


// Size 0x10
class DirectorSettingEntry: public None
{
public:
	Class VoyageDescDataAsset*                                   VoyageDesc;                                        // 0x0(0x8)
	Struct FeatureFlag                                           Feature;                                           // 0x8(0x8)
};


// Size 0x20
class QuestVariablePageBundle: public None
{
public:
};


// Size 0x18
class PlayerHideoutInfo: public None
{
public:
	Class PlayerState*                                           PlayerState;                                       // 0x0(0x8)
	TArray<class ExitPoints*>                                    ExitPoints;                                        // 0x8(0x10)
};


// Size 0x28
class HoleItemToSpawn: public None
{
public:
	float                                                        Weight;                                            // 0x0(0x4)
	class                                                        ItemDesc;                                          // 0x8(0x8)
	TArray<Byte ItemDesc>                                        RestrictToSurface;                                 // 0x10(0x10)
	struct FName                                                 FeatureFlag;                                       // 0x20(0x8)
};


// Size 0xc
class MaxHolePerIslandDataAsset: public None
{
public:
	struct FName                                                 IslandName;                                        // 0x0(0x8)
	int                                                          MaxHoles;                                          // 0x8(0x4)
};


// Size 0x18
class HoleContainer: public None
{
public:
	TArray<Weakclass BuriedBuriable>                             Holes;                                             // 0x0(0x10)
	struct FName                                                 IslandName;                                        // 0x10(0x8)
};


// Size 0x48
class BuriedBuriable: public None
{
public:
	Struct Vector                                                Location;                                          // 0x18(0xc)
	float                                                        Radius;                                            // 0x24(0x4)
};


// Size 0x70
class Leak: public None
{
public:
	Struct WwiseEmitter                                          SFXEmitter;                                        // 0x30(0x20)
	Class ParticleSystemComponent*                               WaterLeakParticleSystem;                           // 0x50(0x8)
};


// Size 0x58
class ShipLeak: public None
{
public:
	Struct ShipLeakParams                                        Params;                                            // 0x0(0x1c)
	Class ParticleSystemComponent*                               SplashParticleSystem;                              // 0x40(0x8)
};


// Size 0x1c
class ShipLeakParams: public None
{
public:
	float                                                        InternalWaterSamplePositionTopOffset;              // 0x0(0x4)
	float                                                        InternalWaterSamplePositionBottomOffset;           // 0x4(0x4)
	float                                                        WaterSplashDelayMin;                               // 0x8(0x4)
	float                                                        WaterSplashDelayMax;                               // 0xc(0x4)
	float                                                        HullFloodedPercentageToShiftWaterSamplingPos;      // 0x10(0x4)
	float                                                        WaterSampleOffsetBelowHullFloodThreshold;          // 0x14(0x4)
	float                                                        WaterSampleOffsetAboveHullFloodThreshold;          // 0x18(0x4)
};


// Size 0x70
class HullDamageNamedParamSet: public None
{
public:
	struct FName                                                 Name;                                              // 0x0(0x8)
	Struct HullDamageParamSet                                    Params;                                            // 0x10(0x60)
};


// Size 0x60
class HullDamageParamSet: public None
{
public:
	Struct ShipLeakParams                                        LeakParams;                                        // 0x0(0x1c)
	float                                                        LeakAmount;                                        // 0x1c(0x4)
	Struct Transform                                             InternalHoleDecalOffset;                           // 0x20(0x30)
	byte                                                         Deck;                                              // 0x50(0x1)
};


// Size 0x10
class DebugSuperSailorActionStateParams: public None
{
public:
	float                                                        BaseForwardSpeed;                                  // 0x0(0x4)
	float                                                        YawSpeed;                                          // 0x4(0x4)
	float                                                        RightTriggerHeldSpdAmp;                            // 0x8(0x4)
	float                                                        RightTriggerHeldYawAmp;                            // 0xc(0x4)
};


// Size 0x34
class DockableCutsceneActionStateParams: public None
{
public:
	Struct LookAtOffsetParams                                    LookAtOffsetParams;                                // 0x18(0x1c)
};


// Size 0x18
class ControlObjectActionStateParams: public None
{
public:
	bool                                                         UndockToLastKnownLocation;                         // 0x10(0x1)
	float                                                        UndockDuration;                                    // 0x14(0x4)
};


// Size 0x10
class DockToObjectActionStateParams: public None
{
public:
	float                                                        DockTime;                                          // 0x0(0x4)
	float                                                        DelayAfterDockingTime;                             // 0x4(0x4)
	float                                                        ForcedFieldOfView;                                 // 0x8(0x4)
	bool                                                         ForceStash;                                        // 0xc(0x1)
};


// Size 0x1c
class LookAtOffsetParams: public None
{
public:
	bool                                                         UseLookAtPosition;                                 // 0x0(0x1)
	bool                                                         UseSpring;                                         // 0x1(0x1)
	float                                                        SpringAccel;                                       // 0x4(0x4)
	float                                                        MinYaw;                                            // 0x8(0x4)
	float                                                        MaxYaw;                                            // 0xc(0x4)
	float                                                        MinPitch;                                          // 0x10(0x4)
	float                                                        MaxPitch;                                          // 0x14(0x4)
	byte                                                         CameraLookatAnimationType;                         // 0x18(0x1)
};


// Size 0x58
class UseMountedWeaponActionStateParams: public None
{
public:
	float                                                        CameraDockTime;                                    // 0x18(0x4)
	Class ForceFeedbackEffect*                                   FireForceFeedbackEffect;                           // 0x20(0x8)
	class                                                        FireCameraShake;                                   // 0x28(0x8)
	class                                                        FireInputId;                                       // 0x30(0x8)
	TArray<Class FireInputId>                                    AimYawInputId;                                     // 0x38(0x10)
	TArray<Class AimYawInputId>                                  AimPitchInputId;                                   // 0x48(0x10)
};


// Size 0x60
class UseCannonActionStateParams: public None
{
public:
	Struct UseMountedWeaponActionStateParams                     MountedWeaponParams;                               // 0x0(0x58)
	float                                                        ReloadAttemptRepeatRate;                           // 0x58(0x4)
};


// Size 0x40
class CapturedByKrakenActionStateParams: public None
{
public:
	Class CurveFloat*                                            MovementAlphaXY;                                   // 0x0(0x8)
	Class CurveFloat*                                            MovementAlphaZ;                                    // 0x8(0x8)
	Class CurveFloat*                                            MovementRotation;                                  // 0x10(0x8)
	float                                                        MovementTime;                                      // 0x18(0x4)
	float                                                        DistanceFromTentacleToStartFade;                   // 0x1c(0x4)
	float                                                        FadeInDuration;                                    // 0x20(0x4)
	float                                                        ClientConditionsCompleteTimeout;                   // 0x24(0x4)
	float                                                        MinCameraPitch;                                    // 0x28(0x4)
	float                                                        MaxCameraPitch;                                    // 0x2c(0x4)
	float                                                        MinCameraYaw;                                      // 0x30(0x4)
	float                                                        MaxCameraYaw;                                      // 0x34(0x4)
	float                                                        AnimationProgressionToStopCameraFade;              // 0x38(0x4)
	float                                                        BlockInteractInputTime;                            // 0x3c(0x4)
};


// Size 0x30
class ClamberActionStateParams: public None
{
public:
	float                                                        InitialClamberPitch;                               // 0x10(0x4)
	Struct LookAtOffsetParams                                    LookAtOffsetParams;                                // 0x14(0x1c)
};


// Size 0x34
class ControlCapstanArmActionStateParams: public None
{
public:
	Struct LookAtOffsetParams                                    LookAtOffsetParams;                                // 0x18(0x1c)
};


// Size 0x34
class ControlPulleyActionStateParams: public None
{
public:
	Struct LookAtOffsetParams                                    LookAtOffsetParams;                                // 0x18(0x1c)
};


// Size 0x34
class ControlWheelActionStateParams: public None
{
public:
	Struct LookAtOffsetParams                                    LookAtOffsetParams;                                // 0x18(0x1c)
};


// Size 0x28
class FiredFromActorActionStateParams: public None
{
public:
	float                                                        GravityScaleOverride;                              // 0x0(0x4)
	float                                                        MassOverride;                                      // 0x4(0x4)
	float                                                        UnderwaterBrakingFactorOverride;                   // 0x8(0x4)
	float                                                        UnderwaterBrakingFactorOverrideDuration;           // 0xc(0x4)
	Struct Vector2D                                              MaskFiringLagScaleMinMax;                          // 0x10(0x8)
	Struct Vector2D                                              MaskFiringLagScalingTimeMinMax;                    // 0x18(0x8)
	float                                                        MaskFiringLagSpeedToleranceSquared;                // 0x20(0x4)
	float                                                        TimeUntilRevertingIgnoredActors;                   // 0x24(0x4)
};


// Size 0x28
class HideInObjectActionStateParams: public None
{
public:
	TArray<Byte IngestedByKrakenActionStateParams>               PreventedHealthChanges;                            // 0x18(0x10)
};


// Size 0x4
class IngestedByKrakenActionStateParams: public None
{
public:
	float                                                        StowItemsProgressThreshold;                        // 0x0(0x4)
};


// Size 0x10
class TransitionLadderActionStateParams: public None
{
public:
};


// Size 0x14
class LinearTransitionLadderActionStateParams: public None
{
public:
	float                                                        Duration;                                          // 0x10(0x4)
};


// Size 0x1c
class UseMapTableActionStateParams: public None
{
public:
	float                                                        CameraDockTime;                                    // 0x18(0x4)
};


// Size 0x4
class MigrationActionStateParams: public None
{
public:
	float                                                        ClientSetupResponseTimeout;                        // 0x0(0x4)
};


// Size 0x4
class RepairObjectActionStateParams: public None
{
public:
	float                                                        MountTime;                                         // 0x0(0x4)
};


// Size 0x10
class ShovelDigActionStateParams: public None
{
public:
	Class CurveFloat*                                            SuccessfulPitchBlendCurve;                         // 0x0(0x8)
	Class CurveFloat*                                            DeflectedPitchBlendCurve;                          // 0x8(0x8)
};


// Size 0x10
class SplineTransitionLadderActionStateParams: public None
{
public:
};


// Size 0x8
class SwallowedByKrakenActionStateParams: public None
{
public:
	float                                                        FadeToBlackDuration;                               // 0x0(0x4)
	float                                                        DeathDelayTime;                                    // 0x4(0x4)
};


// Size 0x2c
class TeleportActionStateParams: public None
{
public:
	float                                                        FadeDuration;                                      // 0x0(0x4)
	float                                                        FadeEventTimeout;                                  // 0x4(0x4)
	float                                                        FadeServerTimeout;                                 // 0x8(0x4)
	Struct LinearColor                                           FadeColour;                                        // 0xc(0x10)
	bool                                                         FadeAudio;                                         // 0x1c(0x1)
	float                                                        CharacterFadeCompleteTimeout;                      // 0x20(0x4)
	float                                                        TeleportCompleteTimeout;                           // 0x24(0x4)
	float                                                        TeleportNetRelevancyTimeout;                       // 0x28(0x4)
};


// Size 0x4c
class UseLadderActionStateParams: public None
{
public:
	float                                                        ClimbUpSpeed;                                      // 0x10(0x4)
	float                                                        ClimbDownSpeed;                                    // 0x14(0x4)
	float                                                        LadderRungHeight;                                  // 0x18(0x4)
	float                                                        SpeedToEnterSlidingAnimationMs;                    // 0x1c(0x4)
	float                                                        MaxLadderSlidingSpeedMs;                           // 0x20(0x4)
	float                                                        InitialDockBottomPitch;                            // 0x24(0x4)
	float                                                        InitialDockTopPitch;                               // 0x28(0x4)
	float                                                        TopBottomTolerance;                                // 0x2c(0x4)
	Struct LookAtOffsetParams                                    LookAtOffsetParams;                                // 0x30(0x1c)
};


// Size 0x1
class WaitForDemoResetActionStateParams: public None
{
public:
};


// Size 0x14
class WaitingToSpawnActionStateParams: public None
{
public:
	float                                                        ClientStartedTimeout;                              // 0x0(0x4)
	float                                                        ClientConditionsCompleteTimeout;                   // 0x4(0x4)
	float                                                        ScreenFadeInTime;                                  // 0x8(0x4)
	float                                                        TeleportCompleteTimeout;                           // 0xc(0x4)
	float                                                        TeleportNetRelevancyTimeout;                       // 0x10(0x4)
};


// Size 0x34
class WaterBarrelActionStateParams: public None
{
public:
	Struct LookAtOffsetParams                                    LookAtOffsetParams;                                // 0x18(0x1c)
};


// Size 0x4
class UndoRepairActionStateParams: public None
{
public:
	float                                                        MountTime;                                         // 0x0(0x4)
};


// Size 0xe8
class ActivePlayerState: public None
{
public:
};


// Size 0x80
class EventInactivityDetectionActionPerformed: public None
{
public:
	Struct PirateIdentity                                        PirateIdentity;                                    // 0x0(0x78)
	struct FName                                                 ActionName;                                        // 0x78(0x8)
};


// Size 0x78
class PirateIdentity: public None
{
public:
	Struct UniqueNetIdRepl                                       UserId;                                            // 0x0(0x18)
	Struct FString                                               PirateId;                                          // 0x18(0x10)
};


// Size 0x30
class VaultPuzzleSolutionEntry: public None
{
public:
	Struct VaultPuzzleSolutionPositions                          SolutionPositions;                                 // 0x0(0x10)
	Struct StringAssetReference                                  MaterialSet;                                       // 0x10(0x10)
	Struct StringAssetReference                                  TreasureVaultTableMaterialSet;                     // 0x20(0x10)
};


// Size 0x10
class VaultPuzzleSolutionPositions: public None
{
public:
	TArray<Int None>                                             SolutionPositions;                                 // 0x0(0x10)
};


// Size 0x110
class InteractableLightParams: public None
{
public:
	bool                                                         DebugDraw;                                         // 0x0(0x1)
	bool                                                         IsSpotlight;                                       // 0x1(0x1)
	struct FName                                                 LightTag;                                          // 0x4(0x8)
	Struct InteractableLightState                                OnParameters;                                      // 0x10(0x80)
	Struct InteractableLightState                                OffParameters;                                     // 0x90(0x80)
};


// Size 0x80
class InteractableLightState: public None
{
public:
	bool                                                         Enabled;                                           // 0x0(0x1)
	Struct Transform                                             Transform;                                         // 0x10(0x30)
	float                                                        Intensity;                                         // 0x40(0x4)
	float                                                        ConeAngleInner;                                    // 0x44(0x4)
	float                                                        ConeAngleOuter;                                    // 0x48(0x4)
	float                                                        AttenuationRadius;                                 // 0x4c(0x4)
	Struct Color                                                 LightColour;                                       // 0x50(0x4)
	byte                                                         SimpleFunctionType;                                // 0x54(0x1)
	float                                                        ScaleOffset;                                       // 0x58(0x4)
	float                                                        PulsePhase;                                        // 0x5c(0x4)
	float                                                        FlickerFrequency;                                  // 0x60(0x4)
	float                                                        IntensityScaleForWater;                            // 0x64(0x4)
	float                                                        MinDistanceToLightClamp;                           // 0x68(0x4)
	bool                                                         ApplyScaleForTranslucency;                         // 0x6c(0x1)
	float                                                        ScaleForTranslucency;                              // 0x70(0x4)
	bool                                                         ApplyCapForTranslucency;                           // 0x74(0x1)
	float                                                        CapForTranslucency;                                // 0x78(0x4)
};


// Size 0x3
class LightData: public None
{
public:
	byte                                                         FlameOfFateType;                                   // 0x0(0x1)
	bool                                                         LightIsOn_Server;                                  // 0x1(0x1)
	bool                                                         LitWithLantern;                                    // 0x2(0x1)
};


// Size 0x28
class CategorySpec: public None
{
public:
	class                                                        ItemCategory;                                      // 0x0(0x8)
	TArray<Class ItemCategory>                                   FallbackCategories;                                // 0x8(0x10)
	Struct FString                                               DefaultSlotIconURL;                                // 0x18(0x10)
};


// Size 0x10
class InventoryManipulatorAutoEquipPolicyEntry: public None
{
public:
	class                                                        Category;                                          // 0x0(0x8)
	byte                                                         Policy;                                            // 0x8(0x1)
};


// Size 0x58
class FaunaTypeSettings: public None
{
public:
	bool                                                         bGuaranteedSpawn;                                  // 0x0(0x1)
	int                                                          FaunaTypeSpawnChance;                              // 0x4(0x4)
	Struct WeightedProbabilityRange                              NumFaunaGroups;                                    // 0x8(0x20)
	Struct WeightedProbabilityRange                              NumFaunaPerGroup;                                  // 0x28(0x20)
	TArray<Struct WeightedAISpawnTypeParams>                     SpawnTypes;                                        // 0x48(0x10)
};


// Size 0xc
class EncounterParams: public None
{
public:
	byte                                                         EncounterType;                                     // 0x0(0x1)
	float                                                        EncounterRadius;                                   // 0x4(0x4)
	byte                                                         EncounterDimensions;                               // 0x8(0x1)
	byte                                                         EncounterMobility;                                 // 0x9(0x1)
};


// Size 0x14
class IslandLocationVerifierResult: public None
{
public:
	bool                                                         Success;                                           // 0x0(0x1)
	Struct Vector                                                AdjustedLocation;                                  // 0x4(0xc)
	int                                                          ResultCode;                                        // 0x10(0x4)
};


// Size 0x18
class CannonAILocation: public None
{
public:
	Struct Vector                                                Centre;                                            // 0x0(0xc)
	Struct Vector                                                Direction;                                         // 0xc(0xc)
};


// Size 0x14
class CannonAISpawnerZone: public None
{
public:
	Struct Vector                                                Centre;                                            // 0x0(0xc)
	float                                                        Radius;                                            // 0xc(0x4)
	bool                                                         IslandNotCannonZone;                               // 0x10(0x1)
};


// Size 0x18
class RequiredShipCustomizationData: public None
{
public:
	int                                                          RequiredNumberToMatch;                             // 0x0(0x4)
	TArray<Class RequiredNumberToMatch>                          RequiredShipCustomizations;                        // 0x8(0x10)
};


// Size 0x20
class ItemLoadoutComponentSlots: public None
{
public:
	TArray<Class ItemPreviewUpdateCameraEvent>                   WeaponSlots;                                       // 0x0(0x10)
	TArray<Struct ItemLoadoutSlot>                               Slots;                                             // 0x10(0x10)
};


// Size 0x20
class ItemLoadoutSlot: public None
{
public:
	class                                                        ItemCategory;                                      // 0x0(0x8)
	TArray<class Items*>                                         Items;                                             // 0x8(0x10)
	int                                                          Capacity;                                          // 0x18(0x4)
};


// Size 0x18
class ItemPreviewUpdateCameraEvent: public None
{
public:
	Struct ItemPreviewView                                       View;                                              // 0x0(0x18)
};


// Size 0x18
class ItemPreviewView: public None
{
public:
	struct FName                                                 CameraName;                                        // 0x0(0x8)
	Class AnimationAsset*                                        Anim;                                              // 0x8(0x8)
	bool                                                         ShouldSpin;                                        // 0x10(0x1)
};


// Size 0x1
class ItemPreviewShutdownEvent: public None
{
public:
};


// Size 0x1
class ItemPreviewBusyEvent: public None
{
public:
};


// Size 0x50
class ItemPreviewDataReadyEvent: public None
{
public:
	Struct ItemPreviewView                                       ItemView;                                          // 0x30(0x18)
	bool                                                         Valid;                                             // 0x48(0x1)
	float                                                        PreviewTickInitialTime;                            // 0x4c(0x4)
};


// Size 0xc
class ItemPreviewMoveCameraEvent: public None
{
public:
	float                                                        Rotation;                                          // 0x0(0x4)
	float                                                        Pitch;                                             // 0x4(0x4)
	float                                                        Zoom;                                              // 0x8(0x4)
};


// Size 0x18
class CategoryPreviewEntry: public None
{
public:
	class                                                        PreviewCategory;                                   // 0x0(0x8)
	class                                                        ItemCategoryClass;                                 // 0x8(0x8)
	class                                                        PreviewClassType;                                  // 0x10(0x8)
};


// Size 0x38
class SetRadialItemsAggregate: public None
{
public:
	TArray<Struct SetItemOnRadialInventorySlot>                  Items;                                             // 0x8(0x10)
	TArray<Struct SetTotalItemsOnRadialInventorySlot>            Quantities;                                        // 0x18(0x10)
