// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x20
class BP_BuoyantStorageBarrel_LockedToWater_CursedSails_C: public BuoyantStorageContainer
{
public:
	Class SphereComponent*                                       Sphere;                                            // 0x6f0(0x8)
	Class ReplenishableComponent*                                Replenishable;                                     // 0x6f8(0x8)
	Class TelemetrySubjectComponent*                             TelemetrySubject;                                  // 0x700(0x8)
	Class StorageContainerComponent*                             StorageContainer;                                  // 0x708(0x8)
};


// Size 0x0
class BP_fod_EarthwormsFresh_00_a_ItemDesc_C: public ItemDesc
{
public:
};


// Size 0x48
class BP_MermaidGem_ItemInfo_Sapphire_C: public BP_Placement_HeightDrop_C
{
public:
	Class StaticMeshComponent*                                   StaticMeshComponent07;                             // 0x410(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent06;                             // 0x418(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent05;                             // 0x420(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent04;                             // 0x428(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent03;                             // 0x430(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent02;                             // 0x438(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent01;                             // 0x440(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent0;                              // 0x448(0x8)
	Class SceneComponent*                                        SharedRoot;                                        // 0x450(0x8)
};


// Size -0x26bebb0d
class BP_MermaidGem_ItemInfo_Emerald_C: public None
{
public:
};


// Size 0x0
class BP_BuoyantWoodBarrel_LockedToWater_C: public BP_BuoyantStorageBarrel_LockedToWater_C
{
public:
};


// Size 0x0
class BP_BuoyantFoodBarrel_LockedToWater_C: public BP_BuoyantStorageBarrel_LockedToWater_C
{
public:
};


// Size 0x0
class BP_BuoyantCannonballBarrel_LockedToWater_C: public BP_BuoyantStorageBarrel_LockedToWater_C
{
public:
};


// Size 0x20003
class BP_MermaidGem_ItemInfo_Ruby_C: public None
{
public:
};


// Size 0x20
class BP_MA_LS_BuoyantStorageBarrel_LockedToWater_C: public BuoyantStorageContainer
{
public:
	Class SphereComponent*                                       Sphere;                                            // 0x6f0(0x8)
	Class ReplenishableComponent*                                Replenishable;                                     // 0x6f8(0x8)
	Class TelemetrySubjectComponent*                             TelemetrySubject;                                  // 0x700(0x8)
	Class StorageContainerComponent*                             StorageContainer;                                  // 0x708(0x8)
};


// Size 0x20
class BP_BuoyantStorageBarrel_LockedToWater_C: public BuoyantStorageContainer
{
public:
	Class SphereComponent*                                       Sphere;                                            // 0x6f0(0x8)
	Class ReplenishableComponent*                                Replenishable;                                     // 0x6f8(0x8)
	Class TelemetrySubjectComponent*                             TelemetrySubject;                                  // 0x700(0x8)
	Class StorageContainerComponent*                             StorageContainer;                                  // 0x708(0x8)
};


}