// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x20
class BP_BuoyantStorageBarrel_LockedToWater_CursedSails_C: public BuoyantStorageContainer
{
public:
	Class SphereComponent*                                       Sphere;                                            // 0x6f0(0x8)
	Class ReplenishableComponent*                                Replenishable;                                     // 0x6f8(0x8)
	Class TelemetrySubjectComponent*                             TelemetrySubject;                                  // 0x700(0x8)
	Class StorageContainerComponent*                             StorageContainer;                                  // 0x708(0x8)
};


// Size 0x0
class BP_fod_EarthwormsFresh_00_a_ItemDesc_C: public ItemDesc
{
public:
};


// Size 0x0
class BP_BuoyantWoodBarrel_LockedToWater_C: public BP_BuoyantStorageBarrel_LockedToWater_C
{
public:
};


// Size 0x0
class BP_BuoyantFoodBarrel_LockedToWater_C: public BP_BuoyantStorageBarrel_LockedToWater_C
{
public:
};


// Size 0x0
class BP_BuoyantCannonballBarrel_LockedToWater_C: public BP_BuoyantStorageBarrel_LockedToWater_C
{
public:
};


// Size 0x20
class BP_MA_LS_BuoyantStorageBarrel_LockedToWater_C: public BuoyantStorageContainer
{
public:
	Class SphereComponent*                                       Sphere;                                            // 0x6f0(0x8)
	Class ReplenishableComponent*                                Replenishable;                                     // 0x6f8(0x8)
	Class TelemetrySubjectComponent*                             TelemetrySubject;                                  // 0x700(0x8)
	Class StorageContainerComponent*                             StorageContainer;                                  // 0x708(0x8)
};


// Size 0x20
class BP_BuoyantStorageBarrel_LockedToWater_C: public BuoyantStorageContainer
{
public:
	Class SphereComponent*                                       Sphere;                                            // 0x6f0(0x8)
	Class ReplenishableComponent*                                Replenishable;                                     // 0x6f8(0x8)
	Class TelemetrySubjectComponent*                             TelemetrySubject;                                  // 0x700(0x8)
	Class StorageContainerComponent*                             StorageContainer;                                  // 0x708(0x8)
};


}