// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x0
class BP_wpn_flintlock_pistol_skd_01_a_ItemDesc_C: public ItemDesc
{
public:
};


// Size 0x0
class BP_SkeletonsOrders_Desc_C: public ItemWithoutIconsDesc
{
public:
};


// Size 0x0
class BP_AncientCollectorsChest_Desc_C: public BootyItemDesc
{
public:
};


// Size 0x0
class BP_AshenChestCollectorsChest_Desc_C: public BootyItemDesc
{
public:
};


// Size 0x0
class BP_BoxOfSecrets_Desc_C: public BootyItemDesc
{
public:
};


// Size 0x0
class BP_BriggsyCollectorsChest_Desc_C: public BootyItemDesc
{
public:
};


// Size 0x0
class BP_CollectorsChest_Desc_C: public BootyItemDesc
{
public:
};


// Size 0x0
class BP_CollectorsChest_MaidenVoyage_Desc_C: public BootyItemDesc
{
public:
};


// Size 0x0
class BP_CollectorsChest_RevengeOfTheMorningstar_Desc_C: public BootyItemDesc
{
public:
};


// Size 0x0
class BP_LockedCollectorsChest_Desc_C: public BP_CollectorsChest_Desc_C
{
public:
};


// Size 0x0
class BP_LockedEquipmentChest_Desc_C: public BootyItemDesc
{
public:
};


// Size 0x0
class BP_LockedFateofTheMorningstarChest_Desc_C: public BP_CollectorsChest_Desc_C
{
public:
};


// Size 0x0
class BP_LoversChest_Desc_C: public BootyItemDesc
{
public:
};


// Size 0x0
class BP_Shroudbreaker_AncientCollectorsChest_Desc_C: public BootyItemDesc
{
public:
};


// Size 0x0
class BP_SkeletonCollectorsChest_Desc_C: public BootyItemDesc
{
public:
};


// Size 0x0
class BP_TreasureChest_Common_Desc_Rome_C: public BootyItemDesc
{
public:
};


// Size 0x0
class BP_TreasureChest_Common_Tutorial_C: public BootyItemDesc
{
public:
};


// Size 0x0
class BP_TreasureChest_Legendary_Desc_Rome_C: public BootyItemDesc
{
public:
};


// Size 0x0
class BP_TreasureChest_Mythical_Desc_Rome_C: public BootyItemDesc
{
public:
};


// Size 0x0
class BP_TreasureChest_Rare_Desc_Rome_C: public BootyItemDesc
{
public:
};


// Size 0x0
class BP_UnLockedEquipmentChest_Desc_C: public BootyItemDesc
{
public:
};


// Size 0x0
class BP_TreasureChest_Common_Desc_C: public BootyItemDesc
{
public:
};


// Size 0x0
class BP_TreasureChest_Drunken_Desc_C: public BootyItemDesc
{
public:
};


// Size 0x0
class BP_TreasureChest_Legendary_Desc_C: public BootyItemDesc
{
public:
};


// Size 0x0
class BP_TreasureChest_Mythical_Desc_C: public BootyItemDesc
{
public:
};


// Size 0x0
class BP_TreasureChest_Rare_Desc_C: public BootyItemDesc
{
public:
};


// Size 0x0
class BP_TreasureChest_Weeping_Desc_C: public BootyItemDesc
{
public:
};


// Size 0x0
class BP_MerchantCrate_BananaCrate_Desc_C: public BootyItemDesc
{
public:
};


// Size 0x0
class BP_MerchantCrate_BigGunpowderBarrel_Desc_C: public BootyItemDesc
{
public:
};


// Size 0x0
class BP_MerchantCrate_CannonballCrate_Desc_C: public BootyItemDesc
{
public:
};


// Size 0x0
class BP_MerchantCrate_ChickenCrate_Desc_C: public BootyItemDesc
{
public:
};


// Size 0x0
class BP_MerchantCrate_Commodity_Fort_Desc_C: public BootyItemDesc
{
public:
};


// Size 0x0
class BP_MerchantCrate_Commodity_Gemstones_Desc_C: public BootyItemDesc
{
public:
};


// Size 0x0
class BP_MerchantCrate_Commodity_Minerals_Desc_C: public BootyItemDesc
{
public:
};


// Size 0x0
class BP_MerchantCrate_Commodity_Ore_Desc_C: public BootyItemDesc
{
public:
};


// Size 0x0
class BP_MerchantCrate_Commodity_SilkCrate_Desc_C: public BootyItemDesc
{
public:
};


// Size 0x0
class BP_MerchantCrate_Commodity_SpiceCrate_Desc_C: public BootyItemDesc
{
public:
};


// Size 0x0
class BP_MerchantCrate_Commodity_SugarCrate_Desc_C: public BootyItemDesc
{
public:
};


// Size 0x0
class BP_MerchantCrate_Commodity_TeaCrate_Desc_C: public BootyItemDesc
{
public:
};


// Size 0x0
class BP_MerchantCrate_Commodity_VolcanicStone_Desc_C: public BootyItemDesc
{
public:
};


// Size 0x0
class BP_MerchantCrate_GhostCannonballCrate_Desc_C: public BootyItemDesc
{
public:
};


// Size 0x0
class BP_MerchantCrate_GunpowderBarrel_Desc_C: public BootyItemDesc
{
public:
};


// Size 0x0
class BP_MerchantCrate_PigCrate_Desc_C: public BootyItemDesc
{
public:
};


// Size 0x0
class BP_MerchantCrate_SnakeBasket_Desc_C: public BootyItemDesc
{
public:
};


// Size 0x0
class BP_MerchantCrate_WoodCrate_Desc_C: public BootyItemDesc
{
public:
};


// Size 0x0
class BP_GoldHoarder_SkeletonKey_Desc_C: public BootyItemDesc
{
public:
};


// Size 0x0
class BP_ReapersBountyChest_Desc_C: public BootyItemDesc
{
public:
};


// Size 0x0
class BP_ReapersChest_Desc_C: public BootyItemDesc
{
public:
};


// Size 0x0
class BP_ShipwreckTreasureChest_Common_Desc_C: public BootyItemDesc
{
public:
};


// Size 0x0
class BP_ShipwreckTreasureChest_Legendary_Desc_C: public BootyItemDesc
{
public:
};


// Size 0x0
class BP_ShipwreckTreasureChest_Mythical_Desc_C: public BootyItemDesc
{
public:
};


// Size 0x0
class BP_ShipwreckTreasureChest_Rare_Desc_C: public BootyItemDesc
{
public:
};


// Size 0x0
class BP_TreasureChest_AIShip_Desc_C: public BootyItemDesc
{
public:
};


// Size 0x0
class BP_TreasureChest_ChestOfRage_Desc_C: public BootyItemDesc
{
public:
};


// Size 0x0
class BP_TreasureChest_Common_Desc_DVR_C: public BootyItemDesc
{
public:
};


// Size 0x0
class BP_TreasureChest_Fort_Desc_C: public BootyItemDesc
{
public:
};


// Size 0x0
class BP_TreasureChest_Ghost_Desc_C: public BootyItemDesc
{
public:
};


// Size 0x0
class BP_TreasureChest_Legendary_Desc_DVR_C: public BootyItemDesc
{
public:
};


// Size 0x0
class BP_TreasureChest_Mythical_Desc_DVR_C: public BootyItemDesc
{
public:
};


// Size 0x0
class BP_TreasureChest_PirateLegend_Desc_C: public BootyItemDesc
{
public:
};


// Size 0x0
class BP_TreasureChest_PirateLegend_Desc_DVR_C: public BootyItemDesc
{
public:
};


// Size 0x0
class BP_TreasureChest_Rare_Desc_DVR_C: public BootyItemDesc
{
public:
};


// Size 0x0
class BP_fod_KrakenMeatRaw_00_a_ItemProxy_C: public BP_ProxyIngestible_Retractable_C
{
public:
};


// Size 0x0
class BP_fod_KrakenMeatRawBite1_00_a_ItemDesc_C: public ItemDesc
{
public:
};


// Size 0x0
class BP_fod_KrakenMeatRaw_00_a_Wieldable_C: public BP_StaticWieldableIngestible_C
{
public:
};


// Size 0x18
class BP_fod_KrakenMeatRaw_00_a_ItemInfo_C: public BP_MeatItemInfo_C
{
public:
	Class MaterialManipulationSettingsComponent*                 MaterialManipulationSettings;                      // 0x568(0x8)
	Class LightWeightStatusEffectManagerComponent*               LightweightStatusEffectManager;                    // 0x570(0x8)
	Class CookableComponent*                                     Cookable;                                          // 0x578(0x8)
};


// Size 0x0
class BP_fod_KrakenMeatRawBite1_00_a_ItemProxy_C: public BP_ProxyIngestible_Retractable_C
{
public:
};


// Size 0x0
class BP_fod_KrakenMeatRawBite1_00_a_Wieldable_C: public BP_StaticWieldableIngestible_C
{
public:
};


// Size 0x18
class BP_fod_KrakenMeatRawBite1_00_a_ItemInfo_C: public BP_MeatItemInfo_C
{
public:
	Class MaterialManipulationSettingsComponent*                 MaterialManipulationSettings;                      // 0x568(0x8)
	Class LightWeightStatusEffectManagerComponent*               LightweightStatusEffectManager;                    // 0x570(0x8)
	Class CookableComponent*                                     Cookable;                                          // 0x578(0x8)
};


// Size 0x30
class BP_PromptActor_EmissarySunk_AF_C: public BP_PromptActorBase_C
{
public:
	Struct PointerToUberGraphFrame                               UberGraphFrame;                                    // 0x408(0x8)
	BlueprintGeneratedClass BP_Prompt_EmissarySunk_C*            PromptCoordinator;                                 // 0x410(0x8)
	class                                                        PromptCounterAccessKey;                            // 0x418(0x8)
	class                                                        Company;                                           // 0x420(0x8)
	TArray<Struct PrioritisedPromptWithHandle>                   Prompts;                                           // 0x428(0x10)
};


// Size 0x30
class BP_PromptActor_EmissarySunk_GH_C: public BP_PromptActorBase_C
{
public:
	Struct PointerToUberGraphFrame                               UberGraphFrame;                                    // 0x408(0x8)
	BlueprintGeneratedClass BP_Prompt_EmissarySunk_C*            PromptCoordinator;                                 // 0x410(0x8)
	class                                                        PromptCounterAccessKey;                            // 0x418(0x8)
	class                                                        Company;                                           // 0x420(0x8)
	TArray<Struct PrioritisedPromptWithHandle>                   Prompts;                                           // 0x428(0x10)
};


// Size 0x30
class BP_PromptActor_EmissarySunk_MA_C: public BP_PromptActorBase_C
{
public:
	Struct PointerToUberGraphFrame                               UberGraphFrame;                                    // 0x408(0x8)
	BlueprintGeneratedClass BP_Prompt_EmissarySunk_C*            PromptCoordinator;                                 // 0x410(0x8)
	class                                                        PromptCounterAccessKey;                            // 0x418(0x8)
	class                                                        Company;                                           // 0x420(0x8)
	TArray<Struct PrioritisedPromptWithHandle>                   Prompts;                                           // 0x428(0x10)
};


// Size 0x30
class BP_PromptActor_EmissarySunk_OOS_C: public BP_PromptActorBase_C
{
public:
	Struct PointerToUberGraphFrame                               UberGraphFrame;                                    // 0x408(0x8)
	BlueprintGeneratedClass BP_Prompt_EmissarySunk_C*            PromptCoordinator;                                 // 0x410(0x8)
	class                                                        PromptCounterAccessKey;                            // 0x418(0x8)
	class                                                        Company;                                           // 0x420(0x8)
	TArray<Struct PrioritisedPromptWithHandle>                   Prompts;                                           // 0x428(0x10)
};


// Size 0x30
class BP_PromptActor_EmissarySunk_RB_C: public BP_PromptActorBase_C
{
public:
	Struct PointerToUberGraphFrame                               UberGraphFrame;                                    // 0x408(0x8)
	BlueprintGeneratedClass BP_Prompt_EmissarySunk_C*            PromptCoordinator;                                 // 0x410(0x8)
	class                                                        PromptCounterAccessKey;                            // 0x418(0x8)
	class                                                        Company;                                           // 0x420(0x8)
	TArray<Struct PrioritisedPromptWithHandle>                   Prompts;                                           // 0x428(0x10)
};


// Size 0x0
class BP_hair_col_white_01_over_Desc_C: public ClothingDesc
{
public:
};


// Size 0x0
class BP_hair_col_red_05_over_Desc_C: public ClothingDesc
{
public:
};


// Size 0x0
class BP_hair_col_red_04_over_Desc_C: public ClothingDesc
{
public:
};


// Size 0x0
class BP_hair_col_red_01_over_Desc_C: public ClothingDesc
{
public:
};


// Size 0x0
class BP_hair_col_brown_07_over_Desc_C: public ClothingDesc
{
public:
};


// Size 0x0
class BP_hair_col_brown_05_over_Desc_C: public ClothingDesc
{
public:
};


// Size 0x0
class BP_hair_col_brown_03_over_Desc_C: public ClothingDesc
{
public:
};


// Size 0x0
class BP_hair_col_blond_05_over_Desc_C: public ClothingDesc
{
public:
};


// Size 0x0
class BP_hair_col_blond_04_over_Desc_C: public ClothingDesc
{
public:
};


// Size 0x0
class BP_hair_col_blond_01_over_Desc_C: public ClothingDesc
{
public:
};


// Size 0x0
class BP_hair_col_black_03_over_Desc_C: public ClothingDesc
{
public:
};


// Size 0x0
class BP_hair_col_black_02_over_Desc_C: public ClothingDesc
{
public:
};


// Size 0x0
class BP_hair_col_black_01_over_Desc_C: public ClothingDesc
{
public:
};


// Size 0x0
class BP_MerchantCrate_AnyItemCrate_ItemDesc_C: public ItemWithoutIconsDesc
{
public:
};


// Size 0x0
class BP_MerchantCrate_CannonballCrate_FullyStocked_Desc_C: public BootyItemDesc
{
public:
};


}