// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x1a0
class BP_AudioBoatSkeletonHullAmbi_C: public ShipHullAudio
{
public:
	Class ShipAudioEmitterComponent*                             brig_Creak_BrigDeck_Centre2;                       // 0x560(0x8)
	Class TritonComponent*                                       Triton;                                            // 0x568(0x8)
	Class ShipAudioEmitterComponent*                             ShipAudio_StrainEmitter;                           // 0x570(0x8)
	Class ShipAudioEmitterComponent*                             wake_Bow;                                          // 0x578(0x8)
	Class ShipAudioEmitterComponent*                             water_Wash_Front_Right;                            // 0x580(0x8)
	Class ShipAudioEmitterComponent*                             water_Wash_Front_Left;                             // 0x588(0x8)
	Class ShipAudioEmitterComponent*                             water_Wash_Bow;                                    // 0x590(0x8)
	Class ShipAudioEmitterComponent*                             water_Wash_Back_Right;                             // 0x598(0x8)
	Class ShipAudioEmitterComponent*                             water_Wash_Back_Left;                              // 0x5a0(0x8)
	Class ShipAudioEmitterComponent*                             wake_Stern;                                        // 0x5a8(0x8)
	Class ShipAudioEmitterComponent*                             deck_Creak_TopDeck_Side_Right;                     // 0x5b0(0x8)
	Class ShipAudioEmitterComponent*                             deck_Creak_TopDeck_Side_Left;                      // 0x5b8(0x8)
	Class ShipAudioEmitterComponent*                             deck_Creak_TopDeck_PitchRoll;                      // 0x5c0(0x8)
	Class ShipAudioEmitterComponent*                             deck_Creak_TopDeck_Front_Top;                      // 0x5c8(0x8)
	Class ShipAudioEmitterComponent*                             deck_Creak_TopDeck_Front_Right;                    // 0x5d0(0x8)
	Class ShipAudioEmitterComponent*                             deck_creak_TopDeck_Back_Left;                      // 0x5d8(0x8)
	Class ShipAudioEmitterComponent*                             deck_Creak_TopDeck_Bow_Rope;                       // 0x5e0(0x8)
	Class ShipAudioEmitterComponent*                             deck_Creak_TopDeck_Bow_Bottom;                     // 0x5e8(0x8)
	Class ShipAudioEmitterComponent*                             deck_Creak_TopDeck_Back_Rope;                      // 0x5f0(0x8)
	Class ShipAudioEmitterComponent*                             deck_creak_TopDeck_Back_Right;                     // 0x5f8(0x8)
	Class ShipAudioEmitterComponent*                             deck_Creak_TopDeck_Front_Left;                     // 0x600(0x8)
	Class ShipAudioEmitterComponent*                             deck_Creak_Mast_Mizzen_Base;                       // 0x608(0x8)
	Class ShipAudioEmitterComponent*                             deck_Creak_Mast_Mizzen_Sail2;                      // 0x610(0x8)
	Class ShipAudioEmitterComponent*                             deck_Creak_Mast_Mizzen_Sail1;                      // 0x618(0x8)
	Class ShipAudioEmitterComponent*                             deck_Creak_Mast_Main_Sail1;                        // 0x620(0x8)
	Class ShipAudioEmitterComponent*                             deck_Creak_Mast_Main_Sail3;                        // 0x628(0x8)
	Class ShipAudioEmitterComponent*                             deck_Creak_Mast_Main_Sail2;                        // 0x630(0x8)
	Class ShipAudioEmitterComponent*                             deck_Creak_Mast_Main_Base;                         // 0x638(0x8)
	Class ShipAudioEmitterComponent*                             deck_Creak_Mast_Fore_Base;                         // 0x640(0x8)
	Class ShipAudioEmitterComponent*                             deck_Creak_Mast_Fore_Sail2;                        // 0x648(0x8)
	Class ShipAudioEmitterComponent*                             deck_Creak_Mast_Fore_Sail1;                        // 0x650(0x8)
	Class ShipAudioEmitterComponent*                             map_ShipAudio_Creak_MapDeck_Pillar_Front_Right;    // 0x658(0x8)
	Class ShipAudioEmitterComponent*                             map_ShipAudio_Creak_MapDeck_Pillar_Front_Left;     // 0x660(0x8)
	Class ShipAudioEmitterComponent*                             map_ShipAudio_Creak_MapDeck_Pillar_Mid_Left;       // 0x668(0x8)
	Class ShipAudioEmitterComponent*                             map_ShipAudio_Creak_MapDeck_Mast_Mizzen;           // 0x670(0x8)
	Class ShipAudioEmitterComponent*                             map_ShipAudio_Creak_MapDeck_Mast_Main;             // 0x678(0x8)
	Class ShipAudioEmitterComponent*                             map_ShipAudio_Creak_MapDeck_Mast_Fore;             // 0x680(0x8)
	Class ShipAudioEmitterComponent*                             map_Creak_MapDeck_Pillar_Back_Left;                // 0x688(0x8)
	Class ShipAudioEmitterComponent*                             captain_Creak_Captain_Back_Left;                   // 0x690(0x8)
	Class ShipAudioEmitterComponent*                             captain_Creak_Captain_Front_Right;                 // 0x698(0x8)
	Class ShipAudioEmitterComponent*                             captain_Creak_Captain_Front_Left;                  // 0x6a0(0x8)
	Class ShipAudioEmitterComponent*                             captain_Creak_Captain_Cage;                        // 0x6a8(0x8)
	Class ShipAudioEmitterComponent*                             captain_Creak_Captain_Back_Right;                  // 0x6b0(0x8)
	Class ShipAudioEmitterComponent*                             brig_Creak_BrigDeck_Pillar_Front_Right;            // 0x6b8(0x8)
	Class ShipAudioEmitterComponent*                             brig_Creak_BrigDeck_Pillar_Front_Left;             // 0x6c0(0x8)
	Class ShipAudioEmitterComponent*                             brig_Creak_BrigDeck_Pillar_Back_Right;             // 0x6c8(0x8)
	Class ShipAudioEmitterComponent*                             brig_Creak_BrigDeck_Pillar_Back_Left;              // 0x6d0(0x8)
	Class AudioPortalComponent*                                  portal_BrigDeckDoor;                               // 0x6d8(0x8)
	Class AudioPortalComponent*                                  portal_MapDeckStairs;                              // 0x6e0(0x8)
	Class AudioPortalComponent*                                  portal_MapDeckGrille;                              // 0x6e8(0x8)
	Class AudioPortalComponent*                                  portal_CaptCab_DeckDoor;                           // 0x6f0(0x8)
	Class AudioPortalComponent*                                  portal_CaptCab_SideDoor;                           // 0x6f8(0x8)
};


}