// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x1c0
class BP_AudioBoatLargeHullAmbi_C: public ShipHullAudio
{
public:
	Class TritonComponent*                                       None;                                              // 0x560(0x8)
	Class ShipAudioEmitterComponent*                             None;                                              // 0x568(0x8)
	Class ShipAudioEmitterComponent*                             None;                                              // 0x570(0x8)
	Class ShipAudioEmitterComponent*                             None;                                              // 0x578(0x8)
	Class ShipAudioEmitterComponent*                             None;                                              // 0x580(0x8)
	Class ShipAudioEmitterComponent*                             None;                                              // 0x588(0x8)
	Class ShipAudioEmitterComponent*                             None;                                              // 0x590(0x8)
	Class ShipAudioEmitterComponent*                             None;                                              // 0x598(0x8)
	Class ShipAudioEmitterComponent*                             None;                                              // 0x5a0(0x8)
	Class ShipAudioEmitterComponent*                             None;                                              // 0x5a8(0x8)
	Class ShipAudioEmitterComponent*                             None;                                              // 0x5b0(0x8)
	Class ShipAudioEmitterComponent*                             None;                                              // 0x5b8(0x8)
	Class ShipAudioEmitterComponent*                             None;                                              // 0x5c0(0x8)
	Class ShipAudioEmitterComponent*                             None;                                              // 0x5c8(0x8)
	Class ShipAudioEmitterComponent*                             None;                                              // 0x5d0(0x8)
	Class ShipAudioEmitterComponent*                             None;                                              // 0x5d8(0x8)
	Class ShipAudioEmitterComponent*                             None;                                              // 0x5e0(0x8)
	Class ShipAudioEmitterComponent*                             None;                                              // 0x5e8(0x8)
	Class ShipAudioEmitterComponent*                             None;                                              // 0x5f0(0x8)
	Class ShipAudioEmitterComponent*                             None;                                              // 0x5f8(0x8)
	Class ShipAudioEmitterComponent*                             None;                                              // 0x600(0x8)
	Class ShipAudioEmitterComponent*                             None;                                              // 0x608(0x8)
	Class ShipAudioEmitterComponent*                             None;                                              // 0x610(0x8)
	Class ShipAudioEmitterComponent*                             None;                                              // 0x618(0x8)
	Class ShipAudioEmitterComponent*                             None;                                              // 0x620(0x8)
	Class ShipAudioEmitterComponent*                             None;                                              // 0x628(0x8)
	Class ShipAudioEmitterComponent*                             None;                                              // 0x630(0x8)
	Class ShipAudioEmitterComponent*                             None;                                              // 0x638(0x8)
	Class ShipAudioEmitterComponent*                             None;                                              // 0x640(0x8)
	Class ShipAudioEmitterComponent*                             None;                                              // 0x648(0x8)
	Class ShipAudioEmitterComponent*                             None;                                              // 0x650(0x8)
	Class ShipAudioEmitterComponent*                             None;                                              // 0x658(0x8)
	Class ShipAudioEmitterComponent*                             None;                                              // 0x660(0x8)
	Class ShipAudioEmitterComponent*                             None;                                              // 0x668(0x8)
	Class ShipAudioEmitterComponent*                             None;                                              // 0x670(0x8)
	Class ShipAudioEmitterComponent*                             None;                                              // 0x678(0x8)
	Class ShipAudioEmitterComponent*                             None;                                              // 0x680(0x8)
	Class ShipAudioEmitterComponent*                             None;                                              // 0x688(0x8)
	Class ShipAudioEmitterComponent*                             None;                                              // 0x690(0x8)
	Class ShipAudioEmitterComponent*                             None;                                              // 0x698(0x8)
	Class ShipAudioEmitterComponent*                             None;                                              // 0x6a0(0x8)
	Class ShipAudioEmitterComponent*                             None;                                              // 0x6a8(0x8)
	Class ShipAudioEmitterComponent*                             None;                                              // 0x6b0(0x8)
	Class ShipAudioEmitterComponent*                             None;                                              // 0x6b8(0x8)
	Class ShipAudioEmitterComponent*                             None;                                              // 0x6c0(0x8)
	Class ShipAudioEmitterComponent*                             None;                                              // 0x6c8(0x8)
	Class ShipAudioEmitterComponent*                             None;                                              // 0x6d0(0x8)
	Class ShipAudioEmitterComponent*                             None;                                              // 0x6d8(0x8)
	Class ShipAudioEmitterComponent*                             None;                                              // 0x6e0(0x8)
	Class ShipAudioEmitterComponent*                             None;                                              // 0x6e8(0x8)
	Class ShipAudioEmitterComponent*                             None;                                              // 0x6f0(0x8)
	Class AudioPortalComponent*                                  None;                                              // 0x6f8(0x8)
	Class AudioPortalComponent*                                  None;                                              // 0x700(0x8)
	Class AudioPortalComponent*                                  None;                                              // 0x708(0x8)
	Class AudioPortalComponent*                                  None;                                              // 0x710(0x8)
	Class AudioPortalComponent*                                  None;                                              // 0x718(0x8)
};


}