// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0xc8
class BP_AudioBoatSmallHullAmbi_C: public ShipHullAudio
{
public:
	Class TritonComponent*                                       None;                                              // 0x560(0x8)
	Class ShipAudioEmitterComponent*                             None;                                              // 0x568(0x8)
	Class ShipAudioEmitterComponent*                             None;                                              // 0x570(0x8)
	Class ShipAudioEmitterComponent*                             None;                                              // 0x578(0x8)
	Class ShipAudioEmitterComponent*                             None;                                              // 0x580(0x8)
	Class ShipAudioEmitterComponent*                             None;                                              // 0x588(0x8)
	Class ShipAudioEmitterComponent*                             None;                                              // 0x590(0x8)
	Class ShipAudioEmitterComponent*                             None;                                              // 0x598(0x8)
	Class ShipAudioEmitterComponent*                             None;                                              // 0x5a0(0x8)
	Class ShipAudioEmitterComponent*                             None;                                              // 0x5a8(0x8)
	Class ShipAudioEmitterComponent*                             None;                                              // 0x5b0(0x8)
	Class ShipAudioEmitterComponent*                             None;                                              // 0x5b8(0x8)
	Class ShipAudioEmitterComponent*                             None;                                              // 0x5c0(0x8)
	Class ShipAudioEmitterComponent*                             None;                                              // 0x5c8(0x8)
	Class ShipAudioEmitterComponent*                             None;                                              // 0x5d0(0x8)
	Class ShipAudioEmitterComponent*                             None;                                              // 0x5d8(0x8)
	Class ShipAudioEmitterComponent*                             None;                                              // 0x5e0(0x8)
	Class ShipAudioEmitterComponent*                             None;                                              // 0x5e8(0x8)
	Class ShipAudioEmitterComponent*                             None;                                              // 0x5f0(0x8)
	Class AudioPortalComponent*                                  None;                                              // 0x5f8(0x8)
	Class AudioPortalComponent*                                  None;                                              // 0x600(0x8)
	Class AudioPortalComponent*                                  None;                                              // 0x608(0x8)
	Class AudioPortalComponent*                                  None;                                              // 0x610(0x8)
	Class AudioPortalComponent*                                  None;                                              // 0x618(0x8)
	Class AudioPortalComponent*                                  None;                                              // 0x620(0x8)
};


}