// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x164
class BP_AILargeShipTemplate_C: public Ship
{
public:
	Struct PointerToUberGraphFrame                               UberGraphFrame;                                    // 0x1570(0x8)
	Class ShipStorageJettisonComponent*                          ShipStorageJettison;                               // 0x1578(0x8)
	Class AIShipItemSpawnComponent*                              TridentRewards;                                    // 0x1580(0x8)
	Class AIShipItemSpawnComponent*                              StorageCrateRewards;                               // 0x1588(0x8)
	Class AIShipItemSpawnComponent*                              GemRewards;                                        // 0x1590(0x8)
	Class AIShipItemSpawnComponent*                              ChanceRewards_Campaign020;                         // 0x1598(0x8)
	Class AIShipItemSpawnComponent*                              HoldRewards_Campaign020;                           // 0x15a0(0x8)
	Class AIShipItemSpawnComponent*                              ExplosiveBarrelSpawner;                            // 0x15a8(0x8)
	Class AIShipItemSpawnComponent*                              HoldRewardsEmergent;                               // 0x15b0(0x8)
	Class WwiseEmitterComponent*                                 audio_skeletonship_emerge_submerge;                // 0x15b8(0x8)
	Class AIShipItemSpawnComponent*                              ChestRewards;                                      // 0x15c0(0x8)
	Class AIShipItemSpawnComponent*                              HoldRewardsSkull;                                  // 0x15c8(0x8)
	Class AIShipItemSpawnComponent*                              HoldRewardsChest;                                  // 0x15d0(0x8)
	Class AIShipItemSpawnComponent*                              MessageInABottleSpawner;                           // 0x15d8(0x8)
	Class AIShipItemSpawnComponent*                              SkullRewards;                                      // 0x15e0(0x8)
	Class AIShipItemSpawnComponent*                              MerchantRewards;                                   // 0x15e8(0x8)
	Class AIShipTelemetryComponent*                              AIShipTelemetry;                                   // 0x15f0(0x8)
	Class ChildActorComponent*                                   Wheel;                                             // 0x15f8(0x8)
	Class ChildActorComponent*                                   ShipStorageBarrel_Wood;                            // 0x1600(0x8)
	Class AIRegionComponent*                                     AIRegion;                                          // 0x1608(0x8)
	Class ChildActorComponent*                                   BP_Bell;                                           // 0x1610(0x8)
	Class ShipPointParticleComponent*                            VFX_Drips;                                         // 0x1618(0x8)
	Class BoxComponent*                                          RammingSpurZone;                                   // 0x1620(0x8)
	Class StaticMeshComponent*                                   shp_shark_hits_01_a;                               // 0x1628(0x8)
	Class ChildActorComponent*                                   ShipStorageBarrel_Cannonball3;                     // 0x1630(0x8)
	Class ChildActorComponent*                                   ShipStorageBarrel_Food;                            // 0x1638(0x8)
	Class ChildActorComponent*                                   ShipStorageBarrel_Cannonball2;                     // 0x1640(0x8)
	Class ChildActorComponent*                                   ShipStorageBarrel_Cannonball1;                     // 0x1648(0x8)
	Class ChildActorComponent*                                   CannonRight4;                                      // 0x1650(0x8)
	Class ChildActorComponent*                                   CannonRight3;                                      // 0x1658(0x8)
	Class ChildActorComponent*                                   CannonRight2;                                      // 0x1660(0x8)
	Class ChildActorComponent*                                   CannonRight1;                                      // 0x1668(0x8)
	Class ChildActorComponent*                                   CannonLeft4;                                       // 0x1670(0x8)
	Class ChildActorComponent*                                   CannonLeft3;                                       // 0x1678(0x8)
	Class ChildActorComponent*                                   CannonLeft2;                                       // 0x1680(0x8)
	Class ChildActorComponent*                                   CannonLeft1;                                       // 0x1688(0x8)
	Class ChildActorComponent*                                   LadderStbd;                                        // 0x1690(0x8)
	Class ChildActorComponent*                                   LadderPort;                                        // 0x1698(0x8)
	Class ChildActorComponent*                                   Hull;                                              // 0x16a0(0x8)
	Class ChildActorComponent*                                   AudioBoat;                                         // 0x16a8(0x8)
	bool                                                         IsAnchorLowered;                                   // 0x16b0(0x1)
	BlueprintGeneratedClass BP_shp_skeleton_01_a_C*              ShipSkeleton;                                      // 0x16b8(0x8)
	byte                                                         NewVar;                                            // 0x16c0(0x1)
	Struct AIShipSailData                                        SailData;                                          // 0x16c4(0x10)
};


}