// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x1db
class BP_CliffGenerator_C: public Actor
{
public:
	Class SplineComponent*                                       Base_Spline;                                       // 0x3d0(0x8)
	Class SceneComponent*                                        DefaultSceneRoot;                                  // 0x3d8(0x8)
	bool                                                         Use Specific Start Actor;                          // 0x3e0(0x1)
	Class StaticMesh*                                            Source Start Actor;                                // 0x3e8(0x8)
	bool                                                         Use Specific End Actor;                            // 0x3f0(0x1)
	Class StaticMesh*                                            Source End Actor;                                  // 0x3f8(0x8)
	TArray<class Source Actors*>                                 Source Actors;                                     // 0x400(0x10)
	float                                                        MaxTopSplineHeight;                                // 0x410(0x4)
	bool                                                         SpecifyNumberOfElements;                           // 0x414(0x1)
	int                                                          NumberOfElements;                                  // 0x418(0x4)
	float                                                        ObjectSpacer;                                      // 0x41c(0x4)
	float                                                        TangetWeights;                                     // 0x420(0x4)
	int                                                          Random_Seed;                                       // 0x424(0x4)
	TArray<Struct BP_CliffGenerator_Struct>                      DataArray;                                         // 0x428(0x10)
	bool                                                         Use_Deformable(SplineMesh);                        // 0x438(0x1)
	bool                                                         Instance_Meshes;                                   // 0x439(0x1)
	bool                                                         Flip_Meshes;                                       // 0x43a(0x1)
	Struct RandomStream                                          ArrayStore;                                        // 0x43c(0x8)
	float                                                        SplineRemaninderScale;                             // 0x444(0x4)
	int                                                          NumElementsNeeded;                                 // 0x448(0x4)
	Struct BP_CliffGenerator_Struct                              Default_Mesh;                                      // 0x44c(0x10)
	Struct Vector                                                BlueprintPosition;                                 // 0x45c(0xc)
	Struct Rotator                                               InverseBlueprintRotation;                          // 0x468(0xc)
	bool                                                         UseSpecifiedMeshAtIndex;                           // 0x474(0x1)
	bool                                                         LoopDataArraySize;                                 // 0x475(0x1)
	bool                                                         Collisions;                                        // 0x476(0x1)
	bool                                                         [DEBUG ] SplineNumbers;                            // 0x477(0x1)
	bool                                                         [DEBUG ] Flip Text;                                // 0x478(0x1)
	bool                                                         IsStartIndex;                                      // 0x479(0x1)
	bool                                                         IsEndIndex;                                        // 0x47a(0x1)
	Class SplineComponent*                                       GeneratedTopSpline;                                // 0x480(0x8)
	float                                                        MinTopSplineHeight;                                // 0x488(0x4)
	bool                                                         AllowTerrainToDrop;                                // 0x48c(0x1)
	bool                                                         AllowTerrainToRaise;                               // 0x48d(0x1)
	bool                                                         IgnoreTerrainForTopSpline;                         // 0x48e(0x1)
	float                                                        TerrainBlendWidth;                                 // 0x490(0x4)
	float                                                        TerrainBlendFallOff;                               // 0x494(0x4)
	float                                                        TopSplineRollAmount;                               // 0x498(0x4)
	float                                                        IntersectionAmount;                                // 0x49c(0x4)
	bool                                                         [[-----REBUILD SPLINE ----]];                      // 0x4a0(0x1)
	Class Landscape*                                             terrain_component;                                 // 0x4a8(0x8)
	bool                                                         UseDetailedTopSpline;                              // 0x4b0(0x1)
	int                                                          NumberOfDetailedSplinePoints;                      // 0x4b4(0x4)
	bool                                                         [DEBUG ] Display Intersection Names;               // 0x4b8(0x1)
	Struct FString                                               TagToIgnore;                                       // 0x4c0(0x10)
	TArray<class ActorsToIgnore*>                                ActorsToIgnore;                                    // 0x4d0(0x10)
	bool                                                         [[------DEFORM TERRAIN ------]];                   // 0x4e0(0x1)
	Struct HitResult                                             HirResult;                                         // 0x4e4(0x80)
	TArray<Struct Vector>                                        TopSplineIntersectionPoints;                       // 0x568(0x10)
	TArray<class Local_InternalActorsToIgnore*>                  Local_InternalActorsToIgnore;                      // 0x578(0x10)
	Struct LinearColor                                           TopSplineColour;                                   // 0x588(0x10)
	Struct LinearColor                                           BottomSplineColour;                                // 0x598(0x10)
	bool                                                         Is Reflected;                                      // 0x5a8(0x1)
	byte                                                         DrawDebugLines;                                    // 0x5a9(0x1)
	bool                                                         Affect Rain;                                       // 0x5aa(0x1)
};


}