// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x0
class BP_fod_ChickenMeatRaw_00_a_ItemProxy_C: public BP_ProxyIngestible_Retractable_C
{
public:
};


// Size 0x0
class BP_fod_ChickenMeatRawBite1_00_a_ItemDesc_C: public ItemDesc
{
public:
};


// Size 0x0
class BP_fod_ChickenMeatRaw_00_a_Wieldable_C: public BP_StaticWieldableIngestible_C
{
public:
};


// Size 0x18
class BP_fod_ChickenMeatRaw_00_a_ItemInfo_C: public BP_MeatItemInfo_C
{
public:
	Class MaterialManipulationSettingsComponent*                 MaterialManipulationSettings;                      // 0x568(0x8)
	Class LightWeightStatusEffectManagerComponent*               LightweightStatusEffectManager;                    // 0x570(0x8)
	Class CookableComponent*                                     Cookable;                                          // 0x578(0x8)
};


// Size 0x38
class BP_PromptActor_EmissaryRank2_AF_C: public BP_PromptActorBase_C
{
public:
	Struct PointerToUberGraphFrame                               UberGraphFrame;                                    // 0x408(0x8)
	BlueprintGeneratedClass BP_Prompt_EmissaryLevelRankChange_C* PromptCoordinator;                                 // 0x410(0x8)
	class                                                        PromptCounterAccessKey;                            // 0x418(0x8)
	class                                                        Company;                                           // 0x420(0x8)
	int                                                          ExpectedLevel;                                     // 0x428(0x4)
	TArray<Struct PrioritisedPromptWithHandle>                   Prompts;                                           // 0x430(0x10)
};


// Size 0x38
class BP_PromptActor_EmissaryRank2_GH_C: public BP_PromptActorBase_C
{
public:
	Struct PointerToUberGraphFrame                               UberGraphFrame;                                    // 0x408(0x8)
	BlueprintGeneratedClass BP_Prompt_EmissaryLevelRankChange_C* PromptCoordinator;                                 // 0x410(0x8)
	class                                                        PromptCounterAccessKey;                            // 0x418(0x8)
	class                                                        Company;                                           // 0x420(0x8)
	int                                                          ExpectedLevel;                                     // 0x428(0x4)
	TArray<Struct PrioritisedPromptWithHandle>                   Prompts;                                           // 0x430(0x10)
};


// Size 0x38
class BP_PromptActor_EmissaryRank2_MA_C: public BP_PromptActorBase_C
{
public:
	Struct PointerToUberGraphFrame                               UberGraphFrame;                                    // 0x408(0x8)
	BlueprintGeneratedClass BP_Prompt_EmissaryLevelRankChange_C* PromptCoordinator;                                 // 0x410(0x8)
	class                                                        PromptCounterAccessKey;                            // 0x418(0x8)
	class                                                        Company;                                           // 0x420(0x8)
	int                                                          ExpectedLevel;                                     // 0x428(0x4)
	TArray<Struct PrioritisedPromptWithHandle>                   Prompts;                                           // 0x430(0x10)
};


// Size 0x38
class BP_PromptActor_EmissaryRank2_OOS_C: public BP_PromptActorBase_C
{
public:
	Struct PointerToUberGraphFrame                               UberGraphFrame;                                    // 0x408(0x8)
	BlueprintGeneratedClass BP_Prompt_EmissaryLevelRankChange_C* PromptCoordinator;                                 // 0x410(0x8)
	class                                                        PromptCounterAccessKey;                            // 0x418(0x8)
	class                                                        Company;                                           // 0x420(0x8)
	int                                                          ExpectedLevel;                                     // 0x428(0x4)
	TArray<Struct PrioritisedPromptWithHandle>                   Prompts;                                           // 0x430(0x10)
};


// Size 0x38
class BP_PromptActor_EmissaryRank2_RB_C: public BP_PromptActorBase_C
{
public:
	Struct PointerToUberGraphFrame                               UberGraphFrame;                                    // 0x408(0x8)
	BlueprintGeneratedClass BP_Prompt_EmissaryLevelRankChange_C* PromptCoordinator;                                 // 0x410(0x8)
	class                                                        PromptCounterAccessKey;                            // 0x418(0x8)
	class                                                        Company;                                           // 0x420(0x8)
	int                                                          ExpectedLevel;                                     // 0x428(0x4)
	TArray<Struct PrioritisedPromptWithHandle>                   Prompts;                                           // 0x430(0x10)
};


// Size 0x3c
class BP_PromptActor_EmissaryRank5_AF_C: public BP_PromptActorBase_C
{
public:
	Struct PointerToUberGraphFrame                               UberGraphFrame;                                    // 0x408(0x8)
	BlueprintGeneratedClass BP_Prompt_EmissaryLevelRankChange_C* PromptCoordinator;                                 // 0x410(0x8)
	class                                                        PromptCounterAccessKey;                            // 0x418(0x8)
	class                                                        Company;                                           // 0x420(0x8)
	int                                                          ExpectedLevel;                                     // 0x428(0x4)
	TArray<Struct PrioritisedPromptWithHandle>                   Prompts;                                           // 0x430(0x10)
	float                                                        InitialDelay;                                      // 0x440(0x4)
};


// Size 0x3c
class BP_PromptActor_EmissaryRank5_GH_C: public BP_PromptActorBase_C
{
public:
	Struct PointerToUberGraphFrame                               UberGraphFrame;                                    // 0x408(0x8)
	BlueprintGeneratedClass BP_Prompt_EmissaryLevelRankChange_C* PromptCoordinator;                                 // 0x410(0x8)
	class                                                        PromptCounterAccessKey;                            // 0x418(0x8)
	class                                                        Company;                                           // 0x420(0x8)
	int                                                          ExpectedLevel;                                     // 0x428(0x4)
	TArray<Struct PrioritisedPromptWithHandle>                   Prompts;                                           // 0x430(0x10)
	float                                                        InitialDelay;                                      // 0x440(0x4)
};


// Size 0x3c
class BP_PromptActor_EmissaryRank5_MA_C: public BP_PromptActorBase_C
{
public:
	Struct PointerToUberGraphFrame                               UberGraphFrame;                                    // 0x408(0x8)
	BlueprintGeneratedClass BP_Prompt_EmissaryLevelRankChange_C* PromptCoordinator;                                 // 0x410(0x8)
	class                                                        PromptCounterAccessKey;                            // 0x418(0x8)
	class                                                        Company;                                           // 0x420(0x8)
	int                                                          ExpectedLevel;                                     // 0x428(0x4)
	TArray<Struct PrioritisedPromptWithHandle>                   Prompts;                                           // 0x430(0x10)
	float                                                        InitialDelay;                                      // 0x440(0x4)
};


// Size 0x3c
class BP_PromptActor_EmissaryRank5_OOS_C: public BP_PromptActorBase_C
{
public:
	Struct PointerToUberGraphFrame                               UberGraphFrame;                                    // 0x408(0x8)
	BlueprintGeneratedClass BP_Prompt_EmissaryLevelRankChange_C* PromptCoordinator;                                 // 0x410(0x8)
	class                                                        PromptCounterAccessKey;                            // 0x418(0x8)
	class                                                        Company;                                           // 0x420(0x8)
	int                                                          ExpectedLevel;                                     // 0x428(0x4)
	TArray<Struct PrioritisedPromptWithHandle>                   Prompts;                                           // 0x430(0x10)
	float                                                        InitialDelay;                                      // 0x440(0x4)
};


// Size 0x3c
class BP_PromptActor_EmissaryRank5_RB_C: public BP_PromptActorBase_C
{
public:
	Struct PointerToUberGraphFrame                               UberGraphFrame;                                    // 0x408(0x8)
	BlueprintGeneratedClass BP_Prompt_EmissaryLevelRankChange_C* PromptCoordinator;                                 // 0x410(0x8)
	class                                                        PromptCounterAccessKey;                            // 0x418(0x8)
	class                                                        Company;                                           // 0x420(0x8)
	int                                                          ExpectedLevel;                                     // 0x428(0x4)
	TArray<Struct PrioritisedPromptWithHandle>                   Prompts;                                           // 0x430(0x10)
	float                                                        InitialDelay;                                      // 0x440(0x4)
};


}