// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x1db
class BP_CliffGenerator_C: public Actor
{
public:
	Class SplineComponent*                                       None;                                              // 0x3d0(0x8)
	Class SceneComponent*                                        None;                                              // 0x3d8(0x8)
	bool                                                         None;                                              // 0x3e0(0x1)
	Class StaticMesh*                                            None;                                              // 0x3e8(0x8)
	bool                                                         None;                                              // 0x3f0(0x1)
	Class StaticMesh*                                            None;                                              // 0x3f8(0x8)
	TArray<class None*>                                          None;                                              // 0x400(0x10)
	float                                                        None;                                              // 0x410(0x4)
	bool                                                         None;                                              // 0x414(0x1)
	int                                                          None;                                              // 0x418(0x4)
	float                                                        None;                                              // 0x41c(0x4)
	float                                                        None;                                              // 0x420(0x4)
	int                                                          None;                                              // 0x424(0x4)
	TArray<Struct None>                                          None;                                              // 0x428(0x10)
	bool                                                         None;                                              // 0x438(0x1)
	bool                                                         None;                                              // 0x439(0x1)
	bool                                                         None;                                              // 0x43a(0x1)
	Struct RandomStream                                          None;                                              // 0x43c(0x8)
	float                                                        None;                                              // 0x444(0x4)
	int                                                          None;                                              // 0x448(0x4)
	Struct None                                                  None;                                              // 0x44c(0x10)
	Struct Vector                                                None;                                              // 0x45c(0xc)
	Struct Rotator                                               None;                                              // 0x468(0xc)
	bool                                                         None;                                              // 0x474(0x1)
	bool                                                         None;                                              // 0x475(0x1)
	bool                                                         None;                                              // 0x476(0x1)
	bool                                                         None;                                              // 0x477(0x1)
	bool                                                         None;                                              // 0x478(0x1)
	bool                                                         None;                                              // 0x479(0x1)
	bool                                                         None;                                              // 0x47a(0x1)
	Class SplineComponent*                                       None;                                              // 0x480(0x8)
	float                                                        None;                                              // 0x488(0x4)
	bool                                                         None;                                              // 0x48c(0x1)
	bool                                                         None;                                              // 0x48d(0x1)
	bool                                                         None;                                              // 0x48e(0x1)
	float                                                        None;                                              // 0x490(0x4)
	float                                                        None;                                              // 0x494(0x4)
	float                                                        None;                                              // 0x498(0x4)
	float                                                        None;                                              // 0x49c(0x4)
	bool                                                         None;                                              // 0x4a0(0x1)
	Class Landscape*                                             None;                                              // 0x4a8(0x8)
	bool                                                         None;                                              // 0x4b0(0x1)
	int                                                          None;                                              // 0x4b4(0x4)
	bool                                                         None;                                              // 0x4b8(0x1)
	Struct FString                                               None;                                              // 0x4c0(0x10)
	TArray<class None*>                                          None;                                              // 0x4d0(0x10)
	bool                                                         None;                                              // 0x4e0(0x1)
	Struct HitResult                                             None;                                              // 0x4e4(0x80)
	TArray<Struct None>                                          None;                                              // 0x568(0x10)
	TArray<class None*>                                          None;                                              // 0x578(0x10)
	Struct LinearColor                                           None;                                              // 0x588(0x10)
	Struct LinearColor                                           None;                                              // 0x598(0x10)
	bool                                                         None;                                              // 0x5a8(0x1)
	byte                                                         None;                                              // 0x5a9(0x1)
	bool                                                         None;                                              // 0x5aa(0x1)
};


}