// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x128
class BP_cmn_wooden_foundations_05_a_C: public Actor
{
public:
	Class StaticMeshComponent*                                   StaticMeshComponent035;                            // 0x3d0(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent034;                            // 0x3d8(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent033;                            // 0x3e0(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent032;                            // 0x3e8(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent031;                            // 0x3f0(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent030;                            // 0x3f8(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent029;                            // 0x400(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent028;                            // 0x408(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent027;                            // 0x410(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent026;                            // 0x418(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent025;                            // 0x420(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent024;                            // 0x428(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent023;                            // 0x430(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent022;                            // 0x438(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent021;                            // 0x440(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent020;                            // 0x448(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent019;                            // 0x450(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent018;                            // 0x458(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent017;                            // 0x460(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent016;                            // 0x468(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent015;                            // 0x470(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent014;                            // 0x478(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent013;                            // 0x480(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent012;                            // 0x488(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent011;                            // 0x490(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent010;                            // 0x498(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent09;                             // 0x4a0(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent08;                             // 0x4a8(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent07;                             // 0x4b0(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent06;                             // 0x4b8(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent05;                             // 0x4c0(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent04;                             // 0x4c8(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent03;                             // 0x4d0(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent02;                             // 0x4d8(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent01;                             // 0x4e0(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent0;                              // 0x4e8(0x8)
	Class SceneComponent*                                        SharedRoot;                                        // 0x4f0(0x8)
};


// Size 0x120
class BP_cmn_wooden_foundations_04_a_C: public Actor
{
public:
	Class StaticMeshComponent*                                   StaticMeshComponent034;                            // 0x3d0(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent033;                            // 0x3d8(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent032;                            // 0x3e0(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent031;                            // 0x3e8(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent030;                            // 0x3f0(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent029;                            // 0x3f8(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent028;                            // 0x400(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent027;                            // 0x408(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent026;                            // 0x410(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent025;                            // 0x418(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent024;                            // 0x420(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent023;                            // 0x428(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent022;                            // 0x430(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent021;                            // 0x438(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent020;                            // 0x440(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent019;                            // 0x448(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent018;                            // 0x450(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent017;                            // 0x458(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent016;                            // 0x460(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent015;                            // 0x468(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent014;                            // 0x470(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent013;                            // 0x478(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent012;                            // 0x480(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent011;                            // 0x488(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent010;                            // 0x490(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent09;                             // 0x498(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent08;                             // 0x4a0(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent07;                             // 0x4a8(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent06;                             // 0x4b0(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent05;                             // 0x4b8(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent04;                             // 0x4c0(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent03;                             // 0x4c8(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent02;                             // 0x4d0(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent01;                             // 0x4d8(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent0;                              // 0x4e0(0x8)
	Class SceneComponent*                                        SharedRoot;                                        // 0x4e8(0x8)
};


// Size 0xc0
class BP_cmn_wooden_foundations_03_a_C: public Actor
{
public:
	Class StaticMeshComponent*                                   StaticMeshComponent022;                            // 0x3d0(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent021;                            // 0x3d8(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent020;                            // 0x3e0(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent019;                            // 0x3e8(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent018;                            // 0x3f0(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent017;                            // 0x3f8(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent016;                            // 0x400(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent015;                            // 0x408(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent014;                            // 0x410(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent013;                            // 0x418(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent012;                            // 0x420(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent011;                            // 0x428(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent010;                            // 0x430(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent09;                             // 0x438(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent08;                             // 0x440(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent07;                             // 0x448(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent06;                             // 0x450(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent05;                             // 0x458(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent04;                             // 0x460(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent03;                             // 0x468(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent02;                             // 0x470(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent01;                             // 0x478(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent0;                              // 0x480(0x8)
	Class SceneComponent*                                        SharedRoot;                                        // 0x488(0x8)
};


// Size 0x128
class BP_cmn_wooden_foundations_02_a_C: public Actor
{
public:
	Class StaticMeshComponent*                                   StaticMeshComponent035;                            // 0x3d0(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent034;                            // 0x3d8(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent033;                            // 0x3e0(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent032;                            // 0x3e8(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent031;                            // 0x3f0(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent030;                            // 0x3f8(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent029;                            // 0x400(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent028;                            // 0x408(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent027;                            // 0x410(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent026;                            // 0x418(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent025;                            // 0x420(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent024;                            // 0x428(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent023;                            // 0x430(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent022;                            // 0x438(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent021;                            // 0x440(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent020;                            // 0x448(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent019;                            // 0x450(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent018;                            // 0x458(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent017;                            // 0x460(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent016;                            // 0x468(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent015;                            // 0x470(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent014;                            // 0x478(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent013;                            // 0x480(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent012;                            // 0x488(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent011;                            // 0x490(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent010;                            // 0x498(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent09;                             // 0x4a0(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent08;                             // 0x4a8(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent07;                             // 0x4b0(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent06;                             // 0x4b8(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent05;                             // 0x4c0(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent04;                             // 0x4c8(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent03;                             // 0x4d0(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent02;                             // 0x4d8(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent01;                             // 0x4e0(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent0;                              // 0x4e8(0x8)
	Class SceneComponent*                                        SharedRoot;                                        // 0x4f0(0x8)
};


}