// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x238
class BP_cls_shop_bsp_01_a_C: public Actor
{
public:
	Class WorldLocationPopUpComponent*                           WorldLocationPopUp;                                // 0x3d0(0x8)
	Class StaticMeshComponent*                                   bld_cls_shop_mannequin_01_a1;                      // 0x3d8(0x8)
	Class StaticMeshComponent*                                   bld_cls_shop_mannequin_01_a;                       // 0x3e0(0x8)
	Class PetHangoutSpotComponent*                               PetHangoutSpot;                                    // 0x3e8(0x8)
	Class StaticMeshComponent*                                   bsp_cls_shop_dressing_01_b;                        // 0x3f0(0x8)
	Class BoxComponent*                                          Collision_02;                                      // 0x3f8(0x8)
	Class BoxComponent*                                          Collision_01;                                      // 0x400(0x8)
	Class StaticMeshComponent*                                   bsp_cls_shop_dressing_01_a;                        // 0x408(0x8)
	Class SpotLightComponent*                                    SpotLight8;                                        // 0x410(0x8)
	Class SpotLightComponent*                                    SpotLight7;                                        // 0x418(0x8)
	Class ChildActorComponent*                                   BP_IslandVanityChest;                              // 0x420(0x8)
	Class StaticMeshComponent*                                   StaticMesh7;                                       // 0x428(0x8)
	Class ChildActorComponent*                                   BP_IslandStorageBarrel_Outpost3;                   // 0x430(0x8)
	Class ChildActorComponent*                                   BP_IslandStorageBarrel_Outpost2;                   // 0x438(0x8)
	Class ChildActorComponent*                                   BP_IslandStorageBarrel_Outpost1;                   // 0x440(0x8)
	Class ChildActorComponent*                                   BP_IslandClothingChest;                            // 0x448(0x8)
	Class ChildActorComponent*                                   ChildActor1;                                       // 0x450(0x8)
	Class ChildActorComponent*                                   ChildActor;                                        // 0x458(0x8)
	Class ChildActorComponent*                                   wsp_bottle_burner;                                 // 0x460(0x8)
	Class StaticMeshComponent*                                   NoRain Volume5;                                    // 0x468(0x8)
	Class StaticMeshComponent*                                   NoRain Volume4;                                    // 0x470(0x8)
	Class StaticMeshComponent*                                   NoRain Volume3;                                    // 0x478(0x8)
	Class StaticMeshComponent*                                   NoRain Volume2;                                    // 0x480(0x8)
	Class StaticMeshComponent*                                   NoRain Volume;                                     // 0x488(0x8)
	Class SpotLightComponent*                                    SpotLight6;                                        // 0x490(0x8)
	Class SpotLightComponent*                                    SpotLight5;                                        // 0x498(0x8)
	Class SpotLightComponent*                                    SpotLight4;                                        // 0x4a0(0x8)
	Class SpotLightComponent*                                    SpotLight3;                                        // 0x4a8(0x8)
	Class SpotLightComponent*                                    SpotLight2;                                        // 0x4b0(0x8)
	Class SpotLightComponent*                                    SpotLight1;                                        // 0x4b8(0x8)
	Class SpotLightComponent*                                    SpotLight;                                         // 0x4c0(0x8)
	Class PointLightComponent*                                   PointLight;                                        // 0x4c8(0x8)
	Class PostProcessComponent*                                  PostProcess;                                       // 0x4d0(0x8)
	Class BoxComponent*                                          Box;                                               // 0x4d8(0x8)
	Class ChildActorComponent*                                   AudioSpace;                                        // 0x4e0(0x8)
	Class StaticMeshComponent*                                   StaticMesh14;                                      // 0x4e8(0x8)
	Class StaticMeshComponent*                                   cmn_moneybag_01_a;                                 // 0x4f0(0x8)
	Class StaticMeshComponent*                                   StaticMesh13;                                      // 0x4f8(0x8)
	Class StaticMeshComponent*                                   StaticMesh12;                                      // 0x500(0x8)
	Class StaticMeshComponent*                                   StaticMesh11;                                      // 0x508(0x8)
	Class StaticMeshComponent*                                   StaticMesh10;                                      // 0x510(0x8)
	Class StaticMeshComponent*                                   StaticMesh9;                                       // 0x518(0x8)
	Class StaticMeshComponent*                                   StaticMesh8;                                       // 0x520(0x8)
	Class StaticMeshComponent*                                   cmn_barrel_debris_02_a;                            // 0x528(0x8)
	Class StaticMeshComponent*                                   cmn_barrel_debris_03_a;                            // 0x530(0x8)
	Class StaticMeshComponent*                                   cmn_barrel_debris_01_a;                            // 0x538(0x8)
	Class StaticMeshComponent*                                   bld_shop_drapes_02_a;                              // 0x540(0x8)
	Class StaticMeshComponent*                                   bld_cls_shop_hanging_cloth_03_a;                   // 0x548(0x8)
	Class StaticMeshComponent*                                   bld_enc_shop_rug_01_a;                             // 0x550(0x8)
	Class StaticMeshComponent*                                   bld_cls_shop_hanging_rope_01_a;                    // 0x558(0x8)
	Class StaticMeshComponent*                                   bld_cls_shop_hanging_cloth_02_a;                   // 0x560(0x8)
	Class StaticMeshComponent*                                   bld_cls_shp_dye_pot_lid_01_c;                      // 0x568(0x8)
	Class StaticMeshComponent*                                   bld_cls_shp_dye_pot_lid_01_b;                      // 0x570(0x8)
	Class StaticMeshComponent*                                   bld_cls_shp_dye_pot_01_c;                          // 0x578(0x8)
	Class StaticMeshComponent*                                   bld_cls_shp_dye_pot_01_b;                          // 0x580(0x8)
	Class StaticMeshComponent*                                   bld_shop_drapes_01_a;                              // 0x588(0x8)
	Class StaticMeshComponent*                                   bld_shop_rug_01_a;                                 // 0x590(0x8)
	Class StaticMeshComponent*                                   bld_shop_table_01_a;                               // 0x598(0x8)
	Class StaticMeshComponent*                                   bld_cls_shp_sign_01_a;                             // 0x5a0(0x8)
	Class StaticMeshComponent*                                   bld_cls_shp_porch_mat_01_a;                        // 0x5a8(0x8)
	Class StaticMeshComponent*                                   bld_cls_shp_stairs_01_a;                           // 0x5b0(0x8)
	Class StaticMeshComponent*                                   bld_cls_shop_door_01_a;                            // 0x5b8(0x8)
	Class StaticMeshComponent*                                   bld_cls_shop_window_01_a2;                         // 0x5c0(0x8)
	Class StaticMeshComponent*                                   bld_cls_shop_window_01_a1;                         // 0x5c8(0x8)
	Class StaticMeshComponent*                                   bld_cls_shop_window_01_a;                          // 0x5d0(0x8)
	Class StaticMeshComponent*                                   bld_cls_shp_clothes_lines_01_a;                    // 0x5d8(0x8)
	Class StaticMeshComponent*                                   bld_cls_shp_hanging_cloth_01_a;                    // 0x5e0(0x8)
	Class StaticMeshComponent*                                   bld_cls_shp_side_roof_01_a;                        // 0x5e8(0x8)
	Class StaticMeshComponent*                                   bld_cls_shp_main_roof_01_a;                        // 0x5f0(0x8)
	Class StaticMeshComponent*                                   bld_cls_shop_01_a;                                 // 0x5f8(0x8)
	Class SceneComponent*                                        DefaultSceneRoot;                                  // 0x600(0x8)
};


}