// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0xf0
class BP_CoralFortress_WeatherZone_C: public Actor
{
public:
	Struct PointerToUberGraphFrame                               None;                                              // 0x3d0(0x8)
	Class ExplosionComponent*                                    None;                                              // 0x3d8(0x8)
	Class LightningManagerComponent*                             None;                                              // 0x3e0(0x8)
	Class LightningComponent*                                    None;                                              // 0x3e8(0x8)
	Class CapsuleComponent*                                      None;                                              // 0x3f0(0x8)
	Class AtmosphericPressureZoneComponent*                      None;                                              // 0x3f8(0x8)
	Class BlendedPostProcessingRainZoneComponent*                None;                                              // 0x400(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x408(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x410(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x418(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x420(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x428(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x430(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x438(0x8)
	Class SceneComponent*                                        None;                                              // 0x440(0x8)
	Class SceneComponent*                                        None;                                              // 0x448(0x8)
	float                                                        None;                                              // 0x450(0x4)
	byte                                                         None;                                              // 0x454(0x1)
	Class TimelineComponent*                                     None;                                              // 0x458(0x8)
	TArray<class None*>                                          None;                                              // 0x460(0x10)
	float                                                        None;                                              // 0x470(0x4)
	Struct WwiseEmitterCreationParams                            None;                                              // 0x478(0x28)
	Struct WwiseEmitter                                          None;                                              // 0x4a0(0x20)
};


}