// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x68
class BP_Crest_C: public Crest
{
public:
	Struct PointerToUberGraphFrame                               UberGraphFrame;                                    // 0x3f0(0x8)
	Class CanvasRenderTarget2D*                                  TextCanvasRenderTarget;                            // 0x3f8(0x8)
	Class CanvasRenderTarget2D*                                  BlurCanvasRenderTarget;                            // 0x400(0x8)
	Class CanvasRenderTarget2D*                                  BevelCanvasRenderTarget;                           // 0x408(0x8)
	Class Material*                                              BlurCanvasMaterial;                                // 0x410(0x8)
	Class Material*                                              BevelCanvasMaterial;                               // 0x418(0x8)
	Class MaterialInstanceDynamic*                               DynamicBlurCanvasMaterial;                         // 0x420(0x8)
	Class MaterialInstanceDynamic*                               DynamicBevelCanvasMaterial;                        // 0x428(0x8)
	Class MaterialInstanceDynamic*                               CrestDynamicMaterial;                              // 0x430(0x8)
	Struct FString                                               ShipName;                                          // 0x438(0x10)
	int                                                          CanvasWidth;                                       // 0x448(0x4)
	int                                                          CanvasHeight;                                      // 0x44c(0x4)
	Class Font*                                                  Font;                                              // 0x450(0x8)
};


}