// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x40
class BP_CastawayCamp_AudioLayer_C: public Actor
{
public:
	Struct PointerToUberGraphFrame                               None;                                              // 0x3d0(0x8)
	Class WwiseEmitterComponent*                                 None;                                              // 0x3d8(0x8)
	Class WwiseEmitterComponent*                                 None;                                              // 0x3e0(0x8)
	Class WwiseEmitterComponent*                                 None;                                              // 0x3e8(0x8)
	Class WwiseEvent*                                            None;                                              // 0x3f0(0x8)
	Class WwiseEvent*                                            None;                                              // 0x3f8(0x8)
	Class WwiseEvent*                                            None;                                              // 0x400(0x8)
	Class WwiseEvent*                                            None;                                              // 0x408(0x8)
};


}