// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x9c
class BP_DTSD_Beacon_C: public BP_NonRotatableSignalCloud_C
{
public:
	Struct PointerToUberGraphFrame                               UberGraphFrame;                                    // 0x4b8(0x8)
	Class ParticleSystemComponent*                               VFX_Summon_Meg_Ritual_Table_Beacon_01;             // 0x4c0(0x8)
	Class StaticMeshComponent*                                   PortalRings;                                       // 0x4c8(0x8)
	Class ParticleSystemComponent*                               PortalAmbience02;                                  // 0x4d0(0x8)
	Class ParticleSystemComponent*                               PortalAmbience01;                                  // 0x4d8(0x8)
	Class StaticMeshComponent*                                   Lightning01;                                       // 0x4e0(0x8)
	Class StaticMeshComponent*                                   Lightning03;                                       // 0x4e8(0x8)
	Class StaticMeshComponent*                                   Lightning02;                                       // 0x4f0(0x8)
	Class StaticMeshComponent*                                   SmokeBeam;                                         // 0x4f8(0x8)
	Class StaticMeshComponent*                                   PortalBeam;                                        // 0x500(0x8)
	Class StaticMeshComponent*                                   Portal;                                            // 0x508(0x8)
	float                                                        FadeInTimeline_CloudAlpha_599CCE4D47A1C7FB1A21DEA26382D299; // 0x510(0x4)
	float                                                        FadeInTimeline_Alpha_599CCE4D47A1C7FB1A21DEA26382D299; // 0x514(0x4)
	byte                                                         FadeInTimeline__Direction_599CCE4D47A1C7FB1A21DEA26382D299; // 0x518(0x1)
	Class TimelineComponent*                                     FadeInTimeline;                                    // 0x520(0x8)
	Class MaterialInstanceDynamic*                               BeamMat;                                           // 0x528(0x8)
	Class MaterialInstanceDynamic*                               PortalMat;                                         // 0x530(0x8)
	Class MaterialInstanceDynamic*                               CloudMat;                                          // 0x538(0x8)
	TArray<class LightningMeshes*>                               LightningMeshes;                                   // 0x540(0x10)
	bool                                                         ShowInEditor;                                      // 0x550(0x1)
	bool                                                         BattleComplete?;                                   // 0x551(0x1)
	bool                                                         BattleStarted?;                                    // 0x552(0x1)
	bool                                                         RitualStarted?;                                    // 0x553(0x1)
};


}