// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x60
class BP_DynamicDensityFogVolume_C: public FogVolume
{
public:
	Struct PointerToUberGraphFrame                               None;                                              // 0x3e0(0x8)
	float                                                        None;                                              // 0x3e8(0x4)
	byte                                                         None;                                              // 0x3ec(0x1)
	Class TimelineComponent*                                     None;                                              // 0x3f0(0x8)
	Class MaterialInstanceDynamic*                               None;                                              // 0x3f8(0x8)
	Class CanvasRenderTarget2D*                                  None;                                              // 0x400(0x8)
	int                                                          None;                                              // 0x408(0x4)
	int                                                          None;                                              // 0x40c(0x4)
	TArray<class None*>                                          None;                                              // 0x410(0x10)
	int                                                          None;                                              // 0x420(0x4)
	int                                                          None;                                              // 0x424(0x4)
	bool                                                         None;                                              // 0x428(0x1)
	TArray<Struct None>                                          None;                                              // 0x430(0x10)
};


}