// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x3d
class BP_DecalGlow_Longer_C: public LandmarkReactionActor
{
public:
	Struct PointerToUberGraphFrame                               None;                                              // 0x3d8(0x8)
	Class WwiseEmitterComponent*                                 None;                                              // 0x3e0(0x8)
	Class SceneComponent*                                        None;                                              // 0x3e8(0x8)
	TArray<class None*>                                          None;                                              // 0x3f0(0x10)
	float                                                        None;                                              // 0x400(0x4)
	BlueprintGeneratedClass None*                                None;                                              // 0x408(0x8)
	float                                                        None;                                              // 0x410(0x4)
	bool                                                         None;                                              // 0x414(0x1)
};


}