// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0xc0
class BP_EmissaryTable_Reapers_01_C: public None
{
public:
	Class ParticleSystemComponent*                               None;                                              // 0x640(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x648(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x650(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x658(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x660(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x668(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x670(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x678(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x680(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x688(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x690(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x698(0x8)
	Class EmissaryShipAffiliationTrackerComponent*               None;                                              // 0x6a0(0x8)
	Class PointLightComponent*                                   None;                                              // 0x6a8(0x8)
	Class PointLightComponent*                                   None;                                              // 0x6b0(0x8)
	Class ParticleSystemComponent*                               None;                                              // 0x6b8(0x8)
	Class ParticleSystemComponent*                               None;                                              // 0x6c0(0x8)
	Class ParticleSystemComponent*                               None;                                              // 0x6c8(0x8)
	Class ParticleSystemComponent*                               None;                                              // 0x6d0(0x8)
	Class ParticleSystemComponent*                               None;                                              // 0x6d8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x6e0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x6e8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x6f0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x6f8(0x8)
};


}