// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x10
class BP_ForceSpot_Rowboat_Launch_C: public ForceSpot
{
public:
	Class Texture*                                               CallFunc_GetTextureForFlameOfFateType_ReturnValue; // 0x1c8(0x8)
	bool                                                         CallFunc_IsValid_ReturnValue;                      // 0x1d0(0x1)
	int                                                          Temp_int_Variable14;                               // 0x1d4(0x4)
	int                                                          CallFunc_Add_IntInt_ReturnValue14;                 // 0x1d8(0x4)
	Class MaterialInstanceDynamic*                               CallFunc_Array_Get_Item5;                          // 0x1e0(0x8)
	bool                                                         CallFunc_Less_IntInt_ReturnValue4;                 // 0x1e8(0x1)
	Struct LinearColor                                           CallFunc_GetColourForFlameOfFateType_ReturnValue5; // 0x1ec(0x10)
	Struct LinearColor                                           CallFunc_GetColourForFlameOfFateType_ReturnValue6; // 0x1fc(0x10)
	Struct LinearColor                                           CallFunc_GetColourForFlameOfFateType_ReturnValue7; // 0x20c(0x10)
	int                                                          Temp_int_Variable15;                               // 0x21c(0x4)
	float                                                        CallFunc_GetGameTimeInSeconds_ReturnValue2;        // 0x220(0x4)
	int                                                          CallFunc_Add_IntInt_ReturnValue15;                 // 0x224(0x4)
	int                                                          CallFunc_Array_Length_ReturnValue10;               // 0x228(0x4)
	Class MaterialInstanceDynamic*                               CallFunc_Array_Get_Item6;                          // 0x230(0x8)
	int                                                          CallFunc_Array_Length_ReturnValue11;               // 0x238(0x4)
	Class MaterialInstanceDynamic*                               CallFunc_Array_Get_Item7;                          // 0x240(0x8)
	bool                                                         CallFunc_Less_IntInt_ReturnValue5;                 // 0x248(0x1)
	int                                                          CallFunc_Array_Length_ReturnValue12;               // 0x24c(0x4)
	bool                                                         CallFunc_Less_IntInt_ReturnValue6;                 // 0x250(0x1)
	Class MaterialInstanceDynamic*                               CallFunc_Array_Get_Item8;                          // 0x258(0x8)
	int                                                          CallFunc_Array_Length_ReturnValue13;               // 0x260(0x4)
	Class MaterialInstanceDynamic*                               CallFunc_Array_Get_Item9;                          // 0x268(0x8)
	bool                                                         CallFunc_Less_IntInt_ReturnValue7;                 // 0x270(0x1)
	Struct LinearColor                                           CallFunc_K2_GetVectorParameterValue_ReturnValue3;  // 0x274(0x10)
	int                                                          Temp_int_Variable16;                               // 0x284(0x4)
	Struct LinearColor                                           CallFunc_GetColourForFlameOfFateType_ReturnValue8; // 0x288(0x10)
	int                                                          CallFunc_Add_IntInt_ReturnValue16;                 // 0x298(0x4)
	Class MaterialInstanceDynamic*                               CallFunc_Array_Get_Item10;                         // 0x2a0(0x8)
	bool                                                         CallFunc_Less_IntInt_ReturnValue8;                 // 0x2a8(0x1)
	Class Texture*                                               CallFunc_GetTextureForFlameOfFateType_ReturnValue2; // 0x2b0(0x8)
	bool                                                         CallFunc_IsValid_ReturnValue2;                     // 0x2b8(0x1)
	Struct LinearColor                                           CallFunc_GetColourForFlameOfFateType_ReturnValue9; // 0x2bc(0x10)
	Struct LinearColor                                           CallFunc_GetColourForFlameOfFateType_ReturnValue10; // 0x2cc(0x10)
	Struct LinearColor                                           CallFunc_GetColourForFlameOfFateType_ReturnValue11; // 0x2dc(0x10)
	float                                                        CallFunc_GetGameTimeInSeconds_ReturnValue3;        // 0x2ec(0x4)
	float                                                        CallFunc_SelectFloat_ReturnValue;                  // 0x2f0(0x4)
	float                                                        CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x2f4(0x4)
	Class MaterialInstanceDynamic*                               CallFunc_Array_Get_Item11;                         // 0x2f8(0x8)
	Class MaterialInstanceDynamic*                               CallFunc_Array_Get_Item12;                         // 0x300(0x8)
	int                                                          CallFunc_Array_Length_ReturnValue14;               // 0x308(0x4)
	bool                                                         CallFunc_Less_IntInt_ReturnValue9;                 // 0x30c(0x1)
	int                                                          CallFunc_Array_Length_ReturnValue15;               // 0x310(0x4)
	bool                                                         CallFunc_Less_IntInt_ReturnValue10;                // 0x314(0x1)
	Class MaterialInstanceDynamic*                               CallFunc_Array_Get_Item13;                         // 0x318(0x8)
	int                                                          CallFunc_Array_Length_ReturnValue16;               // 0x320(0x4)
	Class MaterialInstanceDynamic*                               CallFunc_Array_Get_Item14;                         // 0x328(0x8)
	bool                                                         CallFunc_Less_IntInt_ReturnValue11;                // 0x330(0x1)
	int                                                          CallFunc_Array_Length_ReturnValue17;               // 0x334(0x4)
	bool                                                         CallFunc_Less_IntInt_ReturnValue12;                // 0x338(0x1)
	Class MaterialInstanceDynamic*                               CallFunc_Array_Get_Item15;                         // 0x340(0x8)
	Struct LinearColor                                           CallFunc_K2_GetVectorParameterValue_ReturnValue4;  // 0x348(0x10)
	int                                                          Temp_int_Variable17;                               // 0x358(0x4)
	int                                                          CallFunc_Add_IntInt_ReturnValue17;                 // 0x35c(0x4)
	Class MaterialInstanceDynamic*                               CallFunc_Array_Get_Item16;                         // 0x360(0x8)
	bool                                                         CallFunc_Less_IntInt_ReturnValue13;                // 0x368(0x1)
	Struct LinearColor                                           CallFunc_GetColourForFlameOfFateType_ReturnValue12; // 0x36c(0x10)
	Class Texture*                                               CallFunc_GetTextureForFlameOfFateType_ReturnValue3; // 0x380(0x8)
	int                                                          Temp_int_Variable18;                               // 0x388(0x4)
	bool                                                         CallFunc_IsValid_ReturnValue3;                     // 0x38c(0x1)
	int                                                          CallFunc_Add_IntInt_ReturnValue18;                 // 0x390(0x4)
	Class MaterialInstanceDynamic*                               CallFunc_Array_Get_Item17;                         // 0x398(0x8)
	bool                                                         CallFunc_Less_IntInt_ReturnValue14;                // 0x3a0(0x1)
	Struct LinearColor                                           CallFunc_GetColourForFlameOfFateType_ReturnValue13; // 0x3a4(0x10)
	Struct LinearColor                                           CallFunc_GetColourForFlameOfFateType_ReturnValue14; // 0x3b4(0x10)
	Struct LinearColor                                           CallFunc_GetColourForFlameOfFateType_ReturnValue15; // 0x3c4(0x10)
	float                                                        CallFunc_GetGameTimeInSeconds_ReturnValue4;        // 0x3d4(0x4)
	float                                                        CallFunc_SelectFloat_ReturnValue2;                 // 0x3d8(0x4)
	int                                                          Temp_int_Variable19;                               // 0x3dc(0x4)
	float                                                        CallFunc_Subtract_FloatFloat_ReturnValue2;         // 0x3e0(0x4)
	int                                                          CallFunc_Add_IntInt_ReturnValue19;                 // 0x3e4(0x4)
	Class MaterialInstanceDynamic*                               CallFunc_Array_Get_Item18;                         // 0x3e8(0x8)
	bool                                                         CallFunc_Less_IntInt_ReturnValue15;                // 0x3f0(0x1)
	Class MaterialInstanceDynamic*                               CallFunc_Array_Get_Item19;                         // 0x3f8(0x8)
	Class MaterialInstanceDynamic*                               CallFunc_Array_Get_Item20;                         // 0x400(0x8)
	int                                                          CallFunc_Array_Length_ReturnValue18;               // 0x408(0x4)
	bool                                                         CallFunc_Less_IntInt_ReturnValue16;                // 0x40c(0x1)
	int                                                          CallFunc_Array_Length_ReturnValue19;               // 0x410(0x4)
	bool                                                         CallFunc_Less_IntInt_ReturnValue17;                // 0x414(0x1)
	Class MaterialInstanceDynamic*                               CallFunc_Array_Get_Item21;                         // 0x418(0x8)
	int                                                          CallFunc_Array_Length_ReturnValue20;               // 0x420(0x4)
	Class MaterialInstanceDynamic*                               CallFunc_Array_Get_Item22;                         // 0x428(0x8)
	bool                                                         CallFunc_Less_IntInt_ReturnValue18;                // 0x430(0x1)
	int                                                          CallFunc_Array_Length_ReturnValue21;               // 0x434(0x4)
	bool                                                         CallFunc_Less_IntInt_ReturnValue19;                // 0x438(0x1)
	Class MaterialInstanceDynamic*                               CallFunc_Array_Get_Item23;                         // 0x440(0x8)
	Struct LinearColor                                           CallFunc_K2_GetVectorParameterValue_ReturnValue5;  // 0x448(0x10)
	Struct LinearColor                                           CallFunc_GetColourForFlameOfFateType_ReturnValue16; // 0x458(0x10)
	Class Texture*                                               CallFunc_GetTextureForFlameOfFateType_ReturnValue4; // 0x468(0x8)
	bool                                                         CallFunc_IsValid_ReturnValue4;                     // 0x470(0x1)
	Class MaterialInstanceDynamic*                               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x478(0x8)
	int                                                          Temp_int_Variable20;                               // 0x480(0x4)
	int                                                          CallFunc_Add_IntInt_ReturnValue20;                 // 0x484(0x4)
	Class MaterialInstanceDynamic*                               CallFunc_CreateDynamicMaterialInstance_ReturnValue2; // 0x488(0x8)
	Class MaterialInstanceDynamic*                               CallFunc_Array_Get_Item24;                         // 0x490(0x8)
	bool                                                         CallFunc_Less_IntInt_ReturnValue20;                // 0x498(0x1)
	float                                                        CallFunc_GetGameTimeInSeconds_ReturnValue5;        // 0x49c(0x4)
	float                                                        CallFunc_Add_FloatFloat_ReturnValue;               // 0x4a0(0x4)
	bool                                                         K2Node_Event_SkipFlameColourTransition;            // 0x4a4(0x1)
	Struct LinearColor                                           K2Node_MakeStruct_LinearColor;                     // 0x4a8(0x10)
	float                                                        CallFunc_SelectFloat_ReturnValue3;                 // 0x4b8(0x4)
	float                                                        CallFunc_Subtract_FloatFloat_ReturnValue3;         // 0x4bc(0x4)
	bool                                                         K2Node_Event_WantChangeAnimation;                  // 0x4c0(0x1)
	int                                                          Temp_int_Variable21;                               // 0x4c4(0x4)
	float                                                        CallFunc_SelectFloat_ReturnValue4;                 // 0x4c8(0x4)
	int                                                          CallFunc_Add_IntInt_ReturnValue21;                 // 0x4cc(0x4)
	float                                                        CallFunc_Subtract_FloatFloat_ReturnValue4;         // 0x4d0(0x4)
	Class MaterialInstanceDynamic*                               CallFunc_Array_Get_Item25;                         // 0x4d8(0x8)
	bool                                                         CallFunc_Less_IntInt_ReturnValue21;                // 0x4e0(0x1)
};


}