// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x120
class BP_FishCreature_C: public Actor
{
public:
	Class SceneComponent*                                        None;                                              // 0x3d0(0x8)
	byte                                                         None;                                              // 0x3d8(0x1)
	byte                                                         None;                                              // 0x3d9(0x1)
	float                                                        None;                                              // 0x3dc(0x4)
	Class StaticMeshComponent*                                   None;                                              // 0x3e0(0x8)
	Class MaterialInstanceDynamic*                               None;                                              // 0x3e8(0x8)
	TArray<class None*>                                          None;                                              // 0x3f0(0x10)
	float                                                        None;                                              // 0x400(0x4)
	float                                                        None;                                              // 0x404(0x4)
	float                                                        None;                                              // 0x408(0x4)
	byte                                                         None;                                              // 0x40c(0x1)
	float                                                        None;                                              // 0x410(0x4)
	float                                                        None;                                              // 0x414(0x4)
	float                                                        None;                                              // 0x418(0x4)
	float                                                        None;                                              // 0x41c(0x4)
	Struct Vector2D                                              None;                                              // 0x420(0x8)
	float                                                        None;                                              // 0x428(0x4)
	float                                                        None;                                              // 0x42c(0x4)
	Struct Vector2D                                              None;                                              // 0x430(0x8)
	float                                                        None;                                              // 0x438(0x4)
	float                                                        None;                                              // 0x43c(0x4)
	float                                                        None;                                              // 0x440(0x4)
	float                                                        None;                                              // 0x444(0x4)
	TArray<Assetclass None>                                      None;                                              // 0x448(0x10)
	TArray<Assetclass None>                                      None;                                              // 0x458(0x10)
	TArray<Assetclass >                                          None;                                              // 0x468(0x10)
	float                                                        None;                                              // 0x478(0x4)
	float                                                        None;                                              // 0x47c(0x4)
	float                                                        None;                                              // 0x480(0x4)
	Struct Vector                                                None;                                              // 0x484(0xc)
	TArray<Assetclass None>                                      None;                                              // 0x490(0x10)
	float                                                        None;                                              // 0x4a0(0x4)
	TArray<Assetclass AnimNotify_WwiseSound>                     None;                                              // 0x4a8(0x10)
	float                                                        None;                                              // 0x4b8(0x4)
	TArray<Assetclass AnimNotify_WwiseSound>                     None;                                              // 0x4c0(0x10)
	TArray<Assetclass /Game/Models/Environments/Buildings/bld_shop_wood_box_02_a> None;                                              // 0x4d0(0x10)
	Struct LinearColor                                           None;                                              // 0x4e0(0x10)
};


}