// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x90
class BP_ItemPreview_C: public ItemPreviewActor
{
public:
	Struct PointerToUberGraphFrame                               None;                                              // 0x590(0x8)
	Class ArrowComponent*                                        None;                                              // 0x598(0x8)
	Class ArrowComponent*                                        None;                                              // 0x5a0(0x8)
	Class ArrowComponent*                                        None;                                              // 0x5a8(0x8)
	Class ArrowComponent*                                        None;                                              // 0x5b0(0x8)
	Class BillboardComponent*                                    None;                                              // 0x5b8(0x8)
	Class ArrowComponent*                                        None;                                              // 0x5c0(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x5c8(0x8)
	Class SkeletalMeshComponent*                                 None;                                              // 0x5d0(0x8)
	Class SkeletalMeshComponent*                                 None;                                              // 0x5d8(0x8)
	Class CameraComponent*                                       None;                                              // 0x5e0(0x8)
	Class SceneComponent*                                        None;                                              // 0x5e8(0x8)
};


}