// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x60
class BP_Innkeeper_C: public NPC
{
public:
	Struct PointerToUberGraphFrame                               None;                                              // 0x668(0x8)
	Class CargoRunParticipantComponent*                          None;                                              // 0x670(0x8)
	Class CapsuleComponent*                                      None;                                              // 0x678(0x8)
	Class NPCDialogComponent*                                    None;                                              // 0x680(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x688(0x8)
	Class AnimNotifyWwiseEmitterComponent*                       None;                                              // 0x690(0x8)
	Class WwiseEvent*                                            None;                                              // 0x698(0x8)
	Class WwiseEvent*                                            None;                                              // 0x6a0(0x8)
	Struct WwiseEmitter                                          None;                                              // 0x6a8(0x20)
};


}