// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x60
class BP_Innkeeper_C: public NPC
{
public:
	Struct PointerToUberGraphFrame                               UberGraphFrame;                                    // 0x668(0x8)
	Class CargoRunParticipantComponent*                          CargoRunParticipant;                               // 0x670(0x8)
	Class CapsuleComponent*                                      SolidHits;                                         // 0x678(0x8)
	Class NPCDialogComponent*                                    NPCDialog;                                         // 0x680(0x8)
	Class StaticMeshComponent*                                   StaticMesh;                                        // 0x688(0x8)
	Class AnimNotifyWwiseEmitterComponent*                       AnimNotifyWwiseEmitter;                            // 0x690(0x8)
	Class WwiseEvent*                                            SFX_IdleLoopPlay;                                  // 0x698(0x8)
	Class WwiseEvent*                                            SFX_IdleLoopStop;                                  // 0x6a0(0x8)
	Struct WwiseEmitter                                          InnkeeperEmitter;                                  // 0x6a8(0x20)
};


}