// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size -0x3f800001
class BP_KrakenShipAnimatedTentacle_C: public MaterialInstanceDynamic
{
public:
	Class FixedIntentComponent*                                  CurseIntentComponent;                              // 0x538(0x8)
	Class WwiseObjectPoolWrapper*                                ManipulatorAudioPool;                              // 0x540(0x8)
	Struct SocketId                                              MastSocketId;                                      // 0x548(0x20)
	Class SailManipulatorAudioParams*                            AudioParams;                                       // 0x568(0x8)
	Class SceneComponent*                                        MastSocketSceneComponent;                          // 0x570(0x8)
	Struct WwiseEmitter                                          AudioEmitter;                                      // 0x578(0x20)
	Class Mast*                                                  BoundMast;                                         // 0x798(0x8)
	Class Mast*                                                  PendingBoundMast;                                  // 0x7a0(0x8)
	bool                                                         Locked;                                            // 0x7a8(0x1)
	Class MobileInstancedStaticMeshComponent*                    TopMeshInstanceComponent;                          // 0x7b0(0x8)
};


}