// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x40
class BP_LargeShip_QuestTable_C: public VoyageTable
{
public:
	Class ChildActorComponent*                                   CancelAdventure;                                   // 0x770(0x8)
	Class ChildActorComponent*                                   PlayerBuiredItemsMapBundleInteractionPoint;        // 0x778(0x8)
	Class ChildActorComponent*                                   CancelTale;                                        // 0x780(0x8)
	Class ChildActorComponent*                                   CancelVoyage;                                      // 0x788(0x8)
	Class ChildActorComponent*                                   VoyageSelectionSlot4;                              // 0x790(0x8)
	Class ChildActorComponent*                                   VoyageSelectionSlot3;                              // 0x798(0x8)
	Class ChildActorComponent*                                   VoyageSelectionSlot2;                              // 0x7a0(0x8)
	Class ChildActorComponent*                                   VoyageSelectionSlot1;                              // 0x7a8(0x8)
};


}