// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x30
class BP_MediumShip_StandardHull_Art_C: public Actor
{
public:
	Class HitRegSnapshotRedirectImpactToReplicatedMovementAttachParentCom* HitRegSnapshotRedirectImpactToReplicatedMovementAttachParent; // 0x3d0(0x8)
	Class PostProcessComponent*                                  FirePostProcess;                                   // 0x3d8(0x8)
	Class BoxComponent*                                          Fire_PP_Volume;                                    // 0x3e0(0x8)
	Class SurfaceWaterComponent*                                 SurfaceWater;                                      // 0x3e8(0x8)
	Class StaticMeshComponent*                                   shp_small_rain_occlusion;                          // 0x3f0(0x8)
	Class StaticMeshComponent*                                   shp_galleon_main_deck_01_a;                        // 0x3f8(0x8)
};


// Size 0xe8
class BP_MediumShip_StandardHull_Art_Interior_Lower_Deck_C: public Actor
{
public:
	Class HitRegSnapshotRedirectImpactToReplicatedMovementAttachParentCom* HitRegSnapshotRedirectImpactToReplicatedMovementAttachParent; // 0x3d0(0x8)
	Class StaticMeshComponent*                                   cap_bunk_bri_01_a;                                 // 0x3d8(0x8)
	Class StaticMeshComponent*                                   cap_cabin_curtain_small_bri_01_a;                  // 0x3e0(0x8)
	Class StaticMeshComponent*                                   cap_cabin_rug_02_a;                                // 0x3e8(0x8)
	Class StaticMeshComponent*                                   cap_cage_03_a;                                     // 0x3f0(0x8)
	Class ChildActorComponent*                                   BP_CookingPot;                                     // 0x3f8(0x8)
	Class StaticMeshComponent*                                   cap_cabin_books_02_a;                              // 0x400(0x8)
	Class StaticMeshComponent*                                   cap_cabin_books_01_a;                              // 0x408(0x8)
	Class StaticMeshComponent*                                   cap_cabin_books_03_a;                              // 0x410(0x8)
	Class StaticMeshComponent*                                   shp_kitchen_shelf_02_a;                            // 0x418(0x8)
	Class StaticMeshComponent*                                   shp_kitchen_extractor_01_a;                        // 0x420(0x8)
	Class StaticMeshComponent*                                   tls_tankard_01_b;                                  // 0x428(0x8)
	Class StaticMeshComponent*                                   cmn_bottle_01_a;                                   // 0x430(0x8)
	Class StaticMeshComponent*                                   ptn_cure_01_a;                                     // 0x438(0x8)
	Class StaticMeshComponent*                                   shp_mid_lower_deck_rope_01_a;                      // 0x440(0x8)
	Class StaticMeshComponent*                                   cap_cabin_map_rolls_01_a;                          // 0x448(0x8)
	Class MergedStaticMeshComponent*                             MergedStaticMesh;                                  // 0x450(0x8)
	Class StaticMeshComponent*                                   cap_book_stand_01_b;                               // 0x458(0x8)
	Class StaticMeshComponent*                                   shp_cooker_02_a;                                   // 0x460(0x8)
	Class StaticMeshComponent*                                   shp_item_shelf_01_a;                               // 0x468(0x8)
	Class StaticMeshComponent*                                   cap_cabin_trunk_01_a;                              // 0x470(0x8)
	Class StaticMeshComponent*                                   cap_skull_candle_01_a;                             // 0x478(0x8)
	Class MergedStaticMeshComponent*                             MergedStaticMesh_col;                              // 0x480(0x8)
	Class PostProcessComponent*                                  PostProcess;                                       // 0x488(0x8)
	Class BoxComponent*                                          PP_collision;                                      // 0x490(0x8)
	Class StaticMeshComponent*                                   shp_mid_brig_01_a;                                 // 0x498(0x8)
	Class StaticMeshComponent*                                   shp_mid_stairs_01_a;                               // 0x4a0(0x8)
	Class StaticMeshComponent*                                   shp_mid_lower_deck_01_a;                           // 0x4a8(0x8)
	Class SceneComponent*                                        DefaultSceneRoot;                                  // 0x4b0(0x8)
};


}