// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x8
class BP_MerchantCrate_Commodity_TeaCrate_Wieldable_C: public None
{
public:
};


// Size 0x8
class BP_MerchantCrate_Commodity_TeaCrate_Proxy_C: public None
{
public:
};


// Size 0x30
class BP_MerchantCrate_AIShipAnyItemCrate_Wieldable_C: public StaticStorageCrateWieldable
{
public:
};


// Size 0x18
class BP_MerchantCrate_AIShipAnyItemCrate_Proxy_C: public StorageCrateItemProxy
{
public:
	Class AddOpenContainerActionRuleComponent*                   None;                                              // 0x798(0x8)
	Class StorageContainerComponent*                             None;                                              // 0x7a0(0x8)
	Class InteractableComponent*                                 None;                                              // 0x7a8(0x8)
};


// Size 0x8
class BP_MerchantCrate_Commodity_Ore_Wieldable_C: public None
{
public:
};


// Size 0x20
class BP_MerchantCrate_Commodity_Wieldable_Base_C: public StaticMerchantCrate
{
public:
	Class MaterialManipulationComponent*                         None;                                              // 0x7e0(0x8)
	Class WieldableInteractableComponent*                        None;                                              // 0x7e8(0x8)
	Class PickupableComponent*                                   None;                                              // 0x7f0(0x8)
	Class UsableWieldableComponent*                              None;                                              // 0x7f8(0x8)
};


// Size 0x8
class BP_MerchantCrate_Commodity_Ore_Proxy_C: public None
{
public:
	Class InteractableComponent*                                 None;                                              // 0x7e0(0x8)
};


// Size 0x8
class BP_MerchantCrate_Commodity_Base_Proxy_C: public StaticMerchantCrateItemProxy
{
public:
};


}