// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0xa5
class BP_Placement_Garden_C: public Actor
{
public:
	Struct PointerToUberGraphFrame                               None;                                              // 0x3d0(0x8)
	Class BillboardComponent*                                    None;                                              // 0x3d8(0x8)
	Class SphereComponent*                                       None;                                              // 0x3e0(0x8)
	Class SceneComponent*                                        None;                                              // 0x3e8(0x8)
	TArray<Struct >                                              None;                                              // 0x3f0(0x10)
	float                                                        None;                                              // 0x400(0x4)
	bool                                                         None;                                              // 0x404(0x1)
	float                                                        None;                                              // 0x408(0x4)
	float                                                        None;                                              // 0x40c(0x4)
	int                                                          None;                                              // 0x410(0x4)
	TArray<class None*>                                          None;                                              // 0x418(0x10)
	bool                                                         None;                                              // 0x428(0x1)
	TArray<Float >                                               None;                                              // 0x430(0x10)
	TArray<class None*>                                          None;                                              // 0x440(0x10)
	Struct RandomStream                                          None;                                              // 0x450(0x8)
	int                                                          None;                                              // 0x458(0x4)
	TArray<Struct None>                                          None;                                              // 0x460(0x10)
	float                                                        None;                                              // 0x470(0x4)
	bool                                                         None;                                              // 0x474(0x1)
};


}