// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x44
class BP_PlayerPirate_Ghost_C: public AthenaGhostPlayerCharacter
{
public:
	Struct PointerToUberGraphFrame                               None;                                              // 0x1b60(0x8)
	BlueprintGeneratedClass None*                                None;                                              // 0x1b68(0x8)
	Class WaterInteractionComponent*                             None;                                              // 0x1b70(0x8)
	Class PlayerNameplateComponent*                              None;                                              // 0x1b78(0x8)
	Class BodyLightControllerComponent*                          None;                                              // 0x1b80(0x8)
	Class AnimNotifyWwiseEmitterComponent*                       None;                                              // 0x1b88(0x8)
	Class AmbientLightSourceComponent*                           None;                                              // 0x1b90(0x8)
	Class CharacterFootImpactComponent*                          None;                                              // 0x1b98(0x8)
	float                                                        None;                                              // 0x1ba0(0x4)
};


}