// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x470
class BP_prem_shop_wsp_01_a_C: public Actor
{
public:
	Class WorldLocationPopUpComponent*                           WorldLocationPopUp;                                // 0x3d0(0x8)
	Class StaticMeshComponent*                                   StaticMesh7;                                       // 0x3d8(0x8)
	Class PointLightComponent*                                   PointLight15;                                      // 0x3e0(0x8)
	Class StaticMeshComponent*                                   StaticMesh5;                                       // 0x3e8(0x8)
	Class StaticMeshComponent*                                   StaticMesh;                                        // 0x3f0(0x8)
	Class PetHangoutSpotComponent*                               PetHangoutSpot;                                    // 0x3f8(0x8)
	Class CompanyRegionComponent*                                CompanyRegion;                                     // 0x400(0x8)
	Class PointLightComponent*                                   PointLight14;                                      // 0x408(0x8)
	Class ParticleSystemComponent*                               ParticleSystem6;                                   // 0x410(0x8)
	Class PointLightComponent*                                   PointLight11;                                      // 0x418(0x8)
	Class StaticMeshComponent*                                   Candle2;                                           // 0x420(0x8)
	Class StaticMeshComponent*                                   BANANA;                                            // 0x428(0x8)
	Class StaticMeshComponent*                                   Book4;                                             // 0x430(0x8)
	Class StaticMeshComponent*                                   Book3;                                             // 0x438(0x8)
	Class StaticMeshComponent*                                   Ship;                                              // 0x440(0x8)
	Class ChildActorComponent*                                   ChildActor1;                                       // 0x448(0x8)
	Class StaticMeshComponent*                                   RopeExterior;                                      // 0x450(0x8)
	Class StaticMeshComponent*                                   Book1;                                             // 0x458(0x8)
	Class ParticleSystemComponent*                               ParticleSystem;                                    // 0x460(0x8)
	Class StaticMeshComponent*                                   Candle1;                                           // 0x468(0x8)
	Class PointLightComponent*                                   PointLight9;                                       // 0x470(0x8)
	Class StaticMeshComponent*                                   Bottle4;                                           // 0x478(0x8)
	Class StaticMeshComponent*                                   Mannequin2;                                        // 0x480(0x8)
	Class StaticMeshComponent*                                   Book;                                              // 0x488(0x8)
	Class StaticMeshComponent*                                   Sideboard;                                         // 0x490(0x8)
	Class StaticMeshComponent*                                   Moneysack1;                                        // 0x498(0x8)
	Class StaticMeshComponent*                                   Drapes;                                            // 0x4a0(0x8)
	Class StaticMeshComponent*                                   Dreamcatcher4;                                     // 0x4a8(0x8)
	Class StaticMeshComponent*                                   Pole2;                                             // 0x4b0(0x8)
	Class StaticMeshComponent*                                   Pole1;                                             // 0x4b8(0x8)
	Class StaticMeshComponent*                                   Ladder4;                                           // 0x4c0(0x8)
	Class StaticMeshComponent*                                   Platform2;                                         // 0x4c8(0x8)
	Class StaticMeshComponent*                                   Bananas1;                                          // 0x4d0(0x8)
	Class StaticMeshComponent*                                   Dreamcatcher3;                                     // 0x4d8(0x8)
	Class StaticMeshComponent*                                   Ladder3;                                           // 0x4e0(0x8)
	Class StaticMeshComponent*                                   Ladder2;                                           // 0x4e8(0x8)
	Class StaticMeshComponent*                                   Platform;                                          // 0x4f0(0x8)
	Class StaticMeshComponent*                                   Ladder1;                                           // 0x4f8(0x8)
	Class StaticMeshComponent*                                   Collar2;                                           // 0x500(0x8)
	Class StaticMeshComponent*                                   Collar1;                                           // 0x508(0x8)
	Class StaticMeshComponent*                                   Hooks2;                                            // 0x510(0x8)
	Class StaticMeshComponent*                                   Hooks1;                                            // 0x518(0x8)
	Class StaticMeshComponent*                                   Dreamcatcher2;                                     // 0x520(0x8)
	Class StaticMeshComponent*                                   Sack_Nuts;                                         // 0x528(0x8)
	Class StaticMeshComponent*                                   Sack3;                                             // 0x530(0x8)
	Class StaticMeshComponent*                                   Sack1;                                             // 0x538(0x8)
	Class StaticMeshComponent*                                   Mannequin1;                                        // 0x540(0x8)
	Class StaticMeshComponent*                                   Dreamcatcher1;                                     // 0x548(0x8)
	Class SpotLightComponent*                                    SpotLight;                                         // 0x550(0x8)
	Class ChildActorComponent*                                   BP_wil_monkey_slim_04;                             // 0x558(0x8)
	Class ChildActorComponent*                                   BP_wil_parrot_03;                                  // 0x560(0x8)
	Class StaticMeshComponent*                                   cmn_bottle_01_a1;                                  // 0x568(0x8)
	Class StaticMeshComponent*                                   ptn_pois_01_b;                                     // 0x570(0x8)
	Class StaticMeshComponent*                                   bld_trn_shop_hanging_sign_01_a;                    // 0x578(0x8)
	Class PointLightComponent*                                   PointLight6;                                       // 0x580(0x8)
	Class PointLightComponent*                                   PointLight2;                                       // 0x588(0x8)
	Class PointLightComponent*                                   PointLight;                                        // 0x590(0x8)
	Class StaticMeshComponent*                                   cap_cage_01_a;                                     // 0x598(0x8)
	Class StaticMeshComponent*                                   cmn_bird_cage_01_a;                                // 0x5a0(0x8)
	Class StaticMeshComponent*                                   Barrel1;                                           // 0x5a8(0x8)
	Class StaticMeshComponent*                                   cmn_petCollar_01_a;                                // 0x5b0(0x8)
	Class StaticMeshComponent*                                   cmn_bottle_01_a;                                   // 0x5b8(0x8)
	Class StaticMeshComponent*                                   cmn_moneybag_01_a2;                                // 0x5c0(0x8)
	Class StaticMeshComponent*                                   bld_cls_shop_bird_cage_01_a;                       // 0x5c8(0x8)
	Class StaticMeshComponent*                                   bld_prem_shop_rope_details_01_d;                   // 0x5d0(0x8)
	Class ParticleSystemComponent*                               vfx_dust_01_air;                                   // 0x5d8(0x8)
	Class SpotLightComponent*                                    SpotLight5;                                        // 0x5e0(0x8)
	Class StaticMeshComponent*                                   StaticMesh6;                                       // 0x5e8(0x8)
	Class StaticMeshComponent*                                   StaticMesh4;                                       // 0x5f0(0x8)
	Class StaticMeshComponent*                                   StaticMesh3;                                       // 0x5f8(0x8)
	Class PointLightComponent*                                   PointLight5;                                       // 0x600(0x8)
	Class ParticleSystemComponent*                               ParticleSystem5;                                   // 0x608(0x8)
	Class ParticleSystemComponent*                               ParticleSystem4;                                   // 0x610(0x8)
	Class PointLightComponent*                                   PointLight4;                                       // 0x618(0x8)
	Class ParticleSystemComponent*                               ParticleSystem3;                                   // 0x620(0x8)
	Class StaticMeshComponent*                                   SkullCandle;                                       // 0x628(0x8)
	Class PointLightComponent*                                   PointLight3;                                       // 0x630(0x8)
	Class ParticleSystemComponent*                               ParticleSystem2;                                   // 0x638(0x8)
	Class ParticleSystemComponent*                               ParticleSystem1;                                   // 0x640(0x8)
	Class SpotLightComponent*                                    SpotLight6;                                        // 0x648(0x8)
	Class ChildActorComponent*                                   ChildActor3;                                       // 0x650(0x8)
	Class SpotLightComponent*                                    SpotLight4;                                        // 0x658(0x8)
	Class ChildActorComponent*                                   ChildActor;                                        // 0x660(0x8)
	Class SpotLightComponent*                                    SpotLight3;                                        // 0x668(0x8)
	Class PointLightComponent*                                   PointLight1;                                       // 0x670(0x8)
	Class SpotLightComponent*                                    SpotLight2;                                        // 0x678(0x8)
	Class PostProcessComponent*                                  PostProcess;                                       // 0x680(0x8)
	Class BoxComponent*                                          Box;                                               // 0x688(0x8)
	Class StaticMeshComponent*                                   StaticMesh2;                                       // 0x690(0x8)
	Class StaticMeshComponent*                                   StaticMesh1;                                       // 0x698(0x8)
	Class ChildActorComponent*                                   AudioSpace;                                        // 0x6a0(0x8)
	Class StaticMeshComponent*                                   wsp_bush_fern_01_a;                                // 0x6a8(0x8)
	Class StaticMeshComponent*                                   wsp_plant_ball_01_a;                               // 0x6b0(0x8)
	Class StaticMeshComponent*                                   wsp_vine_02_b;                                     // 0x6b8(0x8)
	Class StaticMeshComponent*                                   wsp_vine_01_a;                                     // 0x6c0(0x8)
	Class StaticMeshComponent*                                   wsp_vine_01_c;                                     // 0x6c8(0x8)
	Class StaticMeshComponent*                                   bld_enc_shop_sign_01_a;                            // 0x6d0(0x8)
	Class StaticMeshComponent*                                   bld_pot_shop_table_wsp_01_a;                       // 0x6d8(0x8)
	Class StaticMeshComponent*                                   bld_prem_shop_plunder_details_01_a;                // 0x6e0(0x8)
	Class StaticMeshComponent*                                   bld_prem_shop_01_a;                                // 0x6e8(0x8)
	Class StaticMeshComponent*                                   bld_int_large_shelf_03_a1;                         // 0x6f0(0x8)
	Class StaticMeshComponent*                                   cmn_candle_01_e1;                                  // 0x6f8(0x8)
	Class StaticMeshComponent*                                   gmp_bar_stor_01_a;                                 // 0x700(0x8)
	Class StaticMeshComponent*                                   cap_cabin_trunk_cloth_01_a;                        // 0x708(0x8)
	Class StaticMeshComponent*                                   bld_shop_wood_box_03_a1;                           // 0x710(0x8)
	Class StaticMeshComponent*                                   bld_shop_wood_box_02_a;                            // 0x718(0x8)
	Class StaticMeshComponent*                                   bld_shop_wood_box_03_a;                            // 0x720(0x8)
	Class StaticMeshComponent*                                   cap_cabin_books_aged_03_a1;                        // 0x728(0x8)
	Class StaticMeshComponent*                                   cap_cabin_books_03_a1;                             // 0x730(0x8)
	Class StaticMeshComponent*                                   cap_cabin_books_aged_01_a;                         // 0x738(0x8)
	Class StaticMeshComponent*                                   cap_cabin_books_aged_03_a;                         // 0x740(0x8)
	Class StaticMeshComponent*                                   cap_cabin_books_02_a;                              // 0x748(0x8)
	Class StaticMeshComponent*                                   cap_cabin_books_03_a;                              // 0x750(0x8)
	Class StaticMeshComponent*                                   cmn_moneybag_01_a1;                                // 0x758(0x8)
	Class StaticMeshComponent*                                   cmn_clay_vase_01_b;                                // 0x760(0x8)
	Class StaticMeshComponent*                                   bld_enc_shop_pin_board_01_a;                       // 0x768(0x8)
	Class StaticMeshComponent*                                   bld_int_large_sideboard_03_a;                      // 0x770(0x8)
	Class StaticMeshComponent*                                   fod_coconut_01_a;                                  // 0x778(0x8)
	Class StaticMeshComponent*                                   cmn_banana_bunch_01_a;                             // 0x780(0x8)
	Class StaticMeshComponent*                                   fod_pineapple_01_a1;                               // 0x788(0x8)
	Class StaticMeshComponent*                                   fod_pineapple_01_a;                                // 0x790(0x8)
	Class StaticMeshComponent*                                   cmn_basket_01_a;                                   // 0x798(0x8)
	Class StaticMeshComponent*                                   cmn_moneybag_01_a;                                 // 0x7a0(0x8)
	Class StaticMeshComponent*                                   cmn_candle_01_e;                                   // 0x7a8(0x8)
	Class StaticMeshComponent*                                   cap_cabin_map_rolls_01_a;                          // 0x7b0(0x8)
	Class StaticMeshComponent*                                   bld_tvn_animal_rug_01_a;                           // 0x7b8(0x8)
	Class StaticMeshComponent*                                   bld_par_weathervane_01_b;                          // 0x7c0(0x8)
	Class StaticMeshComponent*                                   bld_tvn_post_01_c;                                 // 0x7c8(0x8)
	Class StaticMeshComponent*                                   cap_cabin_curtain_03_a;                            // 0x7d0(0x8)
	Class StaticMeshComponent*                                   bld_int_small_shelves_01_a;                        // 0x7d8(0x8)
	Class StaticMeshComponent*                                   bld_pot_shop_door_frame_01_a;                      // 0x7e0(0x8)
	Class StaticMeshComponent*                                   bld_pot_shop_roof_beam_01_a;                       // 0x7e8(0x8)
	Class StaticMeshComponent*                                   bld_pot_shop_chimney_01_a;                         // 0x7f0(0x8)
	Class StaticMeshComponent*                                   bld_pot_gate_01_a;                                 // 0x7f8(0x8)
	Class StaticMeshComponent*                                   bld_pot_fence_01_a;                                // 0x800(0x8)
	Class StaticMeshComponent*                                   bld_pot_shop_window_01_a3;                         // 0x808(0x8)
	Class StaticMeshComponent*                                   bld_pot_hatch_01_a;                                // 0x810(0x8)
	Class StaticMeshComponent*                                   bld_pot_shop_door_01_a;                            // 0x818(0x8)
	Class StaticMeshComponent*                                   bld_pot_shop_window_01_a2;                         // 0x820(0x8)
	Class StaticMeshComponent*                                   bld_pot_shop_window_01_a1;                         // 0x828(0x8)
	Class StaticMeshComponent*                                   bld_pot_shop_window_01_a;                          // 0x830(0x8)
	Class SceneComponent*                                        DefaultSceneRoot;                                  // 0x838(0x8)
};


}