// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x18
class BP_Projectile_VolcanoRockSmall_C: public VolcanicRock
{
public:
	Class RotatingAudioSourceComponent*                          None;                                              // 0x660(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x668(0x8)
	Class SphereComponent*                                       None;                                              // 0x670(0x8)
};


// Size 0x10
class BP_Projectile_VolcanoRockMini_C: public VolcanicRock
{
public:
	Class StaticMeshComponent*                                   None;                                              // 0x660(0x8)
	Class SphereComponent*                                       None;                                              // 0x668(0x8)
};


// Size 0x18
class BP_Projectile_VolcanoRockMedium_C: public VolcanicRock
{
public:
	Class RotatingAudioSourceComponent*                          None;                                              // 0x660(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x668(0x8)
	Class SphereComponent*                                       None;                                              // 0x670(0x8)
};


// Size 0x18
class BP_Projectile_VolcanoRockLarge_C: public VolcanicRock
{
public:
	Class RotatingAudioSourceComponent*                          None;                                              // 0x660(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x668(0x8)
	Class SphereComponent*                                       None;                                              // 0x670(0x8)
};


}