// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x1d0
class BP_prem_shop_frontend_01_a_C: public Actor
{
public:
	Class StaticMeshComponent*                                   bld_prem_frontend_01_a;                            // 0x3d0(0x8)
	Class PostProcessComponent*                                  PostProcess;                                       // 0x3d8(0x8)
	Class BoxComponent*                                          Box;                                               // 0x3e0(0x8)
	Class StaticMeshComponent*                                   bld_cls_shp_dye_pot_lid_01_a;                      // 0x3e8(0x8)
	Class StaticMeshComponent*                                   StaticMesh2;                                       // 0x3f0(0x8)
	Class StaticMeshComponent*                                   StaticMesh1;                                       // 0x3f8(0x8)
	Class StaticMeshComponent*                                   StaticMesh;                                        // 0x400(0x8)
	Class ChildActorComponent*                                   AudioSpace;                                        // 0x408(0x8)
	Class StaticMeshComponent*                                   bld_tvn_post_01_d;                                 // 0x410(0x8)
	Class StaticMeshComponent*                                   bld_par_weathervane_01_c;                          // 0x418(0x8)
	Class StaticMeshComponent*                                   ptn_resu_01_a3;                                    // 0x420(0x8)
	Class StaticMeshComponent*                                   ptn_resu_01_a2;                                    // 0x428(0x8)
	Class StaticMeshComponent*                                   ptn_resu_01_a1;                                    // 0x430(0x8)
	Class StaticMeshComponent*                                   ptn_resu_01_a;                                     // 0x438(0x8)
	Class StaticMeshComponent*                                   bld_pot_shop_rack_01_a;                            // 0x440(0x8)
	Class StaticMeshComponent*                                   cmn_candle_01_e2;                                  // 0x448(0x8)
	Class StaticMeshComponent*                                   cmn_candle_01_c1;                                  // 0x450(0x8)
	Class StaticMeshComponent*                                   cmn_clay_vase_02_a;                                // 0x458(0x8)
	Class StaticMeshComponent*                                   bld_prem_shop_rope_details_01_b;                   // 0x460(0x8)
	Class StaticMeshComponent*                                   bld_pot_shop_table_bsp_01_a;                       // 0x468(0x8)
	Class ChildActorComponent*                                   BP_bld_pot_shop_boiler_01_a;                       // 0x470(0x8)
	Class StaticMeshComponent*                                   cmn_animal_cage_01_a;                              // 0x478(0x8)
	Class StaticMeshComponent*                                   cmn_candle_01_e1;                                  // 0x480(0x8)
	Class StaticMeshComponent*                                   gmp_bar_stor_01_a;                                 // 0x488(0x8)
	Class StaticMeshComponent*                                   cap_cabin_trunk_cloth_01_a;                        // 0x490(0x8)
	Class StaticMeshComponent*                                   bld_shop_wood_box_03_a1;                           // 0x498(0x8)
	Class StaticMeshComponent*                                   bld_shop_wood_box_02_a;                            // 0x4a0(0x8)
	Class StaticMeshComponent*                                   bld_shop_wood_box_03_a;                            // 0x4a8(0x8)
	Class StaticMeshComponent*                                   cap_cabin_books_aged_03_a1;                        // 0x4b0(0x8)
	Class StaticMeshComponent*                                   cap_cabin_books_03_a1;                             // 0x4b8(0x8)
	Class StaticMeshComponent*                                   cap_cabin_books_aged_01_a;                         // 0x4c0(0x8)
	Class StaticMeshComponent*                                   cap_cabin_books_aged_03_a;                         // 0x4c8(0x8)
	Class StaticMeshComponent*                                   cap_cabin_books_02_a;                              // 0x4d0(0x8)
	Class StaticMeshComponent*                                   cap_cabin_books_03_a;                              // 0x4d8(0x8)
	Class StaticMeshComponent*                                   cmn_moneybag_01_a1;                                // 0x4e0(0x8)
	Class StaticMeshComponent*                                   cmn_clay_vase_01_b;                                // 0x4e8(0x8)
	Class StaticMeshComponent*                                   bld_enc_shop_pin_board_01_a;                       // 0x4f0(0x8)
	Class StaticMeshComponent*                                   bld_cls_shop_head_stand_01_a;                      // 0x4f8(0x8)
	Class StaticMeshComponent*                                   ptn_pois_01_b1;                                    // 0x500(0x8)
	Class StaticMeshComponent*                                   ptn_pois_01_b;                                     // 0x508(0x8)
	Class SkeletalMeshComponent*                                 tls_lantern_01_a3;                                 // 0x510(0x8)
	Class SkeletalMeshComponent*                                 tls_lantern_01_a2;                                 // 0x518(0x8)
	Class StaticMeshComponent*                                   cmn_candle_01_c;                                   // 0x520(0x8)
	Class StaticMeshComponent*                                   cmn_candle_01_b;                                   // 0x528(0x8)
	Class StaticMeshComponent*                                   cmn_bottle_01_a1;                                  // 0x530(0x8)
	Class StaticMeshComponent*                                   bld_enc_shop_burner_pot_01_a;                      // 0x538(0x8)
	Class StaticMeshComponent*                                   bld_int_large_sideboard_03_a;                      // 0x540(0x8)
	Class StaticMeshComponent*                                   fod_rum_01_a;                                      // 0x548(0x8)
	Class StaticMeshComponent*                                   cmn_bottle_01_a;                                   // 0x550(0x8)
	Class StaticMeshComponent*                                   cmn_moneybag_01_a;                                 // 0x558(0x8)
	Class StaticMeshComponent*                                   cmn_clay_vase_01_a;                                // 0x560(0x8)
	Class StaticMeshComponent*                                   cmn_clay_pot_01_a;                                 // 0x568(0x8)
	Class StaticMeshComponent*                                   cmn_candle_01_e;                                   // 0x570(0x8)
	Class StaticMeshComponent*                                   cap_cabin_map_rolls_01_a;                          // 0x578(0x8)
	Class StaticMeshComponent*                                   bld_tvn_animal_rug_01_a;                           // 0x580(0x8)
	Class StaticMeshComponent*                                   cap_cabin_curtain_03_a;                            // 0x588(0x8)
	Class StaticMeshComponent*                                   bld_int_small_shelves_01_a;                        // 0x590(0x8)
	Class SceneComponent*                                        DefaultSceneRoot;                                  // 0x598(0x8)
};


}