// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x88
class BP_PirateGenerator_LineUpUI_C: public Actor
{
public:
	Struct PointerToUberGraphFrame                               UberGraphFrame;                                    // 0x3d0(0x8)
	Class SceneComponent*                                        DefaultSceneRoot;                                  // 0x3d8(0x8)
	TArray<class Pirates*>                                       Pirates;                                           // 0x3e0(0x10)
	TArray<Struct None>                                          CarouselPirateDescs;                               // 0x3f0(0x10)
	TArray<Bool Key>                                             LockedPirates;                                     // 0x400(0x10)
	Struct RadialCoordinate                                      MinBodyShape;                                      // 0x410(0x8)
	Struct RadialCoordinate                                      MaxBodyShape;                                      // 0x418(0x8)
	bool                                                         UseIPG;                                            // 0x420(0x1)
	Class AnimationDataStoreAsset*                               AnimationAsset;                                    // 0x428(0x8)
	class                                                        DefaultAnimationSet;                               // 0x430(0x8)
	Class CarouselPirateGeneratorParamsAsset*                    PirateGeneratorParams;                             // 0x438(0x8)
	int                                                          NumberOfPiratesCurrentlyGenerating;                // 0x440(0x4)
};


}