// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x191
class BP_PirateGenerator_LineUp_C: public PosablePirate
{
public:
	Struct PointerToUberGraphFrame                               UberGraphFrame;                                    // 0x480(0x8)
	Class CapsuleComponent*                                      Capsule;                                           // 0x488(0x8)
	Class ParticleSystemComponent*                               GhostParticlesOut;                                 // 0x490(0x8)
	Class ParticleSystemComponent*                               GhostParticlesIn;                                  // 0x498(0x8)
	Class AnimNotifyWwiseEmitterComponent*                       AnimNotifyWwiseEmitter;                            // 0x4a0(0x8)
	Class SkeletalMeshComponent*                                 SkeletalProp;                                      // 0x4a8(0x8)
	Class StaticMeshComponent*                                   StaticPropSecondary;                               // 0x4b0(0x8)
	Class SkeletalMeshComponent*                                 SkeletalPropSecondary;                             // 0x4b8(0x8)
	Class StaticMeshComponent*                                   StaticProp;                                        // 0x4c0(0x8)
	Struct FString                                               ForceShape;                                        // 0x4c8(0x10)
	Struct BP_LineUp_Animation                                   Animation;                                         // 0x4d8(0xc8)
	AnimBlueprintGeneratedClass BP_Anim_CharacterSelect_C*       CharacterSelectAnimgraph;                          // 0x5a0(0x8)
	float                                                        ZoomTime;                                          // 0x5a8(0x4)
	float                                                        GhostTransitionOutTime;                            // 0x5ac(0x4)
	float                                                        GhostTransitionInTime;                             // 0x5b0(0x4)
	bool                                                         GhostTransitioning;                                // 0x5b4(0x1)
	int                                                          PoseIndex;                                         // 0x5b8(0x4)
	Class AnimationSwitchDataAsset*                              AnimationSwitch;                                   // 0x5c0(0x8)
	Class AnimationDataStoreAsset*                               AnimationAsset;                                    // 0x5c8(0x8)
	bool                                                         Initialized;                                       // 0x5d0(0x1)
	bool                                                         IsHighlighted;                                     // 0x5e8(0x1)
	bool                                                         IsInShipSelect;                                    // 0x5e9(0x1)
	float                                                        ShipSelectVariantTimer;                            // 0x5ec(0x4)
	float                                                        ShipSelectVariantTimerMax;                         // 0x5f0(0x4)
	int                                                          ShipSelectAnimCountMax;                            // 0x5f4(0x4)
	int                                                          ShipSelectVariantAnimIndex;                        // 0x5f8(0x4)
	bool                                                         IsPlayingShipSelectVariant;                        // 0x5fc(0x1)
	Class AnimSequence*                                          ShipSelectAnimToPlay;                              // 0x600(0x8)
	Class AnimSequence*                                          ShipSelectPropAnimToPlay;                          // 0x608(0x8)
	bool                                                         ShipSelectAnimStarted;                             // 0x610(0x1)
};


}