// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0xf8
class BP_PromptActor_CosmeticPurchased_Clothing_C: public BP_PromptActorBase_C
{
public:
	Struct PointerToUberGraphFrame                               UberGraphFrame;                                    // 0x408(0x8)
	BlueprintGeneratedClass BP_Prompt_CosmeticPurchased_C*       PromptCoordinator;                                 // 0x410(0x8)
	class                                                        AccessKey;                                         // 0x418(0x8)
	TArray<Class ObjectProperty>                                 CategoryTypes;                                     // 0x420(0x10)
	Struct PrioritisedPromptWithHandle                           Prompt_CosmeticPurchased;                          // 0x430(0x68)
	Struct PrioritisedPromptWithHandle                           Prompt_VisitCustomizationChest;                    // 0x498(0x68)
};


// Size 0xf8
class BP_PromptActor_CosmeticPurchased_Equipment_C: public BP_PromptActorBase_C
{
public:
	Struct PointerToUberGraphFrame                               UberGraphFrame;                                    // 0x408(0x8)
	BlueprintGeneratedClass BP_Prompt_CosmeticPurchased_C*       PromptCoordinator;                                 // 0x410(0x8)
	class                                                        AccessKey;                                         // 0x418(0x8)
	TArray<Class CategoryTypes>                                  CategoryTypes;                                     // 0x420(0x10)
	Struct PrioritisedPromptWithHandle                           Prompt_CosmeticPurchased;                          // 0x430(0x68)
	Struct PrioritisedPromptWithHandle                           Prompt_VisitCustomizationChest;                    // 0x498(0x68)
};


// Size 0xf8
class BP_PromptActor_CosmeticPurchased_Ship_C: public BP_PromptActorBase_C
{
public:
	Struct PointerToUberGraphFrame                               UberGraphFrame;                                    // 0x408(0x8)
	BlueprintGeneratedClass BP_Prompt_CosmeticPurchased_C*       PromptCoordinator;                                 // 0x410(0x8)
	class                                                        AccessKey;                                         // 0x418(0x8)
	TArray<Class CategoryTypes>                                  CategoryTypes;                                     // 0x420(0x10)
	Struct PrioritisedPromptWithHandle                           Prompt_CosmeticPurchased;                          // 0x430(0x68)
	Struct PrioritisedPromptWithHandle                           Prompt_VisitCustomizationChest;                    // 0x498(0x68)
};


// Size 0xf8
class BP_PromptActor_CosmeticPurchased_Vanity_C: public BP_PromptActorBase_C
{
public:
	Struct PointerToUberGraphFrame                               UberGraphFrame;                                    // 0x408(0x8)
	BlueprintGeneratedClass BP_Prompt_CosmeticPurchased_C*       PromptCoordinator;                                 // 0x410(0x8)
	class                                                        AccessKey;                                         // 0x418(0x8)
	TArray<Class CategoryTypes>                                  CategoryTypes;                                     // 0x420(0x10)
	Struct PrioritisedPromptWithHandle                           Prompt_CosmeticPurchased;                          // 0x430(0x68)
	Struct PrioritisedPromptWithHandle                           Prompt_VisitCustomizationChest;                    // 0x498(0x68)
};


// Size 0xf8
class BP_PromptActor_CosmeticPurchased_Weapon_C: public BP_PromptActorBase_C
{
public:
	Struct PointerToUberGraphFrame                               UberGraphFrame;                                    // 0x408(0x8)
	BlueprintGeneratedClass BP_Prompt_CosmeticPurchased_C*       PromptCoordinator;                                 // 0x410(0x8)
	class                                                        AccessKey;                                         // 0x418(0x8)
	TArray<Class None>                                           CategoryTypes;                                     // 0x420(0x10)
	Struct PrioritisedPromptWithHandle                           Prompt_CosmeticPurchased;                          // 0x430(0x68)
	Struct PrioritisedPromptWithHandle                           Prompt_VisitCustomizationChest;                    // 0x498(0x68)
};


}