// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x49
class BP_SKD_ShrineShimmer_C: public ShimmerActor
{
public:
	Struct PointerToUberGraphFrame                               None;                                              // 0x478(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x480(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x488(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x490(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x498(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x4a0(0x8)
	Class SceneComponent*                                        None;                                              // 0x4a8(0x8)
	float                                                        None;                                              // 0x4b0(0x4)
	byte                                                         None;                                              // 0x4b4(0x1)
	Class TimelineComponent*                                     None;                                              // 0x4b8(0x8)
	bool                                                         None;                                              // 0x4c0(0x1)
};


}