// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x98
class BP_StepsTrigger_C: public TavernStepsTrigger
{
public:
	Struct PointerToUberGraphFrame                               UberGraphFrame;                                    // 0x4b8(0x8)
	Class StaticMeshComponent*                                   bld_tavern_entrance_steps_lightshafts_01_a;        // 0x4c0(0x8)
	Class ParticleSystemComponent*                               vfx_tavern_stairs_symbol_glow;                     // 0x4c8(0x8)
	Class DecalComponent*                                        Decal;                                             // 0x4d0(0x8)
	Class ParticleSystemComponent*                               vfx_tavern_stairs_glow;                            // 0x4d8(0x8)
	Class ParticleSystemComponent*                               vfx_tavern_stairs_falling_dust_under_ground;       // 0x4e0(0x8)
	Class ParticleSystemComponent*                               vfx_tavern_stairs_falling_dust2;                   // 0x4e8(0x8)
	Class ParticleSystemComponent*                               vfx_tavern_stairs_falling_dust1;                   // 0x4f0(0x8)
	Class ParticleSystemComponent*                               vfx_tavern_stairs_impact3;                         // 0x4f8(0x8)
	Class ParticleSystemComponent*                               vfx_tavern_stairs_impact2;                         // 0x500(0x8)
	Class ParticleSystemComponent*                               vfx_tavern_stairs_impact1;                         // 0x508(0x8)
	Class ParticleSystemComponent*                               vfx_tavern_stairs_impact;                          // 0x510(0x8)
	Class ParticleSystemComponent*                               vfx_tavern_stairs_falling_dust;                    // 0x518(0x8)
	BlueprintGeneratedClass BP_AnimatedStepsComponent_C*         AnimatedStepsComponent;                            // 0x520(0x8)
	Class BoxComponent*                                          Box1;                                              // 0x528(0x8)
	Class BoxComponent*                                          Box3;                                              // 0x530(0x8)
	Class BoxComponent*                                          Box2;                                              // 0x538(0x8)
	Class BoxComponent*                                          Box0;                                              // 0x540(0x8)
	Class PoseableSkeletalMeshComponent*                         StepsMesh;                                         // 0x548(0x8)
};


}