// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x50
class BP_SkeletonPawnBase_C: public AthenaAICharacter
{
public:
	Class AIItemSpawnDataSourceComponent*                        None;                                              // 0x1200(0x8)
	Class ChainLightningReceiverComponent*                       None;                                              // 0x1208(0x8)
	Class BlinkStrafeComponent*                                  None;                                              // 0x1210(0x8)
	Class WaterInteractionComponent*                             None;                                              // 0x1218(0x8)
	Class AnimNotifyWwiseEmitterComponent*                       None;                                              // 0x1220(0x8)
	Class AINameplateComponent*                                  None;                                              // 0x1228(0x8)
	BlueprintGeneratedClass None*                                None;                                              // 0x1230(0x8)
	Class NoiseMakerComponent*                                   None;                                              // 0x1238(0x8)
	BlueprintGeneratedClass None*                                None;                                              // 0x1240(0x8)
	Class CharacterFootImpactComponent*                          None;                                              // 0x1248(0x8)
};


}