// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0xa80
class BP_shp_skeleton_01_a_C: public Actor
{
public:
	Struct PointerToUberGraphFrame                               UberGraphFrame;                                    // 0x3d0(0x8)
	Class ShipLightComponent*                                    ShipLight_Deck_Low_Front;                          // 0x3d8(0x8)
	Class ShipLightComponent*                                    ShipLight_Deck_Low_Back;                           // 0x3e0(0x8)
	Class ShipLightComponent*                                    ShipLight_Deck_Mid_Back;                           // 0x3e8(0x8)
	Class ShipLightComponent*                                    ShipLight_Deck_Mid_Front;                          // 0x3f0(0x8)
	Class ShipLightComponent*                                    ShipLight_Deck_Mid_Strs;                           // 0x3f8(0x8)
	Class ShipLightComponent*                                    ShipLight_Captains_Cabin;                          // 0x400(0x8)
	Class ShipLightComponent*                                    ShipLight_Deck_Top_Front;                          // 0x408(0x8)
	Class ShipLightComponent*                                    ShipLight_Deck_Wheel;                              // 0x410(0x8)
	Class ShipLightComponent*                                    ShipLight_Deck_Top;                                // 0x418(0x8)
	Class PostProcessComponent*                                  FirePostProcess;                                   // 0x420(0x8)
	Class BoxComponent*                                          PP_Fire;                                           // 0x428(0x8)
	Class StaticMeshComponent*                                   PointLightDistantFlares;                           // 0x430(0x8)
	Class StaticMeshComponent*                                   sterncastle_cloth;                                 // 0x438(0x8)
	Class PostProcessComponent*                                  PostProcess1;                                      // 0x440(0x8)
	Class BoxComponent*                                          PP_Cabin;                                          // 0x448(0x8)
	Class PostProcessComponent*                                  PostProcess;                                       // 0x450(0x8)
	Class BoxComponent*                                          PP_Ship;                                           // 0x458(0x8)
	Class ParticleSystemComponent*                               ParticleSystem3;                                   // 0x460(0x8)
	Class ParticleSystemComponent*                               ParticleSystem8;                                   // 0x468(0x8)
	Class ParticleSystemComponent*                               ParticleSystem7;                                   // 0x470(0x8)
	Class ParticleSystemComponent*                               ParticleSystem6;                                   // 0x478(0x8)
	Class ParticleSystemComponent*                               ParticleSystem5;                                   // 0x480(0x8)
	Class ParticleSystemComponent*                               ParticleSystem4;                                   // 0x488(0x8)
	Class ParticleSystemComponent*                               ParticleSystem2;                                   // 0x490(0x8)
	Class ParticleSystemComponent*                               ParticleSystem1;                                   // 0x498(0x8)
	Class ParticleSystemComponent*                               ParticleSystem;                                    // 0x4a0(0x8)
	Class ParticleSystemComponent*                               vfx_torch_03;                                      // 0x4a8(0x8)
	Class StaticMeshComponent*                                   shp_skl_sails_01_a__sail_02_a1;                    // 0x4b0(0x8)
	Class StaticMeshComponent*                                   shp_skl_sails_01_a__sail_01_a1;                    // 0x4b8(0x8)
	Class StaticMeshComponent*                                   shp_skl_sails_01_a__sail_03_a1;                    // 0x4c0(0x8)
	Class StaticMeshComponent*                                   shp_skl_sails_01_a__sail_05_a;                     // 0x4c8(0x8)
	Class StaticMeshComponent*                                   shp_skl_sails_01_a__sail_04_a;                     // 0x4d0(0x8)
	Class StaticMeshComponent*                                   shp_skl_sails_01_a__sail_03_a;                     // 0x4d8(0x8)
	Class StaticMeshComponent*                                   shp_skl_sails_01_a__sail_02_a;                     // 0x4e0(0x8)
	Class StaticMeshComponent*                                   shp_skl_sails_01_a__sail_01_a;                     // 0x4e8(0x8)
	Class StaticMeshComponent*                                   seaweed_placement_01_a;                            // 0x4f0(0x8)
	Class StaticMeshComponent*                                   map_stairs;                                        // 0x4f8(0x8)
	Class StaticMeshComponent*                                   brig_stairs;                                       // 0x500(0x8)
	Class DecalComponent*                                        WetDecalStarboard;                                 // 0x508(0x8)
	Class DecalComponent*                                        WetDecalPort;                                      // 0x510(0x8)
	Class StaticMeshComponent*                                   Chandelier;                                        // 0x518(0x8)
	Class StaticMeshComponent*                                   StaticMesh170;                                     // 0x520(0x8)
	Class StaticMeshComponent*                                   StaticMesh167;                                     // 0x528(0x8)
	Class StaticMeshComponent*                                   StaticMesh162;                                     // 0x530(0x8)
	Class StaticMeshComponent*                                   StaticMesh169;                                     // 0x538(0x8)
	Class StaticMeshComponent*                                   StaticMesh168;                                     // 0x540(0x8)
	Class StaticMeshComponent*                                   StaticMesh172;                                     // 0x548(0x8)
	Class StaticMeshComponent*                                   StaticMesh175;                                     // 0x550(0x8)
	Class StaticMeshComponent*                                   StaticMesh176;                                     // 0x558(0x8)
	Class StaticMeshComponent*                                   cell_door;                                         // 0x560(0x8)
	Class StaticMeshComponent*                                   StaticMesh163;                                     // 0x568(0x8)
	Class StaticMeshComponent*                                   StaticMesh160;                                     // 0x570(0x8)
	Class StaticMeshComponent*                                   StaticMesh174;                                     // 0x578(0x8)
	Class StaticMeshComponent*                                   StaticMesh84;                                      // 0x580(0x8)
	Class StaticMeshComponent*                                   StaticMesh166;                                     // 0x588(0x8)
	Class StaticMeshComponent*                                   StaticMesh171;                                     // 0x590(0x8)
	Class StaticMeshComponent*                                   shark_jaws;                                        // 0x598(0x8)
	Class StaticMeshComponent*                                   plaque;                                            // 0x5a0(0x8)
	Class StaticMeshComponent*                                   StaticMesh80;                                      // 0x5a8(0x8)
	Class StaticMeshComponent*                                   StaticMesh66;                                      // 0x5b0(0x8)
	Class StaticMeshComponent*                                   StaticMesh79;                                      // 0x5b8(0x8)
	Class StaticMeshComponent*                                   StaticMesh77;                                      // 0x5c0(0x8)
	Class StaticMeshComponent*                                   StaticMesh117;                                     // 0x5c8(0x8)
	Class StaticMeshComponent*                                   StaticMesh82;                                      // 0x5d0(0x8)
	Class StaticMeshComponent*                                   StaticMesh74;                                      // 0x5d8(0x8)
	Class StaticMeshComponent*                                   StaticMesh173;                                     // 0x5e0(0x8)
	Class StaticMeshComponent*                                   StaticMesh121;                                     // 0x5e8(0x8)
	Class StaticMeshComponent*                                   StaticMesh124;                                     // 0x5f0(0x8)
	Class StaticMeshComponent*                                   StaticMesh118;                                     // 0x5f8(0x8)
	Class StaticMeshComponent*                                   StaticMesh119;                                     // 0x600(0x8)
	Class StaticMeshComponent*                                   StaticMesh120;                                     // 0x608(0x8)
	Class StaticMeshComponent*                                   StaticMesh39;                                      // 0x610(0x8)
	Class StaticMeshComponent*                                   StaticMesh38;                                      // 0x618(0x8)
	Class StaticMeshComponent*                                   StaticMesh36;                                      // 0x620(0x8)
	Class StaticMeshComponent*                                   StaticMesh35;                                      // 0x628(0x8)
	Class StaticMeshComponent*                                   StaticMesh34;                                      // 0x630(0x8)
	Class StaticMeshComponent*                                   StaticMesh5;                                       // 0x638(0x8)
	Class StaticMeshComponent*                                   StaticMesh19;                                      // 0x640(0x8)
	Class StaticMeshComponent*                                   StaticMesh18;                                      // 0x648(0x8)
	Class StaticMeshComponent*                                   StaticMesh17;                                      // 0x650(0x8)
	Class StaticMeshComponent*                                   StaticMesh16;                                      // 0x658(0x8)
	Class StaticMeshComponent*                                   StaticMesh15;                                      // 0x660(0x8)
	Class StaticMeshComponent*                                   StaticMesh14;                                      // 0x668(0x8)
	Class StaticMeshComponent*                                   StaticMesh13;                                      // 0x670(0x8)
	Class StaticMeshComponent*                                   StaticMesh20;                                      // 0x678(0x8)
	Class StaticMeshComponent*                                   StaticMesh4;                                       // 0x680(0x8)
	Class StaticMeshComponent*                                   StaticMesh9;                                       // 0x688(0x8)
	Class StaticMeshComponent*                                   StaticMesh12;                                      // 0x690(0x8)
	Class StaticMeshComponent*                                   StaticMesh11;                                      // 0x698(0x8)
	Class StaticMeshComponent*                                   StaticMesh10;                                      // 0x6a0(0x8)
	Class StaticMeshComponent*                                   StaticMesh6;                                       // 0x6a8(0x8)
	Class StaticMeshComponent*                                   StaticMesh8;                                       // 0x6b0(0x8)
	Class StaticMeshComponent*                                   StaticMesh3;                                       // 0x6b8(0x8)
	Class StaticMeshComponent*                                   StaticMesh7;                                       // 0x6c0(0x8)
	Class StaticMeshComponent*                                   bsp_torch_pole;                                    // 0x6c8(0x8)
	Class StaticMeshComponent*                                   tls_wld_Orb_light_a;                               // 0x6d0(0x8)
	Class StaticMeshComponent*                                   StaticMesh2;                                       // 0x6d8(0x8)
	Class StaticMeshComponent*                                   StaticMesh;                                        // 0x6e0(0x8)
	Class StaticMeshComponent*                                   StaticMesh1;                                       // 0x6e8(0x8)
	Class StaticMeshComponent*                                   shp_skl_treasure_hatch_01_a;                       // 0x6f0(0x8)
	Class StaticMeshComponent*                                   StaticMesh54;                                      // 0x6f8(0x8)
	Class StaticMeshComponent*                                   StaticMesh56;                                      // 0x700(0x8)
	Class StaticMeshComponent*                                   StaticMesh55;                                      // 0x708(0x8)
	Class StaticMeshComponent*                                   rope_interior;                                     // 0x710(0x8)
	Class StaticMeshComponent*                                   StaticMesh89;                                      // 0x718(0x8)
	Class StaticMeshComponent*                                   StaticMesh53;                                      // 0x720(0x8)
	Class StaticMeshComponent*                                   StaticMesh52;                                      // 0x728(0x8)
	Class StaticMeshComponent*                                   StaticMesh57;                                      // 0x730(0x8)
	Class StaticMeshComponent*                                   StaticMesh61;                                      // 0x738(0x8)
	Class StaticMeshComponent*                                   StaticMesh60;                                      // 0x740(0x8)
	Class StaticMeshComponent*                                   StaticMesh59;                                      // 0x748(0x8)
	Class StaticMeshComponent*                                   StaticMesh58;                                      // 0x750(0x8)
	Class StaticMeshComponent*                                   StaticMesh62;                                      // 0x758(0x8)
	Class StaticMeshComponent*                                   StaticMesh65;                                      // 0x760(0x8)
	Class StaticMeshComponent*                                   StaticMesh64;                                      // 0x768(0x8)
	Class StaticMeshComponent*                                   StaticMesh67;                                      // 0x770(0x8)
	Class StaticMeshComponent*                                   StaticMesh70;                                      // 0x778(0x8)
	Class StaticMeshComponent*                                   StaticMesh69;                                      // 0x780(0x8)
	Class StaticMeshComponent*                                   StaticMesh68;                                      // 0x788(0x8)
	Class StaticMeshComponent*                                   StaticMesh71;                                      // 0x790(0x8)
	Class StaticMeshComponent*                                   StaticMesh72;                                      // 0x798(0x8)
	Class StaticMeshComponent*                                   StaticMesh73;                                      // 0x7a0(0x8)
	Class StaticMeshComponent*                                   StaticMesh75;                                      // 0x7a8(0x8)
	Class StaticMeshComponent*                                   StaticMesh76;                                      // 0x7b0(0x8)
	Class StaticMeshComponent*                                   StaticMesh78;                                      // 0x7b8(0x8)
	Class StaticMeshComponent*                                   StaticMesh81;                                      // 0x7c0(0x8)
	Class StaticMeshComponent*                                   StaticMesh83;                                      // 0x7c8(0x8)
	Class StaticMeshComponent*                                   StaticMesh85;                                      // 0x7d0(0x8)
	Class StaticMeshComponent*                                   StaticMesh88;                                      // 0x7d8(0x8)
	Class StaticMeshComponent*                                   StaticMesh87;                                      // 0x7e0(0x8)
	Class StaticMeshComponent*                                   StaticMesh86;                                      // 0x7e8(0x8)
	Class StaticMeshComponent*                                   StaticMesh90;                                      // 0x7f0(0x8)
	Class StaticMeshComponent*                                   StaticMesh100;                                     // 0x7f8(0x8)
	Class StaticMeshComponent*                                   StaticMesh101;                                     // 0x800(0x8)
	Class StaticMeshComponent*                                   StaticMesh123;                                     // 0x808(0x8)
	Class StaticMeshComponent*                                   StaticMesh125;                                     // 0x810(0x8)
	Class StaticMeshComponent*                                   StaticMesh127;                                     // 0x818(0x8)
	Class StaticMeshComponent*                                   StaticMesh126;                                     // 0x820(0x8)
	Class StaticMeshComponent*                                   cabin_door;                                        // 0x828(0x8)
	Class StaticMeshComponent*                                   Wheel;                                             // 0x830(0x8)
	Class StaticMeshComponent*                                   bon_skelly_arm_R_01_c;                             // 0x838(0x8)
	Class StaticMeshComponent*                                   bon_skelly_leg_R_01_c;                             // 0x840(0x8)
	Class StaticMeshComponent*                                   bon_skelly_ribcage_01_a1;                          // 0x848(0x8)
	Class StaticMeshComponent*                                   cmn_skeleton_head_01_b;                            // 0x850(0x8)
	Class StaticMeshComponent*                                   bon_skelly__leg_R_02_d;                            // 0x858(0x8)
	Class StaticMeshComponent*                                   bon_skelly__ribcage_02_b;                          // 0x860(0x8)
	Class StaticMeshComponent*                                   cmn_skeleton_head_boar_01_a1;                      // 0x868(0x8)
	Class StaticMeshComponent*                                   cmn_skeleton_head_boar_01_a;                       // 0x870(0x8)
	Class StaticMeshComponent*                                   bon_skelly__skull_02_c;                            // 0x878(0x8)
	Class StaticMeshComponent*                                   bon_skelly_ribcage_01_a;                           // 0x880(0x8)
	Class StaticMeshComponent*                                   bld_shop_ribcage_oos_01_a;                         // 0x888(0x8)
	Class StaticMeshComponent*                                   StaticMesh178;                                     // 0x890(0x8)
	Class StaticMeshComponent*                                   StaticMesh158;                                     // 0x898(0x8)
	Class StaticMeshComponent*                                   StaticMesh157;                                     // 0x8a0(0x8)
	Class StaticMeshComponent*                                   StaticMesh156;                                     // 0x8a8(0x8)
	Class StaticMeshComponent*                                   StaticMesh155;                                     // 0x8b0(0x8)
	Class StaticMeshComponent*                                   StaticMesh154;                                     // 0x8b8(0x8)
	Class StaticMeshComponent*                                   StaticMesh153;                                     // 0x8c0(0x8)
	Class StaticMeshComponent*                                   StaticMesh140;                                     // 0x8c8(0x8)
	Class StaticMeshComponent*                                   StaticMesh150;                                     // 0x8d0(0x8)
	Class StaticMeshComponent*                                   StaticMesh149;                                     // 0x8d8(0x8)
	Class StaticMeshComponent*                                   StaticMesh148;                                     // 0x8e0(0x8)
	Class StaticMeshComponent*                                   StaticMesh147;                                     // 0x8e8(0x8)
	Class StaticMeshComponent*                                   StaticMesh145;                                     // 0x8f0(0x8)
	Class StaticMeshComponent*                                   StaticMesh152;                                     // 0x8f8(0x8)
	Class StaticMeshComponent*                                   StaticMesh164;                                     // 0x900(0x8)
	Class StaticMeshComponent*                                   StaticMesh177;                                     // 0x908(0x8)
	Class StaticMeshComponent*                                   rope_broken_mast;                                  // 0x910(0x8)
	Class StaticMeshComponent*                                   cmn_skeleton_head_boar_01_a2;                      // 0x918(0x8)
	Class StaticMeshComponent*                                   StaticMesh207;                                     // 0x920(0x8)
	Class StaticMeshComponent*                                   StaticMesh206;                                     // 0x928(0x8)
	Class StaticMeshComponent*                                   StaticMesh205;                                     // 0x930(0x8)
	Class StaticMeshComponent*                                   StaticMesh204;                                     // 0x938(0x8)
	Class StaticMeshComponent*                                   StaticMesh203;                                     // 0x940(0x8)
	Class StaticMeshComponent*                                   StaticMesh202;                                     // 0x948(0x8)
	Class StaticMeshComponent*                                   StaticMesh201;                                     // 0x950(0x8)
	Class StaticMeshComponent*                                   StaticMesh200;                                     // 0x958(0x8)
	Class StaticMeshComponent*                                   StaticMesh199;                                     // 0x960(0x8)
	Class StaticMeshComponent*                                   StaticMesh198;                                     // 0x968(0x8)
	Class StaticMeshComponent*                                   StaticMesh197;                                     // 0x970(0x8)
	Class StaticMeshComponent*                                   StaticMesh196;                                     // 0x978(0x8)
	Class StaticMeshComponent*                                   StaticMesh195;                                     // 0x980(0x8)
	Class StaticMeshComponent*                                   StaticMesh194;                                     // 0x988(0x8)
	Class StaticMeshComponent*                                   StaticMesh179;                                     // 0x990(0x8)
	Class StaticMeshComponent*                                   StaticMesh192;                                     // 0x998(0x8)
	Class StaticMeshComponent*                                   StaticMesh191;                                     // 0x9a0(0x8)
	Class StaticMeshComponent*                                   StaticMesh190;                                     // 0x9a8(0x8)
	Class StaticMeshComponent*                                   StaticMesh189;                                     // 0x9b0(0x8)
	Class StaticMeshComponent*                                   StaticMesh188;                                     // 0x9b8(0x8)
	Class StaticMeshComponent*                                   StaticMesh187;                                     // 0x9c0(0x8)
	Class StaticMeshComponent*                                   StaticMesh186;                                     // 0x9c8(0x8)
	Class StaticMeshComponent*                                   StaticMesh185;                                     // 0x9d0(0x8)
	Class StaticMeshComponent*                                   StaticMesh184;                                     // 0x9d8(0x8)
	Class StaticMeshComponent*                                   StaticMesh183;                                     // 0x9e0(0x8)
	Class StaticMeshComponent*                                   StaticMesh182;                                     // 0x9e8(0x8)
	Class StaticMeshComponent*                                   StaticMesh181;                                     // 0x9f0(0x8)
	Class StaticMeshComponent*                                   StaticMesh180;                                     // 0x9f8(0x8)
	Class StaticMeshComponent*                                   StaticMesh193;                                     // 0xa00(0x8)
	Class StaticMeshComponent*                                   StaticMesh218;                                     // 0xa08(0x8)
	Class StaticMeshComponent*                                   StaticMesh44;                                      // 0xa10(0x8)
	Class StaticMeshComponent*                                   StaticMesh37;                                      // 0xa18(0x8)
	Class StaticMeshComponent*                                   StaticMesh33;                                      // 0xa20(0x8)
	Class StaticMeshComponent*                                   StaticMesh32;                                      // 0xa28(0x8)
	Class StaticMeshComponent*                                   StaticMesh31;                                      // 0xa30(0x8)
	Class StaticMeshComponent*                                   StaticMesh23;                                      // 0xa38(0x8)
	Class StaticMeshComponent*                                   bon_skelly_skull_01_b;                             // 0xa40(0x8)
	Class StaticMeshComponent*                                   bon_skelly_leg_L_01_a;                             // 0xa48(0x8)
	Class StaticMeshComponent*                                   Rug;                                               // 0xa50(0x8)
	Class MergedStaticMeshComponent*                             MERGED_NO_COLLISION;                               // 0xa58(0x8)
	Class StaticMeshComponent*                                   StaticMesh129;                                     // 0xa60(0x8)
	Class StaticMeshComponent*                                   StaticMesh128;                                     // 0xa68(0x8)
	Class StaticMeshComponent*                                   StaticMesh47;                                      // 0xa70(0x8)
	Class StaticMeshComponent*                                   Rudder;                                            // 0xa78(0x8)
	Class StaticMeshComponent*                                   mast_platform;                                     // 0xa80(0x8)
	Class StaticMeshComponent*                                   Figurehead;                                        // 0xa88(0x8)
	Class StaticMeshComponent*                                   sterncastle_mast;                                  // 0xa90(0x8)
	Class StaticMeshComponent*                                   crows_nest;                                        // 0xa98(0x8)
	Class StaticMeshComponent*                                   StaticMesh40;                                      // 0xaa0(0x8)
	Class StaticMeshComponent*                                   StaticMesh45;                                      // 0xaa8(0x8)
	Class StaticMeshComponent*                                   StaticMesh43;                                      // 0xab0(0x8)
	Class StaticMeshComponent*                                   StaticMesh42;                                      // 0xab8(0x8)
	Class StaticMeshComponent*                                   StaticMesh41;                                      // 0xac0(0x8)
	Class StaticMeshComponent*                                   StaticMesh46;                                      // 0xac8(0x8)
	Class StaticMeshComponent*                                   StaticMesh48;                                      // 0xad0(0x8)
	Class StaticMeshComponent*                                   StaticMesh51;                                      // 0xad8(0x8)
	Class StaticMeshComponent*                                   StaticMesh50;                                      // 0xae0(0x8)
	Class StaticMeshComponent*                                   StaticMesh49;                                      // 0xae8(0x8)
	Class StaticMeshComponent*                                   StaticMesh63;                                      // 0xaf0(0x8)
	Class StaticMeshComponent*                                   main_deck;                                         // 0xaf8(0x8)
	Class StaticMeshComponent*                                   shp_shipwreck_mast_01_c;                           // 0xb00(0x8)
	Class StaticMeshComponent*                                   StaticMesh99;                                      // 0xb08(0x8)
	Class StaticMeshComponent*                                   StaticMesh98;                                      // 0xb10(0x8)
	Class StaticMeshComponent*                                   StaticMesh97;                                      // 0xb18(0x8)
	Class StaticMeshComponent*                                   StaticMesh96;                                      // 0xb20(0x8)
	Class StaticMeshComponent*                                   StaticMesh94;                                      // 0xb28(0x8)
	Class StaticMeshComponent*                                   StaticMesh93;                                      // 0xb30(0x8)
	Class StaticMeshComponent*                                   StaticMesh92;                                      // 0xb38(0x8)
	Class StaticMeshComponent*                                   StaticMesh91;                                      // 0xb40(0x8)
	Class StaticMeshComponent*                                   StaticMesh95;                                      // 0xb48(0x8)
	Class StaticMeshComponent*                                   StaticMesh116;                                     // 0xb50(0x8)
	Class StaticMeshComponent*                                   StaticMesh115;                                     // 0xb58(0x8)
	Class StaticMeshComponent*                                   StaticMesh114;                                     // 0xb60(0x8)
	Class StaticMeshComponent*                                   StaticMesh113;                                     // 0xb68(0x8)
	Class StaticMeshComponent*                                   StaticMesh112;                                     // 0xb70(0x8)
	Class StaticMeshComponent*                                   StaticMesh111;                                     // 0xb78(0x8)
	Class StaticMeshComponent*                                   StaticMesh102;                                     // 0xb80(0x8)
	Class StaticMeshComponent*                                   StaticMesh109;                                     // 0xb88(0x8)
	Class StaticMeshComponent*                                   StaticMesh108;                                     // 0xb90(0x8)
	Class StaticMeshComponent*                                   StaticMesh107;                                     // 0xb98(0x8)
	Class StaticMeshComponent*                                   StaticMesh106;                                     // 0xba0(0x8)
	Class StaticMeshComponent*                                   StaticMesh105;                                     // 0xba8(0x8)
	Class StaticMeshComponent*                                   StaticMesh104;                                     // 0xbb0(0x8)
	Class StaticMeshComponent*                                   StaticMesh103;                                     // 0xbb8(0x8)
	Class StaticMeshComponent*                                   StaticMesh110;                                     // 0xbc0(0x8)
	Class StaticMeshComponent*                                   walk_plank_broken;                                 // 0xbc8(0x8)
	Class StaticMeshComponent*                                   mast_crossbeam;                                    // 0xbd0(0x8)
	Class StaticMeshComponent*                                   walk_plank;                                        // 0xbd8(0x8)
	Class StaticMeshComponent*                                   cmn_barrel_salvage_01_d2;                          // 0xbe0(0x8)
	Class StaticMeshComponent*                                   bld_shop_skull_barrel_oos_01_a5;                   // 0xbe8(0x8)
	Class StaticMeshComponent*                                   StaticMesh21;                                      // 0xbf0(0x8)
	Class StaticMeshComponent*                                   cmn_barrel_debris_01_a;                            // 0xbf8(0x8)
	Class StaticMeshComponent*                                   bld_shop_skull_barrel_oos_01_a4;                   // 0xc00(0x8)
	Class StaticMeshComponent*                                   cmn_barrel_salvage_01_d1;                          // 0xc08(0x8)
	Class StaticMeshComponent*                                   cmn_barrel_salvage_top_half_01_a1;                 // 0xc10(0x8)
	Class StaticMeshComponent*                                   cmn_barrel_debris_04_a2;                           // 0xc18(0x8)
	Class StaticMeshComponent*                                   bld_shop_skull_barrel_oos_01_a6;                   // 0xc20(0x8)
	Class StaticMeshComponent*                                   cmn_barrel_salvage_01_d;                           // 0xc28(0x8)
	Class StaticMeshComponent*                                   bld_shop_skull_barrel_oos_01_a3;                   // 0xc30(0x8)
	Class StaticMeshComponent*                                   cmn_barrel_debris_04_a1;                           // 0xc38(0x8)
	Class StaticMeshComponent*                                   cmn_barrel_salvage_01_a1;                          // 0xc40(0x8)
	Class StaticMeshComponent*                                   cmn_barrel_salvage_01_c;                           // 0xc48(0x8)
	Class StaticMeshComponent*                                   cmn_barrel_salvage_01_a;                           // 0xc50(0x8)
	Class StaticMeshComponent*                                   cmn_barrel_salvage_01_b;                           // 0xc58(0x8)
	Class StaticMeshComponent*                                   bld_shop_skull_barrel_oos_01_a;                    // 0xc60(0x8)
	Class StaticMeshComponent*                                   StaticMesh122;                                     // 0xc68(0x8)
	Class StaticMeshComponent*                                   StaticMesh159;                                     // 0xc70(0x8)
	Class StaticMeshComponent*                                   brig_deck;                                         // 0xc78(0x8)
	Class StaticMeshComponent*                                   Map_Deck;                                          // 0xc80(0x8)
	Class StaticMeshComponent*                                   cell;                                              // 0xc88(0x8)
	Class StaticMeshComponent*                                   StaticMesh208;                                     // 0xc90(0x8)
	Class StaticMeshComponent*                                   StaticMesh213;                                     // 0xc98(0x8)
	Class StaticMeshComponent*                                   StaticMesh212;                                     // 0xca0(0x8)
	Class StaticMeshComponent*                                   StaticMesh211;                                     // 0xca8(0x8)
	Class StaticMeshComponent*                                   StaticMesh210;                                     // 0xcb0(0x8)
	Class StaticMeshComponent*                                   StaticMesh209;                                     // 0xcb8(0x8)
	Class StaticMeshComponent*                                   StaticMesh214;                                     // 0xcc0(0x8)
	Class StaticMeshComponent*                                   StaticMesh215;                                     // 0xcc8(0x8)
	Class StaticMeshComponent*                                   StaticMesh217;                                     // 0xcd0(0x8)
	Class StaticMeshComponent*                                   bld_shop_skull_barrel_oos_01_a9;                   // 0xcd8(0x8)
	Class StaticMeshComponent*                                   bld_shop_skull_barrel_oos_01_a2;                   // 0xce0(0x8)
	Class StaticMeshComponent*                                   StaticMesh30;                                      // 0xce8(0x8)
	Class StaticMeshComponent*                                   StaticMesh26;                                      // 0xcf0(0x8)
	Class StaticMeshComponent*                                   StaticMesh29;                                      // 0xcf8(0x8)
	Class StaticMeshComponent*                                   StaticMesh28;                                      // 0xd00(0x8)
	Class StaticMeshComponent*                                   StaticMesh27;                                      // 0xd08(0x8)
	Class StaticMeshComponent*                                   StaticMesh25;                                      // 0xd10(0x8)
	Class StaticMeshComponent*                                   StaticMesh24;                                      // 0xd18(0x8)
	Class StaticMeshComponent*                                   StaticMesh22;                                      // 0xd20(0x8)
	Class StaticMeshComponent*                                   cmn_wrecked_wheelbarrow_01_a;                      // 0xd28(0x8)
	Class StaticMeshComponent*                                   cmn_barrel_salvage_01_d3;                          // 0xd30(0x8)
	Class StaticMeshComponent*                                   cmn_barrel_debris_01_a1;                           // 0xd38(0x8)
	Class StaticMeshComponent*                                   cmn_barrel_salvage_01_a3;                          // 0xd40(0x8)
	Class StaticMeshComponent*                                   cmn_barrel_salvage_01_d6;                          // 0xd48(0x8)
	Class StaticMeshComponent*                                   cmn_barrel_salvage_01_d5;                          // 0xd50(0x8)
	Class StaticMeshComponent*                                   cmn_barrel_salvage_01_d4;                          // 0xd58(0x8)
	Class StaticMeshComponent*                                   cmn_barrel_debris_04_a3;                           // 0xd60(0x8)
	Class StaticMeshComponent*                                   bld_shop_skull_barrel_oos_01_a8;                   // 0xd68(0x8)
	Class StaticMeshComponent*                                   cmn_barrel_salvage_01_d11;                         // 0xd70(0x8)
	Class StaticMeshComponent*                                   cmn_barrel_salvage_01_d10;                         // 0xd78(0x8)
	Class StaticMeshComponent*                                   cmn_barrel_debris_04_a;                            // 0xd80(0x8)
	Class StaticMeshComponent*                                   cmn_barrel_salvage_01_d7;                          // 0xd88(0x8)
	Class StaticMeshComponent*                                   cmn_barrel_salvage_01_d12;                         // 0xd90(0x8)
	Class StaticMeshComponent*                                   cmn_barrel_debris_03_a;                            // 0xd98(0x8)
	Class StaticMeshComponent*                                   bld_shop_skull_barrel_oos_01_a7;                   // 0xda0(0x8)
	Class StaticMeshComponent*                                   Interior_Captains_Cabin;                           // 0xda8(0x8)
	Class StaticMeshComponent*                                   Chair;                                             // 0xdb0(0x8)
	Class StaticMeshComponent*                                   book_stand;                                        // 0xdb8(0x8)
	Class StaticMeshComponent*                                   shelves;                                           // 0xdc0(0x8)
	Class StaticMeshComponent*                                   Bed;                                               // 0xdc8(0x8)
	Class StaticMeshComponent*                                   Table;                                             // 0xdd0(0x8)
	Class StaticMeshComponent*                                   shelf;                                             // 0xdd8(0x8)
	Class StaticMeshComponent*                                   barrel_broken1;                                    // 0xde0(0x8)
	Class StaticMeshComponent*                                   barrel_broken;                                     // 0xde8(0x8)
	Class StaticMeshComponent*                                   Barrel1;                                           // 0xdf0(0x8)
	Class MergedStaticMeshComponent*                             MERGED_COLLISION;                                  // 0xdf8(0x8)
	Class StaticMeshComponent*                                   RAIN_OCCLUSION;                                    // 0xe00(0x8)
	Class StaticMeshComponent*                                   staircase_01;                                      // 0xe08(0x8)
	Class StaticMeshComponent*                                   staircase_02;                                      // 0xe10(0x8)
	Class SceneComponent*                                        DefaultSceneRoot;                                  // 0xe18(0x8)
	float                                                        WetEffectDuration;                                 // 0xe20(0x4)
	Class MaterialInstanceDynamic*                               WetDynamicMaterial;                                // 0xe28(0x8)
	Struct TimerHandle                                           WetTimerHandle;                                    // 0xe30(0x4)
	TArray<class SailMeshes*>                                    SailMeshes;                                        // 0xe38(0x10)
	Class MaterialInstanceDynamic*                               CurrentMaterial;                                   // 0xe48(0x8)
};


}