// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0xc0
class BP_SmallShip_StandardHull_Art_C: public Actor
{
public:
	Class HitRegSnapshotRedirectImpactToReplicatedMovementAttachParentCom* None;                                              // 0x3d0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x3d8(0x8)
	Class PostProcessComponent*                                  None;                                              // 0x3e0(0x8)
	Class BoxComponent*                                          None;                                              // 0x3e8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x3f0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x3f8(0x8)
	Class SurfaceWaterComponent*                                 None;                                              // 0x400(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x408(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x410(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x418(0x8)
	Class PostProcessComponent*                                  None;                                              // 0x420(0x8)
	Class BoxComponent*                                          None;                                              // 0x428(0x8)
	Class PostProcessComponent*                                  None;                                              // 0x430(0x8)
	Class BoxComponent*                                          None;                                              // 0x438(0x8)
	Class PostProcessComponent*                                  None;                                              // 0x440(0x8)
	Class BoxComponent*                                          None;                                              // 0x448(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x450(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x458(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x460(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x468(0x8)
	Class MergedStaticMeshComponent*                             None;                                              // 0x470(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x478(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x480(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x488(0x8)
};


// Size 0x38
class BP_SmallShip_StandardHull_Art_Interior_Lower_Deck_C: public Actor
{
public:
	Class HitRegSnapshotRedirectImpactToReplicatedMovementAttachParentCom* None;                                              // 0x3d0(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x3d8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x3e0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x3e8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x3f0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x3f8(0x8)
	Class SceneComponent*                                        None;                                              // 0x400(0x8)
};


}