// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x140
class BP_shop_mrh_01_a_C: public Actor
{
public:
	bool                                                         None;                                              // 0xe9(0x1)
	TArray<class None*>                                          None;                                              // 0xf0(0x10)
	bool                                                         None;                                              // 0x100(0x1)
	bool                                                         None;                                              // 0x101(0x1)
	int                                                          None;                                              // 0x104(0x4)
	bool                                                         None;                                              // 0x108(0x1)
	Class Actor*                                                 None;                                              // 0x110(0x8)
	bool                                                         None;                                              // 0x118(0x1)
	int                                                          None;                                              // 0x11c(0x4)
	bool                                                         None;                                              // 0x120(0x1)
	Struct FString                                               None;                                              // 0x128(0x10)
	TArray<class None*>                                          None;                                              // 0x138(0x10)
	Struct FString                                               None;                                              // 0x148(0x10)
	Struct FString                                               None;                                              // 0x158(0x10)
	bool                                                         None;                                              // 0x168(0x1)
	Class Actor*                                                 None;                                              // 0x170(0x8)
};


}