// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x40
class BP_ShipwreckHull_Audio_A_C: public ShipwreckHullAudio
{
public:
	Class ShipwreckAudioEmitterComponent*                        ShipwreckAudioEmitter7;                            // 0x3e8(0x8)
	Class ShipwreckAudioEmitterComponent*                        ShipwreckAudioEmitter6;                            // 0x3f0(0x8)
	Class ShipwreckAudioEmitterComponent*                        ShipwreckAudioEmitter5;                            // 0x3f8(0x8)
	Class ShipwreckAudioEmitterComponent*                        ShipwreckAudioEmitter4;                            // 0x400(0x8)
	Class ShipwreckAudioEmitterComponent*                        ShipwreckAudioEmitter3;                            // 0x408(0x8)
	Class ShipwreckAudioEmitterComponent*                        ShipwreckAudioEmitter2;                            // 0x410(0x8)
	Class ShipwreckAudioEmitterComponent*                        ShipwreckAudioEmitter1;                            // 0x418(0x8)
	Class ShipwreckAudioEmitterComponent*                        ShipwreckAudioEmitter;                             // 0x420(0x8)
};


}