// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x68
class BP_SmallShip_Mast_C: public BP_Mast_C
{
public:
	Struct PointerToUberGraphFrame                               UberGraphFrame;                                    // 0xa20(0x8)
	Class ChildActorComponent*                                   BP_MastEmissaryFlag;                               // 0xa28(0x8)
	Class StaticMeshComponent*                                   shp_flag_pennant_alliance_01_a;                    // 0xa30(0x8)
	Class StaticMeshComponent*                                   shp_flag_jolly_roger_01_a;                         // 0xa38(0x8)
	Class ChildActorComponent*                                   BP_Bell;                                           // 0xa40(0x8)
	Class ChildActorComponent*                                   Ladder;                                            // 0xa48(0x8)
	Class StaticMeshComponent*                                   WeldedCrowsNestPhysics;                            // 0xa50(0x8)
	Class StaticMeshComponent*                                   WeldedMastPhysics;                                 // 0xa58(0x8)
	Class StaticMeshComponent*                                   shp_mast_ladder_step_01_a;                         // 0xa60(0x8)
	Class StaticMeshComponent*                                   shp_small_mast_bell_support_01_a;                  // 0xa68(0x8)
	Class ChildActorComponent*                                   BP_Bell1;                                          // 0xa70(0x8)
	Class ChildActorComponent*                                   BP_ShipFlagCustomizationChest;                     // 0xa78(0x8)
	Class StaticMeshComponent*                                   CrowsNest;                                         // 0xa80(0x8)
};


}