// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x40
class BP_SmallShip_QuestTable_C: public VoyageTable
{
public:
	Class ChildActorComponent*                                   None;                                              // 0x770(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x778(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x780(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x788(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x790(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x798(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x7a0(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x7a8(0x8)
};


}