// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x2b8
class BP_SmallShipTemplate_C: public Ship
{
public:
	Class ChildActorComponent*                                   None;                                              // 0x1570(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x1578(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x1580(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x1588(0x8)
	Class ShipStorageJettisonComponent*                          None;                                              // 0x1590(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x1598(0x8)
	BlueprintGeneratedClass BP_BedComponent_C*                   None;                                              // 0x15a0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x15a8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x15b0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x15b8(0x8)
	Class RatManagerComponent*                                   None;                                              // 0x15c0(0x8)
	BlueprintGeneratedClass BP_SeatComponent_C*                  None;                                              // 0x15c8(0x8)
	BlueprintGeneratedClass BP_SeatComponent_C*                  None;                                              // 0x15d0(0x8)
	BlueprintGeneratedClass BP_SeatComponent_C*                  None;                                              // 0x15d8(0x8)
	BlueprintGeneratedClass BP_SeatComponent_C*                  None;                                              // 0x15e0(0x8)
	BlueprintGeneratedClass BP_SeatComponent_C*                  None;                                              // 0x15e8(0x8)
	BlueprintGeneratedClass BP_SeatComponent_C*                  None;                                              // 0x15f0(0x8)
	BlueprintGeneratedClass BP_SeatComponent_C*                  None;                                              // 0x15f8(0x8)
	BlueprintGeneratedClass BP_SeatComponent_C*                  None;                                              // 0x1600(0x8)
	BlueprintGeneratedClass BP_SeatComponent_C*                  None;                                              // 0x1608(0x8)
	BlueprintGeneratedClass BP_SeatComponent_C*                  None;                                              // 0x1610(0x8)
	BlueprintGeneratedClass BP_SeatComponent_C*                  None;                                              // 0x1618(0x8)
	Class ArrowComponent*                                        None;                                              // 0x1620(0x8)
	BlueprintGeneratedClass BP_SeatComponent_C*                  None;                                              // 0x1628(0x8)
	Class AIRegionComponent*                                     None;                                              // 0x1630(0x8)
	Class NamedPointsComponent*                                  None;                                              // 0x1638(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x1640(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x1648(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x1650(0x8)
	Class EmissaryFlotsamItemSpawnComponent*                     None;                                              // 0x1658(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x1660(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x1668(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x1670(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x1678(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x1680(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x1688(0x8)
	Class PetHangoutSpotComponent*                               None;                                              // 0x1690(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x1698(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x16a0(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x16a8(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x16b0(0x8)
	Class ShipTelemetryComponent*                                None;                                              // 0x16b8(0x8)
	Class RiggingSystemComponent*                                None;                                              // 0x16c0(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x16c8(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x16d0(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x16d8(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x16e0(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x16e8(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x16f0(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x16f8(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x1700(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x1708(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x1710(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x1718(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x1720(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x1728(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x1730(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x1738(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x1740(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x1748(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x1750(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x1758(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x1760(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x1768(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x1770(0x8)
	Class BoxComponent*                                          None;                                              // 0x1778(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x1780(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x1788(0x8)
	Class TeleportLocationComponent*                             None;                                              // 0x1790(0x8)
	Class TeleportLocationComponent*                             None;                                              // 0x1798(0x8)
	Class TeleportLocationComponent*                             None;                                              // 0x17a0(0x8)
	Class TeleportLocationComponent*                             None;                                              // 0x17a8(0x8)
	Class RiggingSystemComponent*                                None;                                              // 0x17b0(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x17b8(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x17c0(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x17c8(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x17d0(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x17d8(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x17e0(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x17e8(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x17f0(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x17f8(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x1800(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x1808(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x1810(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x1818(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x1820(0x8)
};


}