// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x8
class BP_ShadyWeaponShop_C: public ShopkeeperInteractionProxy
{
public:
	Class SceneComponent*                                        None;                                              // 0x480(0x8)
};


// Size 0x8
class BP_ShadyEquipmentShop_C: public ShopkeeperInteractionProxy
{
public:
	Class SceneComponent*                                        None;                                              // 0x480(0x8)
};


// Size 0x8
class BP_ShadyShipwrightShop_C: public ShopkeeperInteractionProxy
{
public:
	Class SceneComponent*                                        None;                                              // 0x480(0x8)
};


// Size 0x8
class BP_ShadyOrderOfSoulsShop_C: public ShopkeeperInteractionProxy
{
public:
	Class SceneComponent*                                        None;                                              // 0x480(0x8)
};


// Size 0x8
class BP_ShadyMerchantAllianceShop_C: public ShopkeeperInteractionProxy
{
public:
	Class SceneComponent*                                        None;                                              // 0x480(0x8)
};


// Size 0x8
class BP_ShadyGoldHoardersShop_C: public ShopkeeperInteractionProxy
{
public:
	Class SceneComponent*                                        None;                                              // 0x480(0x8)
};


// Size 0x8
class BP_ShadyEmporiumShop_C: public ShopkeeperInteractionProxy
{
public:
	Class SceneComponent*                                        None;                                              // 0x480(0x8)
};


// Size 0x8
class BP_ShadyClothingShop_C: public ShopkeeperInteractionProxy
{
public:
	Class SceneComponent*                                        None;                                              // 0x480(0x8)
};


}