// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x55
class BP_SmallMapTable_C: public MapTable
{
public:
	Struct PointerToUberGraphFrame                               None;                                              // 0x778(0x8)
	Class HitRegSnapshotRedirectImpactToReplicatedMovementAttachParentCom* None;                                              // 0x780(0x8)
	Class BoxComponent*                                          None;                                              // 0x788(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x790(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x798(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x7a0(0x8)
	Class ChildActorComponent*                                   None;                                              // 0x7a8(0x8)
	Class TextureFeedbackComponent*                              None;                                              // 0x7b0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x7b8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x7c0(0x8)
	float                                                        None;                                              // 0x7c8(0x4)
	bool                                                         None;                                              // 0x7cc(0x1)
};


}