// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x298
class BP_SmallShipTemplate_C: public Ship
{
public:
	Class ShipStorageJettisonComponent*                          ShipStorageJettison;                               // 0x1570(0x8)
	Class ChildActorComponent*                                   BP_LargeShip_QuestTable;                           // 0x1578(0x8)
	BlueprintGeneratedClass BP_BedComponent_C*                   BP_BedComponent;                                   // 0x1580(0x8)
	Class StaticMeshComponent*                                   Rat3;                                              // 0x1588(0x8)
	Class StaticMeshComponent*                                   Rat2;                                              // 0x1590(0x8)
	Class StaticMeshComponent*                                   Rat1;                                              // 0x1598(0x8)
	Class RatManagerComponent*                                   RatManager;                                        // 0x15a0(0x8)
	BlueprintGeneratedClass BP_SeatComponent_C*                  Seat_MapTable;                                     // 0x15a8(0x8)
	BlueprintGeneratedClass BP_SeatComponent_C*                  Seat_MapTable;                                     // 0x15b0(0x8)
	BlueprintGeneratedClass BP_SeatComponent_C*                  Seat_Barrel_Top;                                   // 0x15b8(0x8)
	BlueprintGeneratedClass BP_SeatComponent_C*                  Seat_Front_Starboard;                              // 0x15c0(0x8)
	BlueprintGeneratedClass BP_SeatComponent_C*                  Seat_Front_Port;                                   // 0x15c8(0x8)
	BlueprintGeneratedClass BP_SeatComponent_C*                  Seat_Side_Starboard;                               // 0x15d0(0x8)
	BlueprintGeneratedClass BP_SeatComponent_C*                  Seat_Side_Port;                                    // 0x15d8(0x8)
	BlueprintGeneratedClass BP_SeatComponent_C*                  Seat_Bottom_Barrel;                                // 0x15e0(0x8)
	BlueprintGeneratedClass BP_SeatComponent_C*                  Seat_Bottom_Port;                                  // 0x15e8(0x8)
	BlueprintGeneratedClass BP_SeatComponent_C*                  Seat_Bottom_Starboard;                             // 0x15f0(0x8)
	BlueprintGeneratedClass BP_SeatComponent_C*                  Seat_Top_Rear;                                     // 0x15f8(0x8)
	Class ArrowComponent*                                        Arrow;                                             // 0x1600(0x8)
	BlueprintGeneratedClass BP_SeatComponent_C*                  Seat_Top_Rear;                                     // 0x1608(0x8)
	Class AIRegionComponent*                                     AIRegion;                                          // 0x1610(0x8)
	Class NamedPointsComponent*                                  NamedPoints;                                       // 0x1618(0x8)
	Class StaticMeshComponent*                                   shp_small_ladder_gap_hits_01_a;                    // 0x1620(0x8)
	Class StaticMeshComponent*                                   shp_flag_hole_01_a;                                // 0x1628(0x8)
	Class ChildActorComponent*                                   BP_EmissaryFlag;                                   // 0x1630(0x8)
	Class EmissaryFlotsamItemSpawnComponent*                     EmissaryFlotsamItemSpawner;                        // 0x1638(0x8)
	Class ChildActorComponent*                                   BP_LargeShip_CageLatch_03_b;                       // 0x1640(0x8)
	Class ChildActorComponent*                                   BP_SmallShip_WindowHatchRight;                     // 0x1648(0x8)
	Class ChildActorComponent*                                   BP_SmallShip_WindowHatchLeft;                      // 0x1650(0x8)
	Class ChildActorComponent*                                   BP_WaterBarrel;                                    // 0x1658(0x8)
	Class ChildActorComponent*                                   BP_Shroudbreaker;                                  // 0x1660(0x8)
	Class ChildActorComponent*                                   BP_ShipPetChest;                                   // 0x1668(0x8)
	Class PetHangoutSpotComponent*                               PetHangoutSpot;                                    // 0x1670(0x8)
	Class ChildActorComponent*                                   ShipStorageBarrel_Food;                            // 0x1678(0x8)
	Class ChildActorComponent*                                   BP_HarpoonLauncher1;                               // 0x1680(0x8)
	Class ChildActorComponent*                                   BP_HarpoonLauncher;                                // 0x1688(0x8)
	Class ChildActorComponent*                                   RowboatMountpoint;                                 // 0x1690(0x8)
	Class ShipTelemetryComponent*                                ShipTelemetry;                                     // 0x1698(0x8)
	Class RiggingSystemComponent*                                ControlsRigging;                                   // 0x16a0(0x8)
	Class ChildActorComponent*                                   BP_ShipVanityChest;                                // 0x16a8(0x8)
	Class ChildActorComponent*                                   BP_SmallShipLadder_02;                             // 0x16b0(0x8)
	Class ChildActorComponent*                                   Lanterns;                                          // 0x16b8(0x8)
	Class ChildActorComponent*                                   ShipStorageBarrel_LowerDeck9;                      // 0x16c0(0x8)
	Class ChildActorComponent*                                   ShipStorageBarrel_LowerDeck10;                     // 0x16c8(0x8)
	Class ChildActorComponent*                                   ShipStorageBarrel_LowerDeck8;                      // 0x16d0(0x8)
	Class ChildActorComponent*                                   ShipStorageBarrel_LowerDeck7;                      // 0x16d8(0x8)
	Class ChildActorComponent*                                   ShipStorageBarrel_Food;                            // 0x16e0(0x8)
	Class ChildActorComponent*                                   ShipStorageBarrel_Cannonball2;                     // 0x16e8(0x8)
	Class ChildActorComponent*                                   ShipStorageBarrel_Cannonball1;                     // 0x16f0(0x8)
	Class ChildActorComponent*                                   BP_EquipmentChest;                                 // 0x16f8(0x8)
	Class ChildActorComponent*                                   BP_ClothingChest;                                  // 0x1700(0x8)
	Class ChildActorComponent*                                   BP_WeaponsChest;                                   // 0x1708(0x8)
	Class ChildActorComponent*                                   ShipStorageBarrel_LowerDeck3;                      // 0x1710(0x8)
	Class ChildActorComponent*                                   BP_SmallMapTable;                                  // 0x1718(0x8)
	Class ChildActorComponent*                                   Capstan;                                           // 0x1720(0x8)
	Class ChildActorComponent*                                   GrogBarrel;                                        // 0x1728(0x8)
	Class ChildActorComponent*                                   MastMainSailAngleLeft;                             // 0x1730(0x8)
	Class ChildActorComponent*                                   ShipStorageBarrel_LowerDeck2;                      // 0x1738(0x8)
	Class ChildActorComponent*                                   ShipStorageBarrel_LowerDeck1;                      // 0x1740(0x8)
	Class ChildActorComponent*                                   ShipStorageBarrel_LowerDeck11;                     // 0x1748(0x8)
	Class ChildActorComponent*                                   ShipStorageBarrel_Wood;                            // 0x1750(0x8)
	Class BoxComponent*                                          RammingSpurZone;                                   // 0x1758(0x8)
	Class StaticMeshComponent*                                   shp_shark_hits_01_a;                               // 0x1760(0x8)
	Class ChildActorComponent*                                   BP_AmmoChest;                                      // 0x1768(0x8)
	Class TeleportLocationComponent*                             TeleportLocation_04;                               // 0x1770(0x8)
	Class TeleportLocationComponent*                             TeleportLocation_03;                               // 0x1778(0x8)
	Class TeleportLocationComponent*                             TeleportLocation_02;                               // 0x1780(0x8)
	Class TeleportLocationComponent*                             TeleportLocation_01;                               // 0x1788(0x8)
	Class RiggingSystemComponent*                                MainRigging;                                       // 0x1790(0x8)
	Class ChildActorComponent*                                   ShipsCompass;                                      // 0x1798(0x8)
	Class ChildActorComponent*                                   Figurehead;                                        // 0x17a0(0x8)
	Class ChildActorComponent*                                   CannonRight1;                                      // 0x17a8(0x8)
	Class ChildActorComponent*                                   CannonLeft1;                                       // 0x17b0(0x8)
	Class ChildActorComponent*                                   LadderStbd;                                        // 0x17b8(0x8)
	Class ChildActorComponent*                                   Hull;                                              // 0x17c0(0x8)
	Class ChildActorComponent*                                   MastMainSailAngleRight;                            // 0x17c8(0x8)
	Class ChildActorComponent*                                   MastMainSailHoistRight;                            // 0x17d0(0x8)
	Class ChildActorComponent*                                   MastMainSailHoistLeft;                             // 0x17d8(0x8)
	Class ChildActorComponent*                                   MastMain;                                          // 0x17e0(0x8)
	Class ChildActorComponent*                                   Anchor;                                            // 0x17e8(0x8)
	Class ChildActorComponent*                                   Rudder;                                            // 0x17f0(0x8)
	Class ChildActorComponent*                                   Wheel;                                             // 0x17f8(0x8)
	Class ChildActorComponent*                                   AudioBoat;                                         // 0x1800(0x8)
};


}