// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x38
class BP_TaleBook_SunkenCrystal_C: public VoyageProposalContainer
{
public:
};


// Size 0x38
class BP_TaleBook_LordsOfTheSea_C: public VoyageProposalContainer
{
public:
	Struct AnimNode_Root                                         None;                                              // 0x628(0x48)
	Struct AnimNode_HIKSolve                                     None;                                              // 0x670(0x80)
	Struct AnimNode_ConvertComponentToLocalSpace                 None;                                              // 0x6f0(0x48)
	Struct AnimNode_ConvertLocalToComponentSpace                 None;                                              // 0x738(0x48)
	Struct AnimNode_HIKLookAt                                    None;                                              // 0x780(0x88)
	Struct AnimNode_TransitionResult                             None;                                              // 0x808(0x40)
	Struct AnimNode_TransitionResult                             None;                                              // 0x848(0x40)
	Struct AnimNode_TransitionResult                             None;                                              // 0x888(0x40)
	Struct AnimNode_TransitionResult                             None;                                              // 0x8c8(0x40)
	Struct AnimNode_TransitionResult                             None;                                              // 0x908(0x40)
	Struct AnimNode_TransitionResult                             None;                                              // 0x948(0x40)
	Struct AnimNode_TransitionResult                             None;                                              // 0x988(0x40)
	Struct AnimNode_TransitionResult                             None;                                              // 0x9c8(0x40)
	Struct AnimNode_TransitionResult                             None;                                              // 0xa08(0x40)
	Struct AnimNode_TransitionResult                             None;                                              // 0xa48(0x40)
	Struct AnimNode_SequencePlayer                               None;                                              // 0xa88(0x60)
	Struct AnimNode_Root                                         None;                                              // 0xae8(0x48)
	Struct AnimNode_SequencePlayer                               None;                                              // 0xb30(0x60)
	Struct AnimNode_Root                                         None;                                              // 0xb90(0x48)
	Struct AnimNode_StateMachine                                 None;                                              // 0xbd8(0xa8)
	Struct AnimNode_Root                                         None;                                              // 0xc80(0x48)
	Struct AnimNode_SequencePlayer                               None;                                              // 0xcc8(0x60)
	Struct AnimNode_Root                                         None;                                              // 0xd28(0x48)
	Struct AnimNode_TransitionResult                             None;                                              // 0xd70(0x40)
	Struct AnimNode_TransitionResult                             None;                                              // 0xdb0(0x40)
	Struct AnimNode_SequencePlayer                               None;                                              // 0xdf0(0x60)
	Struct AnimNode_Root                                         None;                                              // 0xe50(0x48)
	Struct AnimNode_SequencePlayer                               None;                                              // 0xe98(0x60)
	Struct AnimNode_Root                                         None;                                              // 0xef8(0x48)
	Struct AnimNode_StateMachine                                 None;                                              // 0xf40(0xa8)
	Struct AnimNode_Root                                         None;                                              // 0xfe8(0x48)
	Struct AnimNode_SequencePlayer                               None;                                              // 0x1030(0x60)
	Struct AnimNode_Root                                         None;                                              // 0x1090(0x48)
	Struct AnimNode_TransitionResult                             None;                                              // 0x10d8(0x40)
	Struct AnimNode_TransitionResult                             None;                                              // 0x1118(0x40)
	Struct AnimNode_SequencePlayer                               None;                                              // 0x1158(0x60)
	Struct AnimNode_Root                                         None;                                              // 0x11b8(0x48)
	Struct AnimNode_SequencePlayer                               None;                                              // 0x1200(0x60)
	Struct AnimNode_Root                                         None;                                              // 0x1260(0x48)
	Struct AnimNode_StateMachine                                 None;                                              // 0x12a8(0xa8)
	Struct AnimNode_Root                                         None;                                              // 0x1350(0x48)
	Struct AnimNode_StateMachine                                 None;                                              // 0x1398(0xa8)
	Struct AnimNode_BlendListByBool                              None;                                              // 0x1440(0xb0)
	Struct AnimNode_Slot                                         None;                                              // 0x14f0(0x60)
	Struct AnimNode_BlendListByBool                              None;                                              // 0x1550(0xb0)
	Struct AnimNode_ApplyAdditive                                None;                                              // 0x1600(0x70)
	Struct AnimNode_Slot                                         None;                                              // 0x1670(0x60)
	Struct AnimNode_RefPose                                      None;                                              // 0x16d0(0x38)
	Struct AnimNode_SaveCachedPose                               None;                                              // 0x1708(0x90)
	Struct AnimNode_UseCachedPose                                None;                                              // 0x1798(0x48)
	Struct AnimNode_BlendListByBool                              None;                                              // 0x17e0(0xb0)
	Struct AnimNode_UseCachedPose                                None;                                              // 0x1890(0x48)
	Struct AnimNode_SequencePlayer                               None;                                              // 0x18d8(0x60)
	Struct AnimNode_SequencePlayer                               None;                                              // 0x1938(0x60)
	Struct Vector2D                                              None;                                              // 0x1998(0x8)
	bool                                                         None;                                              // 0x19a0(0x1)
	float                                                        None;                                              // 0x19a4(0x4)
	byte                                                         None;                                              // 0x19a8(0x1)
	float                                                        None;                                              // 0x19ac(0x4)
	float                                                        None;                                              // 0x19b0(0x4)
	bool                                                         None;                                              // 0x19b4(0x1)
};


// Size 0x38
class BP_TaleBook_DarkBrethren_C: public VoyageProposalContainer
{
public:
};


// Size -0x4115e0ac
class BP_TaleBook_CaptainsOfTheDamned_C: public None
{
public:
};


// Size 0x5d0006
class BP_TaleBook_APiratesLife_C: public None
{
public:
};


}