// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x48
class BP_TavernBoard_C: public TavernBoard
{
public:
	Struct PointerToUberGraphFrame                               None;                                              // 0x550(0x8)
	Class ParticleSystemComponent*                               None;                                              // 0x558(0x8)
	Class ParticleSystemComponent*                               None;                                              // 0x560(0x8)
	Class ParticleSystemComponent*                               None;                                              // 0x568(0x8)
	Class PointLightComponent*                                   None;                                              // 0x570(0x8)
	Class PointLightComponent*                                   None;                                              // 0x578(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x580(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x588(0x8)
	Class PlayerGeneratedMapsContainerComponent*                 None;                                              // 0x590(0x8)
};


}