// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x1a8
class BP_tavern_frontend_bar_01_a_C: public Actor
{
public:
	Class StaticMeshComponent*                                   bld_tvn_post_01_a;                                 // 0x3d0(0x8)
	Class StaticMeshComponent*                                   shp_rope_coil_03_a2;                               // 0x3d8(0x8)
	Class ParticleSystemComponent*                               ParticleSystem5;                                   // 0x3e0(0x8)
	Class ParticleSystemComponent*                               ParticleSystem2;                                   // 0x3e8(0x8)
	Class ParticleSystemComponent*                               ParticleSystem1;                                   // 0x3f0(0x8)
	Class StaticMeshComponent*                                   cmn_candle_01_c3;                                  // 0x3f8(0x8)
	Class StaticMeshComponent*                                   cmn_candle_01_a3;                                  // 0x400(0x8)
	Class StaticMeshComponent*                                   cmn_candle_01_e2;                                  // 0x408(0x8)
	Class StaticMeshComponent*                                   bld_tvn_bar_arches_01_a;                           // 0x410(0x8)
	Class ParticleSystemComponent*                               ParticleSystem;                                    // 0x418(0x8)
	Class StaticMeshComponent*                                   bld_tvn_bar_top_01_a;                              // 0x420(0x8)
	Class StaticMeshComponent*                                   cmn_wheel_01_a;                                    // 0x428(0x8)
	Class StaticMeshComponent*                                   tls_tankard_01_b2;                                 // 0x430(0x8)
	Class StaticMeshComponent*                                   tls_tankard_02_a2;                                 // 0x438(0x8)
	Class StaticMeshComponent*                                   tls_tankard_01_b1;                                 // 0x440(0x8)
	Class StaticMeshComponent*                                   tls_tankard_02_a;                                  // 0x448(0x8)
	Class StaticMeshComponent*                                   cmn_candle_01_e1;                                  // 0x450(0x8)
	Class StaticMeshComponent*                                   cmn_candle_01_c1;                                  // 0x458(0x8)
	Class StaticMeshComponent*                                   cmn_candle_01_c;                                   // 0x460(0x8)
	Class StaticMeshComponent*                                   cmn_candle_01_b;                                   // 0x468(0x8)
	Class StaticMeshComponent*                                   trs_plate_01_a6;                                   // 0x470(0x8)
	Class StaticMeshComponent*                                   trs_plate_01_a5;                                   // 0x478(0x8)
	Class StaticMeshComponent*                                   trs_plate_01_a4;                                   // 0x480(0x8)
	Class StaticMeshComponent*                                   trs_plate_01_a3;                                   // 0x488(0x8)
	Class StaticMeshComponent*                                   trs_plate_01_a2;                                   // 0x490(0x8)
	Class StaticMeshComponent*                                   trs_plate_01_a1;                                   // 0x498(0x8)
	Class StaticMeshComponent*                                   bld_tvn_bar_barrels_01_b2;                         // 0x4a0(0x8)
	Class StaticMeshComponent*                                   bld_tvn_bar_barrels_01_a1;                         // 0x4a8(0x8)
	Class StaticMeshComponent*                                   bld_tvn_bar_barrels_01_a;                          // 0x4b0(0x8)
	Class StaticMeshComponent*                                   bld_tvn_bar_barrels_01_b1;                         // 0x4b8(0x8)
	Class StaticMeshComponent*                                   bld_tvn_bar_barrels_01_b;                          // 0x4c0(0x8)
	Class StaticMeshComponent*                                   bld_tvn_bar_racks_01_a;                            // 0x4c8(0x8)
	Class StaticMeshComponent*                                   cmn_rowboat_oar_01_a;                              // 0x4d0(0x8)
	Class StaticMeshComponent*                                   gmp_bar_hide_01_a1;                                // 0x4d8(0x8)
	Class StaticMeshComponent*                                   cmn_stool_01_a2;                                   // 0x4e0(0x8)
	Class StaticMeshComponent*                                   bld_tvn_round_table_01_a;                          // 0x4e8(0x8)
	Class StaticMeshComponent*                                   bld_tvn_table_01_a;                                // 0x4f0(0x8)
	Class StaticMeshComponent*                                   cmn_rug_01_a1;                                     // 0x4f8(0x8)
	Class StaticMeshComponent*                                   bld_tvn_rug_01_a;                                  // 0x500(0x8)
	Class StaticMeshComponent*                                   bld_tvn_animal_rug_01_a;                           // 0x508(0x8)
	Class StaticMeshComponent*                                   bld_tvn_beam_sail_cloth_01_a;                      // 0x510(0x8)
	Class StaticMeshComponent*                                   bld_tvn_bar_base_01_a;                             // 0x518(0x8)
	Class StaticMeshComponent*                                   bld_tvn_post_01_c1;                                // 0x520(0x8)
	Class StaticMeshComponent*                                   bld_tvn_post_01_c;                                 // 0x528(0x8)
	Class StaticMeshComponent*                                   bld_shop_door_02_a1;                               // 0x530(0x8)
	Class StaticMeshComponent*                                   bld_shop_door_02_a;                                // 0x538(0x8)
	Class StaticMeshComponent*                                   bld_tvn_interior_stairs_01_b;                      // 0x540(0x8)
	Class StaticMeshComponent*                                   bld_tvn_fireplace_plinth_01_a;                     // 0x548(0x8)
	Class StaticMeshComponent*                                   bld_tvn_fireplace_grate_01_a;                      // 0x550(0x8)
	Class StaticMeshComponent*                                   bld_tvn_fireplace_rail_01_a;                       // 0x558(0x8)
	Class StaticMeshComponent*                                   bld_tvn_fireplace_surround_01_a;                   // 0x560(0x8)
	Class StaticMeshComponent*                                   bld_tavern_frontend_01_a;                          // 0x568(0x8)
	Class SceneComponent*                                        DefaultSceneRoot;                                  // 0x570(0x8)
};


}