// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x480
class BP_tavern_frontend_01_a_C: public Actor
{
public:
	Class StaticMeshComponent*                                   trs_chest_01_c_vc;                                 // 0x3d0(0x8)
	Class StaticMeshComponent*                                   trs_chest_01_b_vc;                                 // 0x3d8(0x8)
	Class StaticMeshComponent*                                   trs_chest_01_d_vc;                                 // 0x3e0(0x8)
	Class StaticMeshComponent*                                   trs_chest_01_a_vc;                                 // 0x3e8(0x8)
	Class StaticMeshComponent*                                   shp_rope_coil_03_a3;                               // 0x3f0(0x8)
	Class StaticMeshComponent*                                   bld_tvn_window_01_b1;                              // 0x3f8(0x8)
	Class StaticMeshComponent*                                   fod_rum_01_a;                                      // 0x400(0x8)
	Class ParticleSystemComponent*                               ParticleSystem24;                                  // 0x408(0x8)
	Class ParticleSystemComponent*                               ParticleSystem23;                                  // 0x410(0x8)
	Class ParticleSystemComponent*                               ParticleSystem22;                                  // 0x418(0x8)
	Class StaticMeshComponent*                                   cap_skull_candle_01_a;                             // 0x420(0x8)
	Class ParticleSystemComponent*                               ParticleSystem21;                                  // 0x428(0x8)
	Class ParticleSystemComponent*                               ParticleSystem18;                                  // 0x430(0x8)
	Class ParticleSystemComponent*                               ParticleSystem17;                                  // 0x438(0x8)
	Class ParticleSystemComponent*                               ParticleSystem15;                                  // 0x440(0x8)
	Class ParticleSystemComponent*                               ParticleSystem14;                                  // 0x448(0x8)
	Class ParticleSystemComponent*                               ParticleSystem12;                                  // 0x450(0x8)
	Class ParticleSystemComponent*                               ParticleSystem11;                                  // 0x458(0x8)
	Class ParticleSystemComponent*                               ParticleSystem10;                                  // 0x460(0x8)
	Class ParticleSystemComponent*                               ParticleSystem9;                                   // 0x468(0x8)
	Class ParticleSystemComponent*                               ParticleSystem8;                                   // 0x470(0x8)
	Class ParticleSystemComponent*                               ParticleSystem;                                    // 0x478(0x8)
	Class StaticMeshComponent*                                   StaticMesh3;                                       // 0x480(0x8)
	Class StaticMeshComponent*                                   StaticMesh2;                                       // 0x488(0x8)
	Class StaticMeshComponent*                                   StaticMesh1;                                       // 0x490(0x8)
	Class StaticMeshComponent*                                   StaticMesh;                                        // 0x498(0x8)
	Class StaticMeshComponent*                                   shp_rope_coil_02_a;                                // 0x4a0(0x8)
	Class StaticMeshComponent*                                   bld_enc_shop_pin_board_01_a;                       // 0x4a8(0x8)
	Class ParticleSystemComponent*                               ParticleSystem6;                                   // 0x4b0(0x8)
	Class StaticMeshComponent*                                   bld_int_wall_coat_rack_01_a;                       // 0x4b8(0x8)
	Class StaticMeshComponent*                                   gmp_crew_ledger_01_a;                              // 0x4c0(0x8)
	Class StaticMeshComponent*                                   shp_rope_coil_03_a2;                               // 0x4c8(0x8)
	Class StaticMeshComponent*                                   tls_tankard_01_b4;                                 // 0x4d0(0x8)
	Class StaticMeshComponent*                                   tls_tankard_01_b3;                                 // 0x4d8(0x8)
	Class StaticMeshComponent*                                   cmn_wooden_crate_01_b4;                            // 0x4e0(0x8)
	Class StaticMeshComponent*                                   gmp_parchment_scroll_01_b;                         // 0x4e8(0x8)
	Class StaticMeshComponent*                                   gmp_parchment_scroll_01_c;                         // 0x4f0(0x8)
	Class StaticMeshComponent*                                   bld_tvn_rug_01_a3;                                 // 0x4f8(0x8)
	Class StaticMeshComponent*                                   bld_shop_rug_01_a;                                 // 0x500(0x8)
	Class StaticMeshComponent*                                   bld_enc_shop_rug_01_a;                             // 0x508(0x8)
	Class ParticleSystemComponent*                               ParticleSystem5;                                   // 0x510(0x8)
	Class ParticleSystemComponent*                               ParticleSystem4;                                   // 0x518(0x8)
	Class ParticleSystemComponent*                               ParticleSystem3;                                   // 0x520(0x8)
	Class ParticleSystemComponent*                               ParticleSystem2;                                   // 0x528(0x8)
	Class ParticleSystemComponent*                               ParticleSystem1;                                   // 0x530(0x8)
	Class StaticMeshComponent*                                   cmn_candle_01_c3;                                  // 0x538(0x8)
	Class StaticMeshComponent*                                   cmn_candle_01_a3;                                  // 0x540(0x8)
	Class StaticMeshComponent*                                   cmn_candle_01_e2;                                  // 0x548(0x8)
	Class StaticMeshComponent*                                   bld_tvn_bar_arches_01_a;                           // 0x550(0x8)
	Class StaticMeshComponent*                                   bld_tvn_drapes_01_a;                               // 0x558(0x8)
	Class StaticMeshComponent*                                   wld_blackwyche_picture_01_a;                       // 0x560(0x8)
	Class StaticMeshComponent*                                   cap_wooden_plaque_01_a1;                           // 0x568(0x8)
	Class StaticMeshComponent*                                   bld_tvn_bar_top_01_a;                              // 0x570(0x8)
	Class StaticMeshComponent*                                   bld_tvn_animal_rug_01_a1;                          // 0x578(0x8)
	Class StaticMeshComponent*                                   cap_book_stand_01_a1;                              // 0x580(0x8)
	Class StaticMeshComponent*                                   bld_tvn_bench_01_a3;                               // 0x588(0x8)
	Class StaticMeshComponent*                                   cap_book_stand_01_a;                               // 0x590(0x8)
	Class StaticMeshComponent*                                   cmn_wheel_01_a;                                    // 0x598(0x8)
	Class StaticMeshComponent*                                   tls_tankard_01_b2;                                 // 0x5a0(0x8)
	Class StaticMeshComponent*                                   tls_tankard_02_a2;                                 // 0x5a8(0x8)
	Class StaticMeshComponent*                                   tls_tankard_01_b1;                                 // 0x5b0(0x8)
	Class StaticMeshComponent*                                   tls_tankard_01_b;                                  // 0x5b8(0x8)
	Class StaticMeshComponent*                                   tls_tankard_02_a1;                                 // 0x5c0(0x8)
	Class StaticMeshComponent*                                   tls_tankard_02_a;                                  // 0x5c8(0x8)
	Class StaticMeshComponent*                                   shp_kitchen_table_01_a1;                           // 0x5d0(0x8)
	Class StaticMeshComponent*                                   gmp_bar_hide_01_a6;                                // 0x5d8(0x8)
	Class StaticMeshComponent*                                   cmn_candle_01_e1;                                  // 0x5e0(0x8)
	Class StaticMeshComponent*                                   cmn_candle_01_c2;                                  // 0x5e8(0x8)
	Class StaticMeshComponent*                                   cmn_candle_01_e;                                   // 0x5f0(0x8)
	Class StaticMeshComponent*                                   cmn_candle_01_d;                                   // 0x5f8(0x8)
	Class StaticMeshComponent*                                   cmn_candle_01_a2;                                  // 0x600(0x8)
	Class StaticMeshComponent*                                   cmn_candle_01_c1;                                  // 0x608(0x8)
	Class StaticMeshComponent*                                   cmn_candle_01_c;                                   // 0x610(0x8)
	Class StaticMeshComponent*                                   cmn_candle_01_a;                                   // 0x618(0x8)
	Class StaticMeshComponent*                                   cmn_candle_01_b;                                   // 0x620(0x8)
	Class StaticMeshComponent*                                   cmn_stool_01_a4;                                   // 0x628(0x8)
	Class StaticMeshComponent*                                   shp_cook_pot_01_a;                                 // 0x630(0x8)
	Class StaticMeshComponent*                                   shp_rope_coil_03_a1;                               // 0x638(0x8)
	Class StaticMeshComponent*                                   shp_rope_coil_03_a;                                // 0x640(0x8)
	Class StaticMeshComponent*                                   trs_plate_01_a8;                                   // 0x648(0x8)
	Class StaticMeshComponent*                                   trs_plate_01_a7;                                   // 0x650(0x8)
	Class StaticMeshComponent*                                   trs_plate_01_a6;                                   // 0x658(0x8)
	Class StaticMeshComponent*                                   trs_plate_01_a5;                                   // 0x660(0x8)
	Class StaticMeshComponent*                                   trs_plate_01_a4;                                   // 0x668(0x8)
	Class StaticMeshComponent*                                   trs_plate_01_a3;                                   // 0x670(0x8)
	Class StaticMeshComponent*                                   trs_plate_01_a2;                                   // 0x678(0x8)
	Class StaticMeshComponent*                                   trs_plate_01_a1;                                   // 0x680(0x8)
	Class StaticMeshComponent*                                   trs_plate_01_a;                                    // 0x688(0x8)
	Class StaticMeshComponent*                                   bld_tvn_ceiling_rose_01_a1;                        // 0x690(0x8)
	Class StaticMeshComponent*                                   bld_tvn_ceiling_rose_01_a;                         // 0x698(0x8)
	Class StaticMeshComponent*                                   bld_tvn_chandelier_01_a1;                          // 0x6a0(0x8)
	Class StaticMeshComponent*                                   bld_tvn_chandelier_01_a;                           // 0x6a8(0x8)
	Class StaticMeshComponent*                                   bld_tvn_bar_barrels_01_b2;                         // 0x6b0(0x8)
	Class StaticMeshComponent*                                   bld_tvn_bar_barrels_01_a1;                         // 0x6b8(0x8)
	Class StaticMeshComponent*                                   bld_tvn_bar_barrels_01_a;                          // 0x6c0(0x8)
	Class StaticMeshComponent*                                   bld_tvn_bar_barrels_01_b1;                         // 0x6c8(0x8)
	Class StaticMeshComponent*                                   bld_tvn_bar_barrels_01_b;                          // 0x6d0(0x8)
	Class StaticMeshComponent*                                   bld_tvn_bar_racks_01_a;                            // 0x6d8(0x8)
	Class StaticMeshComponent*                                   cmn_wooden_crate_01_b3;                            // 0x6e0(0x8)
	Class StaticMeshComponent*                                   cmn_wooden_crate_01_b2;                            // 0x6e8(0x8)
	Class StaticMeshComponent*                                   cmn_wooden_crate_01_b1;                            // 0x6f0(0x8)
	Class StaticMeshComponent*                                   cmn_wooden_crate_01_b;                             // 0x6f8(0x8)
	Class StaticMeshComponent*                                   cmn_rowboat_oar_01_a;                              // 0x708(0x8)
	Class StaticMeshComponent*                                   gmp_bar_hide_01_a4;                                // 0x710(0x8)
	Class StaticMeshComponent*                                   gmp_bar_hide_01_a3;                                // 0x718(0x8)
	Class StaticMeshComponent*                                   gmp_bar_hide_01_a2;                                // 0x720(0x8)
	Class StaticMeshComponent*                                   gmp_bar_hide_01_a1;                                // 0x728(0x8)
	Class StaticMeshComponent*                                   gmp_bar_hide_01_a;                                 // 0x730(0x8)
	Class StaticMeshComponent*                                   cmn_stool_01_a3;                                   // 0x738(0x8)
	Class StaticMeshComponent*                                   cmn_stool_01_a2;                                   // 0x740(0x8)
	Class StaticMeshComponent*                                   cmn_stool_01_a1;                                   // 0x748(0x8)
	Class StaticMeshComponent*                                   cmn_stool_01_a;                                    // 0x750(0x8)
	Class StaticMeshComponent*                                   bld_tvn_round_table_01_a1;                         // 0x758(0x8)
	Class StaticMeshComponent*                                   bld_tvn_round_table_01_a;                          // 0x760(0x8)
	Class StaticMeshComponent*                                   bld_tvn_table_01_a;                                // 0x768(0x8)
	Class StaticMeshComponent*                                   bld_tvn_bench_01_a2;                               // 0x770(0x8)
	Class StaticMeshComponent*                                   bld_tvn_bench_01_a1;                               // 0x778(0x8)
	Class StaticMeshComponent*                                   cmn_rug_01_a2;                                     // 0x780(0x8)
	Class StaticMeshComponent*                                   cmn_rug_01_a1;                                     // 0x788(0x8)
	Class StaticMeshComponent*                                   cmn_rug_01_a;                                      // 0x790(0x8)
	Class StaticMeshComponent*                                   bld_tvn_rug_01_a2;                                 // 0x798(0x8)
	Class StaticMeshComponent*                                   bld_tvn_rug_01_a1;                                 // 0x7a0(0x8)
	Class StaticMeshComponent*                                   bld_tvn_rug_01_a;                                  // 0x7a8(0x8)
	Class StaticMeshComponent*                                   bld_tvn_animal_rug_01_a;                           // 0x7b0(0x8)
	Class StaticMeshComponent*                                   bld_tvn_beam_sail_cloth_01_b;                      // 0x7b8(0x8)
	Class StaticMeshComponent*                                   bld_tvn_beam_sail_cloth_01_c;                      // 0x7c0(0x8)
	Class StaticMeshComponent*                                   bld_tvn_post_01_b;                                 // 0x7c8(0x8)
	Class StaticMeshComponent*                                   bld_tvn_bar_base_01_a;                             // 0x7d0(0x8)
	Class StaticMeshComponent*                                   bld_tvn_post_01_c1;                                // 0x7d8(0x8)
	Class StaticMeshComponent*                                   bld_tvn_bench_01_a;                                // 0x7e0(0x8)
	Class StaticMeshComponent*                                   shp_rifle_rack_01_a;                               // 0x7e8(0x8)
	Class StaticMeshComponent*                                   bld_tvn_post_01_c;                                 // 0x7f0(0x8)
	Class StaticMeshComponent*                                   bld_shop_door_02_a1;                               // 0x7f8(0x8)
	Class StaticMeshComponent*                                   bld_shop_door_02_a;                                // 0x800(0x8)
	Class StaticMeshComponent*                                   bld_tvn_exterior_door_01_a;                        // 0x808(0x8)
	Class StaticMeshComponent*                                   bld_tvn_window_01_b;                               // 0x810(0x8)
	Class StaticMeshComponent*                                   bld_tvn_interior_stairs_01_b;                      // 0x818(0x8)
	Class StaticMeshComponent*                                   bld_tvn_fireplace_plinth_01_a;                     // 0x820(0x8)
	Class StaticMeshComponent*                                   bld_tvn_fireplace_grate_01_a;                      // 0x828(0x8)
	Class StaticMeshComponent*                                   bld_tvn_fireplace_rail_01_a;                       // 0x830(0x8)
	Class StaticMeshComponent*                                   bld_tvn_fireplace_surround_01_a;                   // 0x838(0x8)
	Class StaticMeshComponent*                                   bld_tavern_frontend_01_a;                          // 0x840(0x8)
	Class SceneComponent*                                        DefaultSceneRoot;                                  // 0x848(0x8)
};


}