// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x45
class BP_TreasuryWaveMusic_C: public Actor
{
public:
	Struct PointerToUberGraphFrame                               UberGraphFrame;                                    // 0x3d0(0x8)
	Class MusicZoneComponent*                                    MusicZone;                                         // 0x3d8(0x8)
	struct FName                                                 WaveActiveGroup;                                   // 0x3e0(0x8)
	struct FName                                                 WaveActive;                                        // 0x3e8(0x8)
	struct FName                                                 WavePassive;                                       // 0x3f0(0x8)
	bool                                                         WaveIsActive;                                      // 0x3f8(0x1)
	bool                                                         MusicZoneIsActive;                                 // 0x3f9(0x1)
	bool                                                         TreasuryComplete;                                  // 0x3fa(0x1)
	struct FName                                                 AiTypeGroupName;                                   // 0x3fc(0x8)
	struct FName                                                 AiTypeSirens;                                      // 0x404(0x8)
	struct FName                                                 AiTypeOceanCrawlers;                               // 0x40c(0x8)
	bool                                                         WaveTypeIsSirens;                                  // 0x414(0x1)
};


}