// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x68
class BP_TotD_PortalController_C: public Actor
{
public:
	Struct PointerToUberGraphFrame                               None;                                              // 0x3d0(0x8)
	Class AnimNotifyWwiseEmitterComponent*                       None;                                              // 0x3d8(0x8)
	Class SceneComponent*                                        None;                                              // 0x3e0(0x8)
	float                                                        None;                                              // 0x3e8(0x4)
	float                                                        None;                                              // 0x3ec(0x4)
	float                                                        None;                                              // 0x3f0(0x4)
	float                                                        None;                                              // 0x3f4(0x4)
	float                                                        None;                                              // 0x3f8(0x4)
	byte                                                         None;                                              // 0x3fc(0x1)
	Class TimelineComponent*                                     None;                                              // 0x400(0x8)
	TArray<class None*>                                          None;                                              // 0x408(0x10)
	TArray<class None*>                                          None;                                              // 0x418(0x10)
	float                                                        None;                                              // 0x428(0x4)
	float                                                        None;                                              // 0x42c(0x4)
	Class Texture2D*                                             None;                                              // 0x430(0x8)
};


}