// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x1c8
class BP_wpn_shop_wld_01_a_C: public Actor
{
public:
	Class WorldLocationPopUpComponent*                           WorldLocationPopUp;                                // 0x3d0(0x8)
	Class PetHangoutSpotComponent*                               PetHangoutSpot;                                    // 0x3d8(0x8)
	Class BoxComponent*                                          Collision_02;                                      // 0x3e0(0x8)
	Class BoxComponent*                                          Collision_01;                                      // 0x3e8(0x8)
	Class StaticMeshComponent*                                   wld_wpn_shop_dressing_01_a;                        // 0x3f0(0x8)
	Class StaticMeshComponent*                                   StaticMesh12;                                      // 0x3f8(0x8)
	Class StaticMeshComponent*                                   StaticMesh11;                                      // 0x400(0x8)
	Class StaticMeshComponent*                                   StaticMesh10;                                      // 0x408(0x8)
	Class StaticMeshComponent*                                   StaticMesh9;                                       // 0x410(0x8)
	Class StaticMeshComponent*                                   StaticMesh8;                                       // 0x418(0x8)
	Class StaticMeshComponent*                                   StaticMesh7;                                       // 0x420(0x8)
	Class SpotLightComponent*                                    SpotLight4;                                        // 0x428(0x8)
	Class SpotLightComponent*                                    SpotLight2;                                        // 0x430(0x8)
	Class SpotLightComponent*                                    SpotLight1;                                        // 0x438(0x8)
	Class ChildActorComponent*                                   BP_IslandWeaponsChest;                             // 0x440(0x8)
	Class ParticleSystemComponent*                               ParticleSystem;                                    // 0x448(0x8)
	Class ChildActorComponent*                                   ChildActor1;                                       // 0x450(0x8)
	Class SpotLightComponent*                                    SpotLight3;                                        // 0x458(0x8)
	Class ChildActorComponent*                                   ChildActor3;                                       // 0x460(0x8)
	Class PointLightComponent*                                   PointLight4;                                       // 0x468(0x8)
	Class ChildActorComponent*                                   ChildActor2;                                       // 0x470(0x8)
	Class ChildActorComponent*                                   ChildActor;                                        // 0x478(0x8)
	Class PointLightComponent*                                   PointLight3;                                       // 0x480(0x8)
	Class PointLightComponent*                                   PointLight2;                                       // 0x488(0x8)
	Class PointLightComponent*                                   PointLight1;                                       // 0x490(0x8)
	Class PointLightComponent*                                   PointLight;                                        // 0x498(0x8)
	Class StaticMeshComponent*                                   StaticMesh4;                                       // 0x4a0(0x8)
	Class StaticMeshComponent*                                   tls_wld_Orb_light_a1;                              // 0x4a8(0x8)
	Class ChildActorComponent*                                   tls_wld_torch_skull_a;                             // 0x4b0(0x8)
	Class ParticleSystemComponent*                               vfx_fireplace_tavern;                              // 0x4b8(0x8)
	Class SpotLightComponent*                                    SpotLight;                                         // 0x4c0(0x8)
	Class StaticMeshComponent*                                   StaticMesh3;                                       // 0x4c8(0x8)
	Class ChildActorComponent*                                   AudioSpace;                                        // 0x4d0(0x8)
	Class StaticMeshComponent*                                   shp_kra_skin_rug_01_a;                             // 0x4d8(0x8)
	Class StaticMeshComponent*                                   bld_wpn_shop_window_01_a;                          // 0x4e0(0x8)
	Class StaticMeshComponent*                                   bld_wpn_shop_table_01_a;                           // 0x4e8(0x8)
	Class StaticMeshComponent*                                   bld_shop_wood_box_02_a;                            // 0x4f0(0x8)
	Class StaticMeshComponent*                                   bld_wpn_shop_furnace_01_a;                         // 0x4f8(0x8)
	Class StaticMeshComponent*                                   bld_wpn_shop_hanging_target_01_a;                  // 0x500(0x8)
	Class StaticMeshComponent*                                   bld_wpn_shop_01_a;                                 // 0x508(0x8)
	Class StaticMeshComponent*                                   bld_wpn_shop_doorframe_01_b;                       // 0x510(0x8)
	Class StaticMeshComponent*                                   bld_wpn_shop_lantern_01_b;                         // 0x518(0x8)
	Class StaticMeshComponent*                                   cmn_skeleton_head_boar_01_a1;                      // 0x520(0x8)
	Class StaticMeshComponent*                                   cmn_skeleton_head_01_a1;                           // 0x528(0x8)
	Class StaticMeshComponent*                                   cmn_skeleton_head_01_b;                            // 0x530(0x8)
	Class StaticMeshComponent*                                   cmn_skeleton_head_01_a;                            // 0x538(0x8)
	Class StaticMeshComponent*                                   cmn_skeleton_head_boar_01_a;                       // 0x540(0x8)
	Class StaticMeshComponent*                                   bld_wpn_shop_wilds_details_01_a;                   // 0x548(0x8)
	Class StaticMeshComponent*                                   bld_wpn_roof_beam_01_a;                            // 0x550(0x8)
	Class StaticMeshComponent*                                   bld_shop_small_balcony_01_a;                       // 0x558(0x8)
	Class StaticMeshComponent*                                   bld_wpn_shop_window_01_c1;                         // 0x560(0x8)
	Class StaticMeshComponent*                                   bld_wpn_shop_window_01_b1;                         // 0x568(0x8)
	Class StaticMeshComponent*                                   bld_wpn_shop_window_01_a1;                         // 0x570(0x8)
	Class StaticMeshComponent*                                   bld_wpn_shop_sign_01_a;                            // 0x578(0x8)
	Class StaticMeshComponent*                                   bld_wpn_shop_pillars_01_a;                         // 0x580(0x8)
	Class StaticMeshComponent*                                   bld_wpn_shop_door_01_a;                            // 0x588(0x8)
	Class SceneComponent*                                        DefaultSceneRoot;                                  // 0x590(0x8)
};


}