// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x28
class bsp_bush_cluster_06_a_C: public BP_Placement_HeightDrop_C
{
public:
	Class StaticMeshComponent*                                   wsp_bush_fern_01_a;                                // 0x410(0x8)
	Class StaticMeshComponent*                                   wsp_rock_pebbles_c_01;                             // 0x418(0x8)
	Class StaticMeshComponent*                                   wsp_rock_pebbles_a_01;                             // 0x420(0x8)
	Class StaticMeshComponent*                                   wsp_rock_xtra_small_e_01;                          // 0x428(0x8)
	Class SceneComponent*                                        SharedRoot;                                        // 0x430(0x8)
};


// Size 0x38
class bsp_bush_cluster_05_c_C: public BP_Placement_HeightDrop_C
{
public:
	Class StaticMeshComponent*                                   wsp_rock_xtra_small__e;                            // 0x410(0x8)
	Class StaticMeshComponent*                                   wsp_rock_pebbles__e;                               // 0x418(0x8)
	Class StaticMeshComponent*                                   wsp_rock_pebbles__d;                               // 0x420(0x8)
	Class StaticMeshComponent*                                   wsp_rock_pebbles__g;                               // 0x428(0x8)
	Class StaticMeshComponent*                                   wsp_rock_pebbles__f;                               // 0x430(0x8)
	Class StaticMeshComponent*                                   wsp_rock_xtra_small__a;                            // 0x438(0x8)
	Class SceneComponent*                                        Scene1;                                            // 0x440(0x8)
};


// Size 0x28
class bsp_bush_cluster_05_b_C: public BP_Placement_HeightDrop_C
{
public:
	Class StaticMeshComponent*                                   wsp_rock_xtra_small__e;                            // 0x410(0x8)
	Class StaticMeshComponent*                                   wsp_rock_xtra_small__a;                            // 0x418(0x8)
	Class StaticMeshComponent*                                   StaticMesh1;                                       // 0x420(0x8)
	Class StaticMeshComponent*                                   wsp_bush_08_c;                                     // 0x428(0x8)
	Class SceneComponent*                                        Scene1;                                            // 0x430(0x8)
};


// Size 0x30
class bsp_bush_cluster_05_a_C: public BP_Placement_HeightDrop_C
{
public:
	Class StaticMeshComponent*                                   wsp_rock_xtra_small__e;                            // 0x410(0x8)
	Class StaticMeshComponent*                                   wsp_rock_xtra_small__a;                            // 0x418(0x8)
	Class StaticMeshComponent*                                   StaticMesh1;                                       // 0x420(0x8)
	Class StaticMeshComponent*                                   wsp_bush_03_a;                                     // 0x428(0x8)
	Class StaticMeshComponent*                                   wsp_bush_08_c;                                     // 0x430(0x8)
	Class SceneComponent*                                        Scene1;                                            // 0x438(0x8)
};


// Size 0x18
class bsp_bush_cluster_04_c_C: public BP_Placement_HeightDrop_C
{
public:
	Class StaticMeshComponent*                                   StaticMesh2;                                       // 0x410(0x8)
	Class StaticMeshComponent*                                   wsp_bush_01_a25;                                   // 0x418(0x8)
	Class SceneComponent*                                        Scene1;                                            // 0x420(0x8)
};


// Size 0x28
class bsp_bush_cluster_04_b_C: public BP_Placement_HeightDrop_C
{
public:
	Class StaticMeshComponent*                                   StaticMesh;                                        // 0x410(0x8)
	Class StaticMeshComponent*                                   wsp_bush_01_a25;                                   // 0x418(0x8)
	Class StaticMeshComponent*                                   wsp_bush_01_a20;                                   // 0x420(0x8)
	Class StaticMeshComponent*                                   wsp_bush_01_a26;                                   // 0x428(0x8)
	Class SceneComponent*                                        Scene1;                                            // 0x430(0x8)
};


// Size 0x28
class bsp_bush_cluster_03_c_C: public BP_Placement_HeightDrop_C
{
public:
	Class StaticMeshComponent*                                   wsp_bush_fern_01_a;                                // 0x410(0x8)
	Class StaticMeshComponent*                                   wsp_rock_pebbles_c_01;                             // 0x418(0x8)
	Class StaticMeshComponent*                                   wsp_rock_pebbles_a_01;                             // 0x420(0x8)
	Class StaticMeshComponent*                                   wsp_rock_xtra_small_e_01;                          // 0x428(0x8)
	Class SceneComponent*                                        SharedRoot;                                        // 0x430(0x8)
};


// Size 0x38
class bsp_bush_cluster_03_b_C: public BP_Placement_HeightDrop_C
{
public:
	Class StaticMeshComponent*                                   wsp_rock_pebbles_c_01;                             // 0x410(0x8)
	Class StaticMeshComponent*                                   wsp_rock_xtra_small_a_01;                          // 0x418(0x8)
	Class StaticMeshComponent*                                   wsp_rock_pebbles_a_01;                             // 0x420(0x8)
	Class StaticMeshComponent*                                   wsp_bush_03_a_03;                                  // 0x428(0x8)
	Class StaticMeshComponent*                                   wsp_rock_xtra_small_e_01;                          // 0x430(0x8)
	Class StaticMeshComponent*                                   wsp_rock_pebbles_b_01;                             // 0x438(0x8)
	Class SceneComponent*                                        SharedRoot;                                        // 0x440(0x8)
};


// Size 0x30
class bsp_bush_cluster_03_a_C: public BP_Placement_HeightDrop_C
{
public:
	Class StaticMeshComponent*                                   wsp_rock_pebbles_d_01;                             // 0x410(0x8)
	Class StaticMeshComponent*                                   wsp_bush_01_a_01;                                  // 0x418(0x8)
	Class StaticMeshComponent*                                   wsp_rock_xtra_small_d_01;                          // 0x420(0x8)
	Class StaticMeshComponent*                                   wsp_rock_xtra_small_a_01;                          // 0x428(0x8)
	Class StaticMeshComponent*                                   wsp_rock_xtra_small_b_01;                          // 0x430(0x8)
	Class SceneComponent*                                        SharedRoot;                                        // 0x438(0x8)
};


// Size 0x30
class bsp_bush_cluster_02_e_C: public BP_Placement_HeightDrop_C
{
public:
	Class StaticMeshComponent*                                   StaticMesh6;                                       // 0x410(0x8)
	Class StaticMeshComponent*                                   StaticMesh2;                                       // 0x418(0x8)
	Class StaticMeshComponent*                                   StaticMesh5;                                       // 0x420(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent02;                             // 0x428(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent01;                             // 0x430(0x8)
	Class SceneComponent*                                        SharedRoot;                                        // 0x438(0x8)
};


// Size 0x28
class bsp_bush_cluster_02_d_C: public BP_Placement_HeightDrop_C
{
public:
	Class StaticMeshComponent*                                   StaticMesh2;                                       // 0x410(0x8)
	Class StaticMeshComponent*                                   StaticMesh3;                                       // 0x418(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent02;                             // 0x420(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent01;                             // 0x428(0x8)
	Class SceneComponent*                                        SharedRoot;                                        // 0x430(0x8)
};


// Size 0x20
class bsp_bush_cluster_02_c_C: public BP_Placement_HeightDrop_C
{
public:
	Class StaticMeshComponent*                                   StaticMesh2;                                       // 0x410(0x8)
	Class StaticMeshComponent*                                   StaticMesh1;                                       // 0x418(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent01;                             // 0x420(0x8)
	Class SceneComponent*                                        SharedRoot;                                        // 0x428(0x8)
};


// Size 0x18
class bsp_bush_cluster_02_b_C: public BP_Placement_HeightDrop_C
{
public:
	Class StaticMeshComponent*                                   StaticMesh;                                        // 0x410(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent01;                             // 0x418(0x8)
	Class SceneComponent*                                        SharedRoot;                                        // 0x420(0x8)
};


// Size 0x40
class bsp_bush_cluster_02_a_C: public BP_Placement_HeightDrop_C
{
public:
	Class StaticMeshComponent*                                   StaticMesh;                                        // 0x410(0x8)
	Class StaticMeshComponent*                                   StaticMesh4;                                       // 0x418(0x8)
	Class StaticMeshComponent*                                   StaticMesh3;                                       // 0x420(0x8)
	Class StaticMeshComponent*                                   StaticMesh2;                                       // 0x428(0x8)
	Class StaticMeshComponent*                                   StaticMesh1;                                       // 0x430(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent02;                             // 0x438(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent01;                             // 0x440(0x8)
	Class SceneComponent*                                        SharedRoot;                                        // 0x448(0x8)
};


// Size 0x28
class bsp_bush_cluster_01_d_C: public BP_Placement_HeightDrop_C
{
public:
	Class StaticMeshComponent*                                   wsp_bush_03_a_02;                                  // 0x410(0x8)
	Class StaticMeshComponent*                                   wsp_bush_08_c_01;                                  // 0x418(0x8)
	Class StaticMeshComponent*                                   wsp_bush_05_b_01;                                  // 0x420(0x8)
	Class StaticMeshComponent*                                   wsp_bush_03_a_01;                                  // 0x428(0x8)
	Class SceneComponent*                                        SharedRoot;                                        // 0x430(0x8)
};


// Size 0x30
class bsp_bush_cluster_01_c_C: public BP_Placement_HeightDrop_C
{
public:
	Class StaticMeshComponent*                                   wsp_bush_03_a_06;                                  // 0x410(0x8)
	Class StaticMeshComponent*                                   wsp_bush_01_a_01;                                  // 0x418(0x8)
	Class StaticMeshComponent*                                   wsp_bush_03_a_04;                                  // 0x420(0x8)
	Class StaticMeshComponent*                                   wsp_bush_03_a_01;                                  // 0x428(0x8)
	Class StaticMeshComponent*                                   wsp_bush_06_b_01;                                  // 0x430(0x8)
	Class SceneComponent*                                        SharedRoot;                                        // 0x438(0x8)
};


// Size 0x30
class bsp_bush_cluster_01_b_C: public BP_Placement_HeightDrop_C
{
public:
	Class StaticMeshComponent*                                   wsp_bush_06_a_01;                                  // 0x410(0x8)
	Class StaticMeshComponent*                                   wsp_bush_01_b_01;                                  // 0x418(0x8)
	Class StaticMeshComponent*                                   wsp_bush_03_a_03;                                  // 0x420(0x8)
	Class StaticMeshComponent*                                   wsp_bush_01_a_01;                                  // 0x428(0x8)
	Class StaticMeshComponent*                                   wsp_bush_03_a_01;                                  // 0x430(0x8)
	Class SceneComponent*                                        SharedRoot;                                        // 0x438(0x8)
};


// Size 0x30
class bsp_bush_cluster_01_a_C: public BP_Placement_HeightDrop_C
{
public:
	Class StaticMeshComponent*                                   wsp_bush_03_a_04;                                  // 0x410(0x8)
	Class StaticMeshComponent*                                   wsp_bush_03_a_03;                                  // 0x418(0x8)
	Class StaticMeshComponent*                                   wsp_bush_01_a_01;                                  // 0x420(0x8)
	Class StaticMeshComponent*                                   wsp_bush_03_a_01;                                  // 0x428(0x8)
	Class StaticMeshComponent*                                   wsp_bush_06_a_01;                                  // 0x430(0x8)
	Class SceneComponent*                                        SharedRoot;                                        // 0x438(0x8)
};


}