// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x68
class bsp_beach_rocks_09_C: public BP_Placement_HeightDrop_C
{
public:
	Class StaticMeshComponent*                                   bsp_rock_medium_01_b;                              // 0x410(0x8)
	Class StaticMeshComponent*                                   bsp_rock_small_01_b;                               // 0x418(0x8)
	Class StaticMeshComponent*                                   wsp_rock_pebbles_a_02;                             // 0x420(0x8)
	Class StaticMeshComponent*                                   wsp_rock_pebbles_c_02;                             // 0x428(0x8)
	Class StaticMeshComponent*                                   wsp_rock_xtra_small_e_01;                          // 0x430(0x8)
	Class StaticMeshComponent*                                   wsp_rock_pebbles_f_02;                             // 0x438(0x8)
	Class StaticMeshComponent*                                   wsp_rock_pebbles_d_02;                             // 0x440(0x8)
	Class StaticMeshComponent*                                   wsp_rock_pebbles_e_02;                             // 0x448(0x8)
	Class StaticMeshComponent*                                   wsp_rock_pebbles_b_02;                             // 0x450(0x8)
	Class StaticMeshComponent*                                   wsp_rock_pebbles_e_01;                             // 0x458(0x8)
	Class StaticMeshComponent*                                   wsp_rock_xtra_small_d_01;                          // 0x460(0x8)
	Class StaticMeshComponent*                                   wsp_rock_xtra_small_a_01;                          // 0x468(0x8)
	Class SceneComponent*                                        SharedRoot;                                        // 0x470(0x8)
};


// Size 0x60
class bsp_beach_rocks_08_C: public BP_Placement_HeightDrop_C
{
public:
	Class StaticMeshComponent*                                   bsp_rock_small_01_e;                               // 0x410(0x8)
	Class StaticMeshComponent*                                   bsp_rock_medium_01_c;                              // 0x418(0x8)
	Class StaticMeshComponent*                                   wsp_rock_pebbles_a_02;                             // 0x420(0x8)
	Class StaticMeshComponent*                                   wsp_rock_pebbles_c_02;                             // 0x428(0x8)
	Class StaticMeshComponent*                                   wsp_rock_xtra_small_e_01;                          // 0x430(0x8)
	Class StaticMeshComponent*                                   wsp_rock_xtra_small_a_01;                          // 0x438(0x8)
	Class StaticMeshComponent*                                   wsp_rock_pebbles_d_02;                             // 0x440(0x8)
	Class StaticMeshComponent*                                   wsp_rock_pebbles_e_02;                             // 0x448(0x8)
	Class StaticMeshComponent*                                   wsp_rock_pebbles_b_02;                             // 0x450(0x8)
	Class StaticMeshComponent*                                   wsp_rock_pebbles_e_01;                             // 0x458(0x8)
	Class StaticMeshComponent*                                   wsp_rock_xtra_small_d_01;                          // 0x460(0x8)
	Class StaticMeshComponent*                                   wsp_rock_pebbles_f_02;                             // 0x468(0x8)
};


// Size 0x60
class bsp_beach_rocks_07_C: public BP_Placement_HeightDrop_C
{
public:
	Class StaticMeshComponent*                                   bsp_rock_small_01_d;                               // 0x410(0x8)
	Class StaticMeshComponent*                                   bsp_rock_medium_01_e;                              // 0x418(0x8)
	Class StaticMeshComponent*                                   wsp_rock_pebbles_a_02;                             // 0x420(0x8)
	Class StaticMeshComponent*                                   wsp_rock_pebbles_c_02;                             // 0x428(0x8)
	Class StaticMeshComponent*                                   wsp_rock_xtra_small_e_01;                          // 0x430(0x8)
	Class StaticMeshComponent*                                   wsp_rock_xtra_small_a_01;                          // 0x438(0x8)
	Class StaticMeshComponent*                                   wsp_rock_pebbles_d_02;                             // 0x440(0x8)
	Class StaticMeshComponent*                                   wsp_rock_pebbles_e_02;                             // 0x448(0x8)
	Class StaticMeshComponent*                                   wsp_rock_pebbles_b_02;                             // 0x450(0x8)
	Class StaticMeshComponent*                                   wsp_rock_pebbles_e_01;                             // 0x458(0x8)
	Class StaticMeshComponent*                                   wsp_rock_xtra_small_d_01;                          // 0x460(0x8)
	Class StaticMeshComponent*                                   wsp_rock_pebbles_f_02;                             // 0x468(0x8)
};


// Size 0x50
class bsp_beach_rocks_06_a_C: public BP_Placement_HeightDrop_C
{
public:
	Class StaticMeshComponent*                                   wsp_rock_pebbles_a_02;                             // 0x410(0x8)
	Class StaticMeshComponent*                                   wsp_rock_pebbles_c_02;                             // 0x418(0x8)
	Class StaticMeshComponent*                                   wsp_rock_xtra_small_e_01;                          // 0x420(0x8)
	Class StaticMeshComponent*                                   wsp_rock_pebbles_f_02;                             // 0x428(0x8)
	Class StaticMeshComponent*                                   wsp_rock_xtra_small_a_01;                          // 0x430(0x8)
	Class StaticMeshComponent*                                   wsp_rock_pebbles_e_02;                             // 0x438(0x8)
	Class StaticMeshComponent*                                   wsp_rock_pebbles_b_02;                             // 0x440(0x8)
	Class StaticMeshComponent*                                   wsp_rock_pebbles_e_01;                             // 0x448(0x8)
	Class StaticMeshComponent*                                   wsp_rock_xtra_small_d_01;                          // 0x450(0x8)
	Class StaticMeshComponent*                                   wsp_rock_pebbles_d_02;                             // 0x458(0x8)
};


// Size 0x80
class bsp_beach_rocks_05_C: public BP_Placement_HeightDrop_C
{
public:
	Class StaticMeshComponent*                                   StaticMeshComponent015;                            // 0x410(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent014;                            // 0x418(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent013;                            // 0x420(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent012;                            // 0x428(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent011;                            // 0x430(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent010;                            // 0x438(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent09;                             // 0x440(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent0;                              // 0x448(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent07;                             // 0x450(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent06;                             // 0x458(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent05;                             // 0x460(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent04;                             // 0x468(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent03;                             // 0x470(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent02;                             // 0x478(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent01;                             // 0x480(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent08;                             // 0x488(0x8)
};


// Size 0x50
class bsp_beach_rocks_04_C: public BP_Placement_HeightDrop_C
{
public:
	Class StaticMeshComponent*                                   StaticMeshComponent09;                             // 0x410(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent08;                             // 0x418(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent07;                             // 0x420(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent06;                             // 0x428(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent0;                              // 0x430(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent04;                             // 0x438(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent03;                             // 0x440(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent02;                             // 0x448(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent01;                             // 0x450(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent05;                             // 0x458(0x8)
};


// Size 0xa0
class bsp_beach_rocks_03_C: public BP_Placement_HeightDrop_C
{
public:
	Class StaticMeshComponent*                                   StaticMeshComponent019;                            // 0x410(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent018;                            // 0x418(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent017;                            // 0x420(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent016;                            // 0x428(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent015;                            // 0x430(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent014;                            // 0x438(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent013;                            // 0x440(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent012;                            // 0x448(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent011;                            // 0x450(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent0;                              // 0x458(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent09;                             // 0x460(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent08;                             // 0x468(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent07;                             // 0x470(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent06;                             // 0x478(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent05;                             // 0x480(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent04;                             // 0x488(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent03;                             // 0x490(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent02;                             // 0x498(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent01;                             // 0x4a0(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent010;                            // 0x4a8(0x8)
};


// Size 0x88
class bsp_beach_rocks_02_C: public BP_Placement_HeightDrop_C
{
public:
	Class StaticMeshComponent*                                   StaticMeshComponent016;                            // 0x410(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent015;                            // 0x418(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent014;                            // 0x420(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent013;                            // 0x428(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent012;                            // 0x430(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent011;                            // 0x438(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent010;                            // 0x440(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent09;                             // 0x448(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent0;                              // 0x450(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent07;                             // 0x458(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent06;                             // 0x460(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent05;                             // 0x468(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent04;                             // 0x470(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent03;                             // 0x478(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent02;                             // 0x480(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent01;                             // 0x488(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent08;                             // 0x490(0x8)
};


// Size 0x50
class bsp_beach_rocks_01_C: public BP_Placement_HeightDrop_C
{
public:
	Class StaticMeshComponent*                                   StaticMesh;                                        // 0x410(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent08;                             // 0x418(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent07;                             // 0x420(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent06;                             // 0x428(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent0;                              // 0x430(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent04;                             // 0x438(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent03;                             // 0x440(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent02;                             // 0x448(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent01;                             // 0x450(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent05;                             // 0x458(0x8)
};


}