// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x38
class bsp_flower_cluster_03_b_C: public BP_Placement_HeightDrop_C
{
public:
	Class StaticMeshComponent*                                   wsp_flower_04_b_01;                                // 0x410(0x8)
	Class StaticMeshComponent*                                   wsp_flower_04_a_01;                                // 0x418(0x8)
	Class StaticMeshComponent*                                   wsp_rock_pebbles_a_01;                             // 0x420(0x8)
	Class StaticMeshComponent*                                   wsp_rock_pebbles_b_01;                             // 0x428(0x8)
	Class StaticMeshComponent*                                   wsp_rock_pebbles_c_01;                             // 0x430(0x8)
	Class StaticMeshComponent*                                   wsp_rock_xtra_small_b_01;                          // 0x438(0x8)
	Class SceneComponent*                                        SharedRoot;                                        // 0x440(0x8)
};


// Size 0x20
class bsp_flower_cluster_02_j_C: public BP_Placement_HeightDrop_C
{
public:
	Class StaticMeshComponent*                                   StaticMesh;                                        // 0x410(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent02;                             // 0x418(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent01;                             // 0x420(0x8)
	Class SceneComponent*                                        SharedRoot;                                        // 0x428(0x8)
};


// Size 0x20
class bsp_flower_cluster_02_i_C: public BP_Placement_HeightDrop_C
{
public:
	Class StaticMeshComponent*                                   StaticMesh;                                        // 0x410(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent02;                             // 0x418(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent01;                             // 0x420(0x8)
	Class SceneComponent*                                        SharedRoot;                                        // 0x428(0x8)
};


// Size 0x20
class bsp_flower_cluster_02_h_C: public BP_Placement_HeightDrop_C
{
public:
	Class StaticMeshComponent*                                   StaticMesh;                                        // 0x410(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent02;                             // 0x418(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent01;                             // 0x420(0x8)
	Class SceneComponent*                                        SharedRoot;                                        // 0x428(0x8)
};


// Size 0x20
class bsp_flower_cluster_02_f_C: public BP_Placement_HeightDrop_C
{
public:
	Class StaticMeshComponent*                                   StaticMesh;                                        // 0x410(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent02;                             // 0x418(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent01;                             // 0x420(0x8)
	Class SceneComponent*                                        SharedRoot;                                        // 0x428(0x8)
};


// Size 0x88
class bsp_flower_cluster_02_c_C: public BP_Placement_HeightDrop_C
{
public:
	Class StaticMeshComponent*                                   StaticMesh9;                                       // 0x410(0x8)
	Class StaticMeshComponent*                                   StaticMesh8;                                       // 0x418(0x8)
	Class StaticMeshComponent*                                   StaticMesh7;                                       // 0x420(0x8)
	Class StaticMeshComponent*                                   StaticMesh6;                                       // 0x428(0x8)
	Class StaticMeshComponent*                                   StaticMesh4;                                       // 0x430(0x8)
	Class StaticMeshComponent*                                   StaticMesh3;                                       // 0x438(0x8)
	Class StaticMeshComponent*                                   StaticMesh2;                                       // 0x440(0x8)
	Class StaticMeshComponent*                                   StaticMesh5;                                       // 0x448(0x8)
	Class StaticMeshComponent*                                   wsp_rock_pebbles__a;                               // 0x450(0x8)
	Class StaticMeshComponent*                                   wsp_rock_pebbles__h;                               // 0x458(0x8)
	Class StaticMeshComponent*                                   wsp_rock_pebbles__g;                               // 0x460(0x8)
	Class StaticMeshComponent*                                   wsp_rock_xtra_small__b;                            // 0x468(0x8)
	Class StaticMeshComponent*                                   wsp_rock_xtra_small__c;                            // 0x470(0x8)
	Class StaticMeshComponent*                                   StaticMesh;                                        // 0x478(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent02;                             // 0x480(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent01;                             // 0x488(0x8)
	Class SceneComponent*                                        SharedRoot;                                        // 0x490(0x8)
};


// Size 0x88
class bsp_flower_cluster_02_a_C: public BP_Placement_HeightDrop_C
{
public:
	Class StaticMeshComponent*                                   StaticMesh9;                                       // 0x410(0x8)
	Class StaticMeshComponent*                                   StaticMesh8;                                       // 0x418(0x8)
	Class StaticMeshComponent*                                   StaticMesh7;                                       // 0x420(0x8)
	Class StaticMeshComponent*                                   StaticMesh6;                                       // 0x428(0x8)
	Class StaticMeshComponent*                                   StaticMesh4;                                       // 0x430(0x8)
	Class StaticMeshComponent*                                   StaticMesh3;                                       // 0x438(0x8)
	Class StaticMeshComponent*                                   StaticMesh2;                                       // 0x440(0x8)
	Class StaticMeshComponent*                                   StaticMesh5;                                       // 0x448(0x8)
	Class StaticMeshComponent*                                   wsp_rock_pebbles__a;                               // 0x450(0x8)
	Class StaticMeshComponent*                                   wsp_rock_pebbles__h;                               // 0x458(0x8)
	Class StaticMeshComponent*                                   wsp_rock_pebbles__g;                               // 0x460(0x8)
	Class StaticMeshComponent*                                   wsp_rock_xtra_small__b;                            // 0x468(0x8)
	Class StaticMeshComponent*                                   wsp_rock_xtra_small__c;                            // 0x470(0x8)
	Class StaticMeshComponent*                                   StaticMesh;                                        // 0x478(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent02;                             // 0x480(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent01;                             // 0x488(0x8)
	Class SceneComponent*                                        SharedRoot;                                        // 0x490(0x8)
};


}