// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x28
class bsp_tr_cluster_03_c_C: public BP_Placement_HeightDrop_C
{
public:
	Class StaticMeshComponent*                                   wsp_tree_palm_01_a2;                               // 0x410(0x8)
	Class StaticMeshComponent*                                   wsp_bush_06_b;                                     // 0x418(0x8)
	Class StaticMeshComponent*                                   wsp_tree_palm_02_b2;                               // 0x420(0x8)
	Class NonVagueNonUniqueLandmarkComponent*                    NonVagueNonUniqueLandmark;                         // 0x428(0x8)
	Class StaticMeshComponent*                                   wsp_tree_palm_02_a2;                               // 0x430(0x8)
};


// Size 0x50
class bsp_tr_cluster_03_b_C: public BP_Placement_HeightDrop_C
{
public:
	Class StaticMeshComponent*                                   wsp_bush_01_a3;                                    // 0x410(0x8)
	Class StaticMeshComponent*                                   wsp_bush_01_a2;                                    // 0x418(0x8)
	Class StaticMeshComponent*                                   wsp_bush_01_a9;                                    // 0x420(0x8)
	Class StaticMeshComponent*                                   wsp_bush_01_a8;                                    // 0x428(0x8)
	Class StaticMeshComponent*                                   wsp_bush_01_a7;                                    // 0x430(0x8)
	Class StaticMeshComponent*                                   wsp_tree_palm_01_a;                                // 0x438(0x8)
	Class StaticMeshComponent*                                   wsp_tree_palm_01_b2;                               // 0x440(0x8)
	Class NonVagueNonUniqueLandmarkComponent*                    NonVagueNonUniqueLandmark;                         // 0x448(0x8)
	Class StaticMeshComponent*                                   wsp_tree_palm_02_b;                                // 0x450(0x8)
	Class StaticMeshComponent*                                   wsp_bush_01_a4;                                    // 0x458(0x8)
};


// Size 0x38
class bsp_tr_cluster_01_k_C: public BP_Placement_HeightDrop_C
{
public:
	Class NonVagueNonUniqueLandmarkComponent*                    NonVagueNonUniqueLandmark;                         // 0x410(0x8)
	Class StaticMeshComponent*                                   wsp_tree_palm_02_b;                                // 0x418(0x8)
	Class StaticMeshComponent*                                   wsp_bush_06_b;                                     // 0x420(0x8)
	Class StaticMeshComponent*                                   wsp_bush_06_b2;                                    // 0x428(0x8)
	Class StaticMeshComponent*                                   wsp_bush_06_b3;                                    // 0x430(0x8)
	Class StaticMeshComponent*                                   wsp_tree_palm_01_a;                                // 0x438(0x8)
	Class StaticMeshComponent*                                   wsp_tree_palm_01_b2;                               // 0x440(0x8)
};


// Size 0x38
class bsp_tr_cluster_01_h_C: public BP_Placement_HeightDrop_C
{
public:
	Class StaticMeshComponent*                                   wsp_bush_01_a25;                                   // 0x410(0x8)
	Class NonVagueNonUniqueLandmarkComponent*                    NonVagueNonUniqueLandmark;                         // 0x418(0x8)
	Class StaticMeshComponent*                                   wsp_tree_palm_01_b10;                              // 0x420(0x8)
	Class StaticMeshComponent*                                   wsp_tree_palm_01_a;                                // 0x428(0x8)
	Class StaticMeshComponent*                                   wsp_bush_01_a20;                                   // 0x430(0x8)
	Class StaticMeshComponent*                                   wsp_bush_06_b11;                                   // 0x438(0x8)
	Class SceneComponent*                                        Scene;                                             // 0x440(0x8)
};


// Size 0x30
class bsp_tr_cluster_01_b_C: public BP_Placement_HeightDrop_C
{
public:
	Class StaticMeshComponent*                                   wsp_bush_06_b;                                     // 0x410(0x8)
	Class StaticMeshComponent*                                   wsp_tree_palm_02_b2;                               // 0x418(0x8)
	Class StaticMeshComponent*                                   wsp_tree_palm_02_a2;                               // 0x420(0x8)
	Class NonVagueNonUniqueLandmarkComponent*                    NonVagueNonUniqueLandmark;                         // 0x428(0x8)
	Class StaticMeshComponent*                                   wsp_tree_palm_01_a2;                               // 0x430(0x8)
	Class SceneComponent*                                        Scene;                                             // 0x438(0x8)
};


}