// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x20
class bsp_bottle_hanging_light_b_C: public StaticMeshActor
{
public:
	Class PointLightComponent*                                   None;                                              // 0x3e0(0x8)
	Class PointLightComponent*                                   None;                                              // 0x3e8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x3f0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x3f8(0x8)
};


// Size 0x20
class bsp_bottle_hanging_light_a_C: public StaticMeshActor
{
public:
	Class StaticMeshComponent*                                   None;                                              // 0x3e0(0x8)
	Class PointLightComponent*                                   None;                                              // 0x3e8(0x8)
	Class PointLightComponent*                                   None;                                              // 0x3f0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x3f8(0x8)
};


}