// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x68
class bsp_bch_rocks_09_C: public BP_Placement_HeightDrop_C
{
public:
	Class StaticMeshComponent*                                   StaticMeshComponent012;                            // 0x410(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent011;                            // 0x418(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent010;                            // 0x420(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent09;                             // 0x428(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent08;                             // 0x430(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent07;                             // 0x438(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent0;                              // 0x440(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent05;                             // 0x448(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent04;                             // 0x450(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent03;                             // 0x458(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent02;                             // 0x460(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent01;                             // 0x468(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent06;                             // 0x470(0x8)
};


// Size 0x50
class bsp_bch_rocks_07_C: public BP_Placement_HeightDrop_C
{
public:
	Class StaticMeshComponent*                                   StaticMeshComponent09;                             // 0x410(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent08;                             // 0x418(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent07;                             // 0x420(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent06;                             // 0x428(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent0;                              // 0x430(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent04;                             // 0x438(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent03;                             // 0x440(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent02;                             // 0x448(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent01;                             // 0x450(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent05;                             // 0x458(0x8)
};


// Size 0x58
class bsp_bch_rocks_05_b_C: public BP_Placement_HeightDrop_C
{
public:
	Class StaticMeshComponent*                                   bsp_rock_cliff_01_j;                               // 0x410(0x8)
	Class StaticMeshComponent*                                   bsp_rock_medium_01_d1;                             // 0x418(0x8)
	Class StaticMeshComponent*                                   bsp_rock_medium_01_d;                              // 0x420(0x8)
	Class StaticMeshComponent*                                   StaticMesh16;                                      // 0x428(0x8)
	Class StaticMeshComponent*                                   StaticMesh14;                                      // 0x430(0x8)
	Class StaticMeshComponent*                                   StaticMesh6;                                       // 0x438(0x8)
	Class StaticMeshComponent*                                   StaticMesh11;                                      // 0x440(0x8)
	Class StaticMeshComponent*                                   StaticMesh10;                                      // 0x448(0x8)
	Class StaticMeshComponent*                                   StaticMesh8;                                       // 0x450(0x8)
	Class StaticMeshComponent*                                   StaticMesh7;                                       // 0x458(0x8)
	Class StaticMeshComponent*                                   StaticMesh12;                                      // 0x460(0x8)
};


// Size 0xb8
class bsp_bch_rocks_04_C: public BP_Placement_HeightDrop_C
{
public:
	Class StaticMeshComponent*                                   StaticMesh22;                                      // 0x410(0x8)
	Class StaticMeshComponent*                                   StaticMesh21;                                      // 0x418(0x8)
	Class StaticMeshComponent*                                   StaticMesh20;                                      // 0x420(0x8)
	Class StaticMeshComponent*                                   StaticMesh19;                                      // 0x428(0x8)
	Class StaticMeshComponent*                                   StaticMesh18;                                      // 0x430(0x8)
	Class StaticMeshComponent*                                   StaticMesh17;                                      // 0x438(0x8)
	Class StaticMeshComponent*                                   StaticMesh16;                                      // 0x440(0x8)
	Class StaticMeshComponent*                                   StaticMesh15;                                      // 0x448(0x8)
	Class StaticMeshComponent*                                   StaticMesh14;                                      // 0x450(0x8)
	Class StaticMeshComponent*                                   StaticMesh13;                                      // 0x458(0x8)
	Class StaticMeshComponent*                                   StaticMesh12;                                      // 0x460(0x8)
	Class StaticMeshComponent*                                   StaticMesh11;                                      // 0x468(0x8)
	Class StaticMeshComponent*                                   StaticMesh10;                                      // 0x470(0x8)
	Class StaticMeshComponent*                                   StaticMesh9;                                       // 0x478(0x8)
	Class StaticMeshComponent*                                   StaticMesh8;                                       // 0x480(0x8)
	Class StaticMeshComponent*                                   StaticMesh7;                                       // 0x488(0x8)
	Class StaticMeshComponent*                                   StaticMesh6;                                       // 0x490(0x8)
	Class StaticMeshComponent*                                   StaticMesh5;                                       // 0x498(0x8)
	Class StaticMeshComponent*                                   StaticMesh4;                                       // 0x4a0(0x8)
	Class StaticMeshComponent*                                   StaticMesh3;                                       // 0x4a8(0x8)
	Class StaticMeshComponent*                                   StaticMesh2;                                       // 0x4b0(0x8)
	Class StaticMeshComponent*                                   StaticMesh1;                                       // 0x4b8(0x8)
	Class SceneComponent*                                        Scene;                                             // 0x4c0(0x8)
};


// Size 0x88
class bsp_bch_rocks_03_C: public BP_Placement_HeightDrop_C
{
public:
	Class StaticMeshComponent*                                   StaticMesh16;                                      // 0x410(0x8)
	Class StaticMeshComponent*                                   StaticMesh15;                                      // 0x418(0x8)
	Class StaticMeshComponent*                                   StaticMesh14;                                      // 0x420(0x8)
	Class StaticMeshComponent*                                   StaticMesh13;                                      // 0x428(0x8)
	Class StaticMeshComponent*                                   StaticMesh12;                                      // 0x430(0x8)
	Class StaticMeshComponent*                                   StaticMesh11;                                      // 0x438(0x8)
	Class StaticMeshComponent*                                   StaticMesh10;                                      // 0x440(0x8)
	Class StaticMeshComponent*                                   StaticMesh9;                                       // 0x448(0x8)
	Class StaticMeshComponent*                                   StaticMesh8;                                       // 0x450(0x8)
	Class StaticMeshComponent*                                   StaticMesh7;                                       // 0x458(0x8)
	Class StaticMeshComponent*                                   StaticMesh6;                                       // 0x460(0x8)
	Class StaticMeshComponent*                                   StaticMesh5;                                       // 0x468(0x8)
	Class StaticMeshComponent*                                   StaticMesh4;                                       // 0x470(0x8)
	Class StaticMeshComponent*                                   StaticMesh3;                                       // 0x478(0x8)
	Class StaticMeshComponent*                                   StaticMesh2;                                       // 0x480(0x8)
	Class StaticMeshComponent*                                   StaticMesh1;                                       // 0x488(0x8)
	Class SceneComponent*                                        Scene;                                             // 0x490(0x8)
};


// Size 0x58
class bsp_bch_rocks_02_b_C: public BP_Placement_HeightDrop_C
{
public:
	Class StaticMeshComponent*                                   bsp_rock_cliff_01_j;                               // 0x410(0x8)
	Class StaticMeshComponent*                                   bsp_rock_medium_01_d;                              // 0x418(0x8)
	Class StaticMeshComponent*                                   bsp_rock_medium_01_b;                              // 0x420(0x8)
	Class StaticMeshComponent*                                   wsp_rock_xtra_small__c10;                          // 0x428(0x8)
	Class StaticMeshComponent*                                   wsp_rock_xtra_small__e4;                           // 0x430(0x8)
	Class StaticMeshComponent*                                   wsp_rock_xtra_small__e2;                           // 0x438(0x8)
	Class StaticMeshComponent*                                   wsp_rock_xtra_small__c6;                           // 0x440(0x8)
	Class StaticMeshComponent*                                   wsp_rock_xtra_small__c5;                           // 0x448(0x8)
	Class StaticMeshComponent*                                   wsp_rock_xtra_small__c9;                           // 0x450(0x8)
	Class StaticMeshComponent*                                   wsp_rock_xtra_small__c8;                           // 0x458(0x8)
	Class StaticMeshComponent*                                   wsp_rock_xtra_small__e3;                           // 0x460(0x8)
};


// Size 0x88
class bsp_bch_rocks_01_C: public BP_Placement_HeightDrop_C
{
public:
	Class StaticMeshComponent*                                   StaticMesh16;                                      // 0x410(0x8)
	Class StaticMeshComponent*                                   StaticMesh15;                                      // 0x418(0x8)
	Class StaticMeshComponent*                                   StaticMesh14;                                      // 0x420(0x8)
	Class StaticMeshComponent*                                   StaticMesh13;                                      // 0x428(0x8)
	Class StaticMeshComponent*                                   StaticMesh12;                                      // 0x430(0x8)
	Class StaticMeshComponent*                                   StaticMesh11;                                      // 0x438(0x8)
	Class StaticMeshComponent*                                   StaticMesh10;                                      // 0x440(0x8)
	Class StaticMeshComponent*                                   StaticMesh9;                                       // 0x448(0x8)
	Class StaticMeshComponent*                                   StaticMesh8;                                       // 0x450(0x8)
	Class StaticMeshComponent*                                   StaticMesh7;                                       // 0x458(0x8)
	Class StaticMeshComponent*                                   StaticMesh6;                                       // 0x460(0x8)
	Class StaticMeshComponent*                                   StaticMesh5;                                       // 0x468(0x8)
	Class StaticMeshComponent*                                   StaticMesh4;                                       // 0x470(0x8)
	Class StaticMeshComponent*                                   StaticMesh3;                                       // 0x478(0x8)
	Class StaticMeshComponent*                                   StaticMesh2;                                       // 0x480(0x8)
	Class StaticMeshComponent*                                   StaticMesh1;                                       // 0x488(0x8)
	Class SceneComponent*                                        Scene;                                             // 0x490(0x8)
};


}