// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x10
class bsp_bsh_cluster_01_j_C: public BP_Placement_HeightDrop_C
{
public:
	Class StaticMeshComponent*                                   wsp_bush_01_a6;                                    // 0x410(0x8)
	Class StaticMeshComponent*                                   wsp_bush_06_b_01;                                  // 0x418(0x8)
};


// Size 0x18
class bsp_bsh_cluster_01_i_C: public BP_Placement_HeightDrop_C
{
public:
	Class StaticMeshComponent*                                   StaticMeshComponent03;                             // 0x410(0x8)
	Class StaticMeshComponent*                                   StaticMeshComponent01;                             // 0x418(0x8)
	Class SceneComponent*                                        SharedRoot;                                        // 0x420(0x8)
};


// Size 0x18
class bsp_bsh_cluster_01_h_C: public BP_Placement_HeightDrop_C
{
public:
	Class StaticMeshComponent*                                   wsp_bush_03_a6;                                    // 0x410(0x8)
	Class StaticMeshComponent*                                   wsp_bush_01_a20;                                   // 0x418(0x8)
	Class SceneComponent*                                        Scene;                                             // 0x420(0x8)
};


// Size 0x30
class bsp_bsh_cluster_01_g_C: public BP_Placement_HeightDrop_C
{
public:
	Class StaticMeshComponent*                                   StaticMesh1;                                       // 0x410(0x8)
	Class StaticMeshComponent*                                   StaticMesh5;                                       // 0x418(0x8)
	Class StaticMeshComponent*                                   StaticMesh4;                                       // 0x420(0x8)
	Class StaticMeshComponent*                                   StaticMesh3;                                       // 0x428(0x8)
	Class StaticMeshComponent*                                   wsp_bush_01_a20;                                   // 0x430(0x8)
	Class SceneComponent*                                        Scene;                                             // 0x438(0x8)
};


// Size 0x10
class bsp_bsh_cluster_01_f_C: public BP_Placement_HeightDrop_C
{
public:
	Class StaticMeshComponent*                                   wsp_bush_06_a7;                                    // 0x410(0x8)
	Class SceneComponent*                                        Scene;                                             // 0x418(0x8)
};


// Size 0x18
class bsp_bsh_cluster_01_c_C: public BP_Placement_HeightDrop_C
{
public:
	Class StaticMeshComponent*                                   wsp_bush_06_b_01;                                  // 0x410(0x8)
	Class StaticMeshComponent*                                   wsp_bush_01_a6;                                    // 0x418(0x8)
	Class SceneComponent*                                        Scene;                                             // 0x420(0x8)
};


// Size 0x20
class bsp_bsh_cluster_01_b_C: public BP_Placement_HeightDrop_C
{
public:
	Class StaticMeshComponent*                                   wsp_rock_cliff_l_01;                               // 0x410(0x8)
	Class StaticMeshComponent*                                   wsp_bush_01_a2;                                    // 0x418(0x8)
	Class StaticMeshComponent*                                   wsp_bush_06_b2;                                    // 0x420(0x8)
	Class SceneComponent*                                        Scene1;                                            // 0x428(0x8)
};


}