// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x18
struct CrewTrackedItemOwnershipSet
{
public:
	Class Actor*                                                 Item;                                              // 0x0(0x8)
	Struct Guid                                                  CrewId;                                            // 0x8(0x10)
};


// Size 0x30
struct CrewTrackedItemOwnershipChanged
{
public:
	Class Actor*                                                 Item;                                              // 0x0(0x8)
	Struct Guid                                                  CrewId;                                            // 0x8(0x10)
	Struct Guid                                                  PreviousCrewId;                                    // 0x18(0x10)
	bool                                                         IsFirstTimeOwnedByThisCrew;                        // 0x28(0x1)
};


// Size 0x10
struct OwnerListEntry
{
public:
	TArray<Struct Guid>                                          OwnerList;                                         // 0x0(0x10)
};


// Size 0x18
struct TrackItemOwnershipEvent
{
public:
	Class Actor*                                                 TrackedItem;                                       // 0x0(0x8)
};


}