// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x18
struct CustomServerEvent
{
public:
	struct FName                                                 EventID;                                           // 0x8(0x8)
	Struct DateTime                                              ServerTimeUTC;                                     // 0x10(0x8)
};


// Size 0x20
struct EntityCustomServerEvent
{
public:
	int                                                          EntityNetId;                                       // 0x18(0x4)
};


// Size 0x30
struct OnCannonBallHitShipCustomServerEvent
{
public:
	Struct FString                                               CannonBallType;                                    // 0x18(0x10)
	int                                                          ShipId;                                            // 0x28(0x4)
};


// Size 0x18
struct GlobalCustomServerEvent
{
public:
};


// Size 0x20
struct PlayerCharacterEnteredShipCustomServerEvent
{
public:
	int                                                          UserId;                                            // 0x18(0x4)
	int                                                          ShipId;                                            // 0x1c(0x4)
};


// Size 0x28
struct WatercraftSpawnCustomServerEvent
{
public:
	Struct FString                                               WatercraftId;                                      // 0x18(0x10)
};


// Size 0x28
struct WatercraftDespawnCustomServerEvent
{
public:
	Struct FString                                               WatercraftId;                                      // 0x18(0x10)
};


// Size 0x18
struct TreasureSpawnedCustomServerEvent
{
public:
};


// Size 0x68
struct TreasureSoldCustomServerEvent
{
public:
	Struct FString                                               UserId;                                            // 0x18(0x10)
	Struct FString                                               CrewId;                                            // 0x28(0x10)
	Struct FString                                               TreasureType;                                      // 0x38(0x10)
	Struct FString                                               VendorId;                                          // 0x48(0x10)
	Struct FString                                               CompanyId;                                         // 0x58(0x10)
};


// Size 0x28
struct TreasurePickedUpCustomServerEvent
{
public:
	Struct FString                                               UserId;                                            // 0x18(0x10)
};


// Size 0x38
struct TreasureFoundCustomServerEvent
{
public:
	Struct FString                                               UserId;                                            // 0x18(0x10)
	Struct FString                                               TreasureType;                                      // 0x28(0x10)
};


// Size 0x48
struct TreasureDroppedCustomServerEvent
{
public:
	Struct FString                                               UserId;                                            // 0x18(0x10)
	Struct FString                                               TreasureType;                                      // 0x28(0x10)
	Struct Vector                                                Position;                                          // 0x38(0xc)
};


// Size 0x28
struct ShovelCustomServerEvent
{
public:
	Struct FString                                               UserId;                                            // 0x18(0x10)
};


// Size 0x38
struct ShipSpawnedCustomServerEvent
{
public:
	Struct FString                                               ShipId;                                            // 0x18(0x10)
	Struct FString                                               ShipType;                                          // 0x28(0x10)
};


// Size 0x38
struct ShipRepairCustomServerEvent
{
public:
	Struct FString                                               UserId;                                            // 0x18(0x10)
	Struct FString                                               ShipId;                                            // 0x28(0x10)
};


// Size 0x28
struct ShipOnFireEndCustomServerEvent
{
public:
	Struct FString                                               ShipId;                                            // 0x18(0x10)
};


// Size 0x38
struct ShipMastCollapseStateCustomServerEvent
{
public:
	Struct FString                                               ShipId;                                            // 0x18(0x10)
	Struct FString                                               MastId;                                            // 0x28(0x10)
};


// Size 0x28
struct ShipDestroyedCustomServerEvent
{
public:
	Struct FString                                               ShipId;                                            // 0x18(0x10)
};


// Size 0x28
struct ShipDamagedCustomServerEvent
{
public:
	Struct FString                                               ShipId;                                            // 0x18(0x10)
};


// Size 0x28
struct ProjectileWeaponFiredCustomServerEvent
{
public:
	Struct FString                                               UserId;                                            // 0x18(0x10)
};


// Size 0x38
struct ProjectileHitCustomServerEvent
{
public:
	Struct FString                                               ProjectileType;                                    // 0x18(0x10)
	Struct FString                                               RecipientId;                                       // 0x28(0x10)
};


// Size 0x38
struct PlayerStatusEffectActivatedCustomServerEvent
{
public:
	Struct FString                                               UserId;                                            // 0x18(0x10)
	Struct FString                                               Effect;                                            // 0x28(0x10)
};


// Size 0x38
struct PlayerStatusEffectDeactivatedCustomServerEvent
{
public:
	Struct FString                                               UserId;                                            // 0x18(0x10)
	Struct FString                                               Effect;                                            // 0x28(0x10)
};


// Size 0x28
struct PlayerSpawnCustomServerEvent
{
public:
	Struct FString                                               UserId;                                            // 0x18(0x10)
};


// Size 0x38
struct PlayerSetFootLocationCustomServerEvent
{
public:
	Struct FString                                               UserId;                                            // 0x18(0x10)
	Struct FString                                               Location;                                          // 0x28(0x10)
};


// Size 0x28
struct PlayerRevivalCustomServerEvent
{
public:
	Struct FString                                               UserId;                                            // 0x18(0x10)
};


// Size 0x18
struct PlayerRequiresMermaidCustomServerEvent
{
public:
};


// Size 0x28
struct PlayerRadialChatCustomServerEvent
{
public:
	Struct FString                                               UserId;                                            // 0x18(0x10)
};


// Size 0x28
struct PlayerObjectUsageStartCustomServerEvent
{
public:
	Struct FString                                               UserId;                                            // 0x18(0x10)
};


// Size 0x18
struct PlayerLeftGhostShipCustomServerEvent
{
public:
};


// Size 0x28
struct PlayerKillAICustomServerEvent
{
public:
	Struct FString                                               UserId;                                            // 0x18(0x10)
};


// Size 0x28
struct PlayerItemUsageEndCustomServerEvent
{
public:
	Struct FString                                               UserId;                                            // 0x18(0x10)
};


// Size 0x28
struct PlayerItemRetrievalFromContainerCustomServerEvent
{
public:
	Struct FString                                               UserId;                                            // 0x18(0x10)
};


// Size 0x28
struct PlayerItemEquipCustomServerEvent
{
public:
	Struct FString                                               UserId;                                            // 0x18(0x10)
};


// Size 0x28
struct PlayerItemAddToContainerCustomServerEvent
{
public:
	Struct FString                                               UserId;                                            // 0x18(0x10)
};


// Size 0x28
struct PlayerInReviveableStateCustomServerEvent
{
public:
	Struct FString                                               UserId;                                            // 0x18(0x10)
};


// Size 0x28
struct PlayerHeartbeatCustomServerEvent
{
public:
	Struct FString                                               UserId;                                            // 0x18(0x10)
};


// Size 0x28
struct PlayerHealthChangeCustomServerEvent
{
public:
	Struct FString                                               UserId;                                            // 0x18(0x10)
};


// Size 0x28
struct PlayerGameFishingCustomServerEvent
{
public:
	Struct FString                                               UserId;                                            // 0x18(0x10)
};


// Size 0x18
struct PlayerEncounterStartCustomServerEvent
{
public:
};


// Size 0x18
struct PlayerEncounterEndCustomServerEvent
{
public:
};


// Size 0x38
struct PlayerEmoteCustomServerEvent
{
public:
	Struct FString                                               UserId;                                            // 0x18(0x10)
	Struct FString                                               Emote;                                             // 0x28(0x10)
};


// Size 0x28
struct PlayerDeathCustomServerEvent
{
public:
	Struct FString                                               UserId;                                            // 0x18(0x10)
};


// Size 0x38
struct PlayerChangedShipLoadoutCustomServerEvent
{
public:
	Struct FString                                               UserId;                                            // 0x18(0x10)
	Struct FString                                               ShipId;                                            // 0x28(0x10)
};


// Size 0x28
struct PlayerChangedLoadoutCustomServerEvent
{
public:
	Struct FString                                               UserId;                                            // 0x18(0x10)
};


// Size 0x38
struct PlayerCapstanUsageStartCustomServerEvent
{
public:
	Struct FString                                               UserId;                                            // 0x18(0x10)
	Struct FString                                               ShipId;                                            // 0x28(0x10)
};


// Size 0x38
struct PlayerCapstanUsageEndCustomServerEvent
{
public:
	Struct FString                                               UserId;                                            // 0x18(0x10)
	Struct FString                                               ShipId;                                            // 0x28(0x10)
};


// Size 0x28
struct PlayerBucketScoopCustomServerEvent
{
public:
	Struct FString                                               UserId;                                            // 0x18(0x10)
};


// Size 0x28
struct PlayerBucketEmptyCustomServerEvent
{
public:
	Struct FString                                               UserId;                                            // 0x18(0x10)
};


// Size 0x38
struct PlayerActionCannonCustomServerEvent
{
public:
	Struct FString                                               UserId;                                            // 0x18(0x10)
	Struct FString                                               ShipId;                                            // 0x28(0x10)
};


// Size 0x38
struct PlayerActionCustomServerEvent
{
public:
	Struct FString                                               UserId;                                            // 0x18(0x10)
	Struct FString                                               Action;                                            // 0x28(0x10)
};


// Size 0x28
struct MermaidUsedCustomServerEvent
{
public:
	Struct FString                                               UserId;                                            // 0x18(0x10)
};


// Size 0x28
struct MermaidSpawnedCustomServerEvent
{
public:
	Struct Vector                                                Position;                                          // 0x18(0xc)
};


// Size 0x28
struct MeleeWeaponAttackCustomServerEvent
{
public:
	Struct FString                                               UserId;                                            // 0x18(0x10)
};


// Size 0x18
struct LevelLoadCompletedCustomServerEvent
{
public:
};


// Size 0x20
struct KrakenTentacleDestroyedCustomServerEvent
{
public:
	int                                                          TentacleRemaining;                                 // 0x18(0x4)
};


// Size 0x28
struct KrakenSpawnCustomServerEvent
{
public:
	Struct Vector                                                Position;                                          // 0x18(0xc)
};


// Size 0x38
struct ItemSpawnCustomServerEvent
{
public:
	Struct FString                                               ItemId;                                            // 0x18(0x10)
	Struct FString                                               ItemType;                                          // 0x28(0x10)
};


// Size 0x18
struct FortWaveCompletedCustomServerEvent
{
public:
};


// Size 0x28
struct FortKeyUsedCustomServerEvent
{
public:
	Struct FString                                               UserId;                                            // 0x18(0x10)
};


// Size 0x20
struct CustomTriggerOverlapCustomServerEvent
{
public:
	int                                                          TriggerNetId;                                      // 0x18(0x4)
	int                                                          OtherNetId;                                        // 0x1c(0x4)
};


// Size 0x28
struct CrewSessionLeaveCustomServerEvent
{
public:
	Struct FString                                               CrewId;                                            // 0x18(0x10)
};


// Size 0x28
struct CrewPlayerLeftCustomServerEvent
{
public:
	Struct FString                                               CrewId;                                            // 0x18(0x10)
};


// Size 0x38
struct CookStartCustomServerEvent
{
public:
	Struct FString                                               UserId;                                            // 0x18(0x10)
	Struct FString                                               FoodType;                                          // 0x28(0x10)
};


// Size 0x48
struct CookEndCustomServerEvent
{
public:
	Struct FString                                               UserId;                                            // 0x18(0x10)
	Struct FString                                               FoodType;                                          // 0x28(0x10)
	Struct FString                                               CookedState;                                       // 0x38(0x10)
};


// Size 0x38
struct AISpawnCustomServerEvent
{
public:
	Struct FString                                               AIId;                                              // 0x18(0x10)
	Struct FString                                               AIType;                                            // 0x28(0x10)
};


// Size 0x28
struct AIShipSpawnCustomServerEvent
{
public:
	Struct FString                                               AIShipId;                                          // 0x18(0x10)
};


// Size 0x28
struct AIShipDespawnCustomServerEvent
{
public:
	Struct FString                                               AIShipId;                                          // 0x18(0x10)
};


// Size 0x30
struct AIShipDamagedCustomServerEvent
{
public:
	Struct FString                                               AIShipId;                                          // 0x18(0x10)
	float                                                        AIShipWaterLevel;                                  // 0x28(0x4)
};


// Size 0x18
struct TinySharkSpawnCustomServerEvent
{
public:
};


}