// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x58
class dvr_sea_rock_cluster_h_C: public Actor
{
public:
	Class StaticMeshComponent*                                   None;                                              // 0x3d0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x3d8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x3e0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x3e8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x3f0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x3f8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x400(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x408(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x410(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x418(0x8)
	Class SceneComponent*                                        None;                                              // 0x420(0x8)
};


// Size 0x38
class dvr_sea_rock_cluster_g_C: public Actor
{
public:
	Class StaticMeshComponent*                                   None;                                              // 0x3d0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x3d8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x3e0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x3e8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x3f0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x3f8(0x8)
	Class SceneComponent*                                        None;                                              // 0x400(0x8)
};


// Size 0x50
class dvr_sea_rock_cluster_f_C: public Actor
{
public:
	Class StaticMeshComponent*                                   None;                                              // 0x3d0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x3d8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x3e0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x3e8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x3f0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x3f8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x400(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x408(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x410(0x8)
	Class SceneComponent*                                        None;                                              // 0x418(0x8)
};


// Size 0x58
class dvr_sea_rock_cluster_e_C: public Actor
{
public:
	Class StaticMeshComponent*                                   None;                                              // 0x3d0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x3d8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x3e0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x3e8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x3f0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x3f8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x400(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x408(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x410(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x418(0x8)
	Class SceneComponent*                                        None;                                              // 0x420(0x8)
};


// Size 0x68
class dvr_sea_rock_cluster_d_C: public Actor
{
public:
	Class StaticMeshComponent*                                   None;                                              // 0x3d0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x3d8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x3e0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x3e8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x3f0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x3f8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x400(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x408(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x410(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x418(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x420(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x428(0x8)
	Class SceneComponent*                                        None;                                              // 0x430(0x8)
};


// Size 0x58
class dvr_sea_rock_cluster_c_C: public Actor
{
public:
	Class StaticMeshComponent*                                   None;                                              // 0x3d0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x3d8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x3e0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x3e8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x3f0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x3f8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x400(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x408(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x410(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x418(0x8)
	Class SceneComponent*                                        None;                                              // 0x420(0x8)
};


// Size 0x60
class dvr_sea_rock_cluster_b_C: public Actor
{
public:
	Class StaticMeshComponent*                                   None;                                              // 0x3d0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x3d8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x3e0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x3e8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x3f0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x3f8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x400(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x408(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x410(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x418(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x420(0x8)
	Class SceneComponent*                                        None;                                              // 0x428(0x8)
};


// Size 0x58
class dvr_sea_rock_cluster_a_C: public Actor
{
public:
	Class StaticMeshComponent*                                   None;                                              // 0x3d0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x3d8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x3e0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x3e8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x3f0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x3f8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x400(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x408(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x410(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x418(0x8)
	Class SceneComponent*                                        None;                                              // 0x420(0x8)
};


}