// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x50
class BP_PromptActor_EmissaryKilledAnotherEmissary_AF_C: public BP_PromptActorBase_C
{
public:
	Struct PointerToUberGraphFrame                               UberGraphFrame;                                    // 0x408(0x8)
	BlueprintGeneratedClass BP_Prompt_EmissaryKilledAnotherEmissary_C* PromptCoordinator;                                 // 0x410(0x8)
	class                                                        PromptCounterAccessKey;                            // 0x418(0x8)
	class                                                        Company;                                           // 0x420(0x8)
	TArray<Struct Prompts>                                       Prompts;                                           // 0x428(0x10)
	TArray<Name H>                                           ExpectedVictimCompanyName;                         // 0x438(0x10)
	TArray<Class ExpectedVictimCompanies>                        ExpectedVictimCompanies;                           // 0x448(0x10)
};


// Size 0x50
class BP_PromptActor_EmissaryKilledAnotherEmissary_GH_C: public BP_PromptActorBase_C
{
public:
	Struct PointerToUberGraphFrame                               UberGraphFrame;                                    // 0x408(0x8)
	BlueprintGeneratedClass BP_Prompt_EmissaryKilledAnotherEmissary_C* PromptCoordinator;                                 // 0x410(0x8)
	class                                                        PromptCounterAccessKey;                            // 0x418(0x8)
	class                                                        Company;                                           // 0x420(0x8)
	TArray<Struct Prompts>                                       Prompts;                                           // 0x428(0x10)
	TArray<Struct FName>                                         ExpectedVictimCompanyName;                         // 0x438(0x10)
	TArray<Class ExpectedVictimCompanies>                        ExpectedVictimCompanies;                           // 0x448(0x10)
};


// Size 0x50
class BP_PromptActor_EmissaryKilledAnotherEmissary_MA_C: public BP_PromptActorBase_C
{
public:
	Struct PointerToUberGraphFrame                               UberGraphFrame;                                    // 0x408(0x8)
	BlueprintGeneratedClass BP_Prompt_EmissaryKilledAnotherEmissary_C* PromptCoordinator;                                 // 0x410(0x8)
	class                                                        PromptCounterAccessKey;                            // 0x418(0x8)
	class                                                        Company;                                           // 0x420(0x8)
	TArray<Struct Prompts>                                       Prompts;                                           // 0x428(0x10)
	TArray<Name None>                                            ExpectedVictimCompanyName;                         // 0x438(0x10)
	TArray<Class ExpectedVictimCompanies>                        ExpectedVictimCompanies;                           // 0x448(0x10)
};


// Size 0x50
class BP_PromptActor_EmissaryKilledAnotherEmissary_OOS_C: public BP_PromptActorBase_C
{
public:
	Struct PointerToUberGraphFrame                               UberGraphFrame;                                    // 0x408(0x8)
	BlueprintGeneratedClass BP_Prompt_EmissaryKilledAnotherEmissary_C* PromptCoordinator;                                 // 0x410(0x8)
	class                                                        PromptCounterAccessKey;                            // 0x418(0x8)
	class                                                        Company;                                           // 0x420(0x8)
	TArray<Struct >                                              Prompts;                                           // 0x428(0x10)
	TArray<Struct FName>                                         ExpectedVictimCompanyName;                         // 0x438(0x10)
	TArray<Class ExpectedVictimCompanies>                        ExpectedVictimCompanies;                           // 0x448(0x10)
};


// Size 0x50
class BP_PromptActor_EmissaryKilledAnotherEmissary_RB_C: public BP_PromptActorBase_C
{
public:
	Struct PointerToUberGraphFrame                               UberGraphFrame;                                    // 0x408(0x8)
	BlueprintGeneratedClass BP_Prompt_EmissaryKilledAnotherEmissary_C* PromptCoordinator;                                 // 0x410(0x8)
	class                                                        PromptCounterAccessKey;                            // 0x418(0x8)
	class                                                        Company;                                           // 0x420(0x8)
	TArray<Struct Prompts>                                       Prompts;                                           // 0x428(0x10)
	TArray<Struct FName>                                         ExpectedVictimCompanyName;                         // 0x438(0x10)
	TArray<Class ExpectedVictimCompanies>                        ExpectedVictimCompanies;                           // 0x448(0x10)
};


}