// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x38
class BP_PromptActor_EmissaryEntitlementPurchased_AF_C: public BP_PromptActorBase_C
{
public:
	Struct PointerToUberGraphFrame                               UberGraphFrame;                                    // 0x408(0x8)
	BlueprintGeneratedClass BP_Prompt_EmissaryEntitlementPurchased_C* PromptCoordinator;                                 // 0x410(0x8)
	class                                                        PromptCounterAccessKey;                            // 0x418(0x8)
	Struct Guid                                                  OfferId;                                           // 0x420(0x10)
	TArray<Struct Prompts>                                       Prompts;                                           // 0x430(0x10)
};


// Size 0x38
class BP_PromptActor_EmissaryEntitlementPurchased_GH_C: public BP_PromptActorBase_C
{
public:
	Struct PointerToUberGraphFrame                               UberGraphFrame;                                    // 0x408(0x8)
	BlueprintGeneratedClass BP_Prompt_EmissaryEntitlementPurchased_C* PromptCoordinator;                                 // 0x410(0x8)
	class                                                        PromptCounterAccessKey;                            // 0x418(0x8)
	Struct Guid                                                  OfferId;                                           // 0x420(0x10)
	TArray<Struct Prompts>                                       Prompts;                                           // 0x430(0x10)
};


// Size 0x38
class BP_PromptActor_EmissaryEntitlementPurchased_MA_C: public BP_PromptActorBase_C
{
public:
	Struct PointerToUberGraphFrame                               UberGraphFrame;                                    // 0x408(0x8)
	BlueprintGeneratedClass BP_Prompt_EmissaryEntitlementPurchased_C* PromptCoordinator;                                 // 0x410(0x8)
	class                                                        PromptCounterAccessKey;                            // 0x418(0x8)
	Struct Guid                                                  OfferId;                                           // 0x420(0x10)
	TArray<Struct Prompts>                                       Prompts;                                           // 0x430(0x10)
};


// Size 0x38
class BP_PromptActor_EmissaryEntitlementPurchased_OOS_C: public BP_PromptActorBase_C
{
public:
	Struct PointerToUberGraphFrame                               UberGraphFrame;                                    // 0x408(0x8)
	BlueprintGeneratedClass BP_Prompt_EmissaryEntitlementPurchased_C* PromptCoordinator;                                 // 0x410(0x8)
	class                                                        PromptCounterAccessKey;                            // 0x418(0x8)
	Struct Guid                                                  OfferId;                                           // 0x420(0x10)
	TArray<Struct None>                                          Prompts;                                           // 0x430(0x10)
};


// Size 0x38
class BP_PromptActor_EmissaryEntitlementPurchased_RB_C: public BP_PromptActorBase_C
{
public:
	Struct PointerToUberGraphFrame                               UberGraphFrame;                                    // 0x408(0x8)
	BlueprintGeneratedClass BP_Prompt_EmissaryEntitlementPurchased_C* PromptCoordinator;                                 // 0x410(0x8)
	class                                                        PromptCounterAccessKey;                            // 0x418(0x8)
	Struct Guid                                                  OfferId;                                           // 0x420(0x10)
	TArray<Struct Prompts>                                       Prompts;                                           // 0x430(0x10)
};


}