// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x30
class BP_PromptActor_EmissaryStoleLoot_AF_C: public BP_PromptActorBase_C
{
public:
	Struct PointerToUberGraphFrame                               UberGraphFrame;                                    // 0x408(0x8)
	BlueprintGeneratedClass BP_Prompt_EmissaryStoleLoot_C*       PromptCoordinator;                                 // 0x410(0x8)
	class                                                        PromptCounterAccessKey;                            // 0x418(0x8)
	class                                                        Company;                                           // 0x420(0x8)
	TArray<Struct Prompts>                                       Prompts;                                           // 0x428(0x10)
};


// Size 0x30
class BP_PromptActor_EmissaryStoleLoot_GH_C: public BP_PromptActorBase_C
{
public:
	Struct PointerToUberGraphFrame                               UberGraphFrame;                                    // 0x408(0x8)
	BlueprintGeneratedClass BP_Prompt_EmissaryStoleLoot_C*       PromptCoordinator;                                 // 0x410(0x8)
	class                                                        PromptCounterAccessKey;                            // 0x418(0x8)
	class                                                        Company;                                           // 0x420(0x8)
	TArray<Struct Prompts>                                       Prompts;                                           // 0x428(0x10)
};


// Size 0x30
class BP_PromptActor_EmissaryStoleLoot_MA_C: public BP_PromptActorBase_C
{
public:
	Struct PointerToUberGraphFrame                               UberGraphFrame;                                    // 0x408(0x8)
	BlueprintGeneratedClass BP_Prompt_EmissaryStoleLoot_C*       PromptCoordinator;                                 // 0x410(0x8)
	class                                                        PromptCounterAccessKey;                            // 0x418(0x8)
	class                                                        Company;                                           // 0x420(0x8)
	TArray<Struct Prompts>                                       Prompts;                                           // 0x428(0x10)
};


// Size 0x30
class BP_PromptActor_EmissaryStoleLoot_OOS_C: public BP_PromptActorBase_C
{
public:
	Struct PointerToUberGraphFrame                               UberGraphFrame;                                    // 0x408(0x8)
	BlueprintGeneratedClass BP_Prompt_EmissaryStoleLoot_C*       PromptCoordinator;                                 // 0x410(0x8)
	class                                                        PromptCounterAccessKey;                            // 0x418(0x8)
	class                                                        Company;                                           // 0x420(0x8)
	TArray<Struct Prompts>                                       Prompts;                                           // 0x428(0x10)
};


// Size 0x30
class BP_PromptActor_EmissaryStoleLoot_RB_C: public BP_PromptActorBase_C
{
public:
	Struct PointerToUberGraphFrame                               UberGraphFrame;                                    // 0x408(0x8)
	BlueprintGeneratedClass BP_Prompt_EmissaryStoleLoot_C*       PromptCoordinator;                                 // 0x410(0x8)
	class                                                        PromptCounterAccessKey;                            // 0x418(0x8)
	class                                                        Company;                                           // 0x420(0x8)
	TArray<Struct Prompts>                                       Prompts;                                           // 0x428(0x10)
};


}