// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0xa0
class ActorComponent: public Object
{
public:
	Struct ActorComponentTickFunction                            PrimaryComponentTick;                              // 0x30(0x50)
	TArray<Struct FName>                                         ComponentTags;                                     // 0x80(0x10)
	TArray<Struct SimpleMemberReference>                         UCSModifiedProperties;                             // 0x90(0x10)
	TArray<class AssetUserData*>                                 AssetUserData;                                     // 0xb0(0x10)
	bool                                                         bReplicates;                                       // 0xc0(0x1)
	bool                                                         bNetAddressable;                                   // 0xc0(0x1)
	bool                                                         bCreatedByConstructionScript;                      // 0xc1(0x1)
	bool                                                         bInstanceComponent;                                // 0xc1(0x1)
	bool                                                         bAutoActivate;                                     // 0xc2(0x1)
	bool                                                         bIsActive;                                         // 0xc2(0x1)
	bool                                                         bEditableWhenInherited;                            // 0xc2(0x1)
	bool                                                         bNeedsLoadForClient;                               // 0xc3(0x1)
	bool                                                         bNeedsLoadForServer;                               // 0xc3(0x1)
	byte                                                         TargetNetDormancy;                                 // 0xc4(0x1)
	byte                                                         CreationMethod;                                    // 0xc5(0x1)
};


// Size 0x3a8
class Actor: public Object
{
public:
	Struct ActorTickFunction                                     PrimaryActorTick;                                  // 0x28(0x50)
	float                                                        CustomTimeDilation;                                // 0x78(0x4)
	bool                                                         bAllowRemovalFromServerWhenCollisionMerged;        // 0x7c(0x1)
	bool                                                         bAllowRemovalFromServerWhenAutomaticallyInstanced; // 0x7c(0x1)
	bool                                                         bHidden;                                           // 0x7c(0x1)
	bool                                                         bNetTemporary;                                     // 0x7c(0x1)
	bool                                                         bNetStartup;                                       // 0x7c(0x1)
	bool                                                         bOnlyRelevantToOwner;                              // 0x7c(0x1)
	bool                                                         bAlwaysRelevant;                                   // 0x7c(0x1)
	bool                                                         bReplicateMovement;                                // 0x7c(0x1)
	bool                                                         bTearOff;                                          // 0x7d(0x1)
	bool                                                         bExchangedRoles;                                   // 0x7d(0x1)
	bool                                                         bPendingNetUpdate;                                 // 0x7d(0x1)
	bool                                                         bNetLoadOnClient;                                  // 0x7d(0x1)
	bool                                                         bNetUseOwnerRelevancy;                             // 0x7d(0x1)
	bool                                                         bBlockInput;                                       // 0x7d(0x1)
	bool                                                         bCanBeInCluster;                                   // 0x7d(0x1)
	bool                                                         bActorEnableCollision;                             // 0x7e(0x1)
	bool                                                         bReplicateAttachment;                              // 0x7e(0x1)
	bool                                                         bReplicates;                                       // 0x7e(0x1)
	byte                                                         RemoteRole;                                        // 0x82(0x1)
	Class Actor*                                                 Owner;                                             // 0x88(0x8)
	byte                                                         SpawnRestrictions;                                 // 0x90(0x1)
	Struct RepMovement                                           ReplicatedMovement;                                // 0x94(0x38)
	Struct RepAttachment                                         AttachmentReplication;                             // 0xd0(0x48)
	byte                                                         Role;                                              // 0x118(0x1)
	byte                                                         AutoReceiveInput;                                  // 0x11a(0x1)
	int                                                          InputPriority;                                     // 0x11c(0x4)
	Class InputComponent*                                        InputComponent;                                    // 0x120(0x8)
	float                                                        NetCullDistanceSquared;                            // 0x128(0x4)
	int                                                          NetTag;                                            // 0x130(0x4)
	float                                                        NetUpdateTime;                                     // 0x134(0x4)
	float                                                        NetUpdateFrequency;                                // 0x138(0x4)
	float                                                        NetPriority;                                       // 0x13c(0x4)
	float                                                        LastNetUpdateTime;                                 // 0x140(0x4)
	struct FName                                                 NetDriverName;                                     // 0x144(0x8)
	bool                                                         bAutoDestroyWhenFinished;                          // 0x14c(0x1)
	bool                                                         bCanBeDamaged;                                     // 0x14c(0x1)
	bool                                                         bActorIsBeingDestroyed;                            // 0x14c(0x1)
	bool                                                         bCollideWhenPlacing;                               // 0x14c(0x1)
	bool                                                         bFindCameraComponentWhenViewTarget;                // 0x14c(0x1)
	bool                                                         bRelevantForNetworkReplays;                        // 0x14c(0x1)
	byte                                                         SpawnCollisionHandlingMethod;                      // 0x150(0x1)
	Class Pawn*                                                  Instigator;                                        // 0x158(0x8)
	TArray<class Actor*>                                         Children;                                          // 0x160(0x10)
	Class SceneComponent*                                        RootComponent;                                     // 0x170(0x8)
	TArray<class ControllingMatineeActors*>                      ControllingMatineeActors;                          // 0x178(0x10)
	float                                                        InitialLifeSpan;                                   // 0x188(0x4)
	bool                                                         bAllowReceiveTickEventOnDedicatedServer;           // 0x190(0x1)
	TArray<Struct FName>                                         Layers;                                            // 0x198(0x10)
	Struct ActorPtr                                              ParentComponentActor;                              // 0x1a8(0x8)
	TArray<Weakclass ChildComponentActors>                       ChildComponentActors;                              // 0x1b0(0x10)
	bool                                                         bActorSeamlessTraveled;                            // 0x1c8(0x1)
	bool                                                         bIgnoresOriginShifting;                            // 0x1c8(0x1)
	bool                                                         bEnableAutoLODGeneration;                          // 0x1c8(0x1)
	bool                                                         InvertFeatureCheck;                                // 0x1c8(0x1)
	struct FName                                                 Feature;                                           // 0x1cc(0x8)
	TArray<Struct FName>                                         Tags;                                              // 0x1d8(0x10)
	bool                                                         bDoOverlapNotifiesOnLoad;                          // 0x231(0x1)
	TArray<class BlueprintCreatedComponents*>                    BlueprintCreatedComponents;                        // 0x328(0x10)
	TArray<class InstanceComponents*>                            InstanceComponents;                                // 0x338(0x10)
	TArray<class ChildActorInterfaceProviders*>                  ChildActorInterfaceProviders;                      // 0x350(0x10)
	double                                                       DormancyLingeringInSeconds;                        // 0x3c8(0x8)
};


// Size 0x0
class DataAsset: public Object
{
public:
};


// Size 0x0
class BlueprintFunctionLibrary: public Object
{
public:
};


// Size 0x208
class SceneComponent: public ActorComponent
{
public:
	Class SceneComponent*                                        AttachParent;                                      // 0xc8(0x8)
	TArray<class AttachChildren*>                                AttachChildren;                                    // 0xd0(0x10)
	struct FName                                                 AttachSocketName;                                  // 0xe0(0x8)
	bool                                                         bRequiresCustomLocation;                           // 0xe8(0x1)
	bool                                                         bAbsoluteLocation;                                 // 0xe8(0x1)
	bool                                                         bAbsoluteTranslation;                              // 0xe8(0x1)
	bool                                                         bAbsoluteRotation;                                 // 0xe8(0x1)
	bool                                                         bAbsoluteScale;                                    // 0xe8(0x1)
	bool                                                         bVisible;                                          // 0xe8(0x1)
	bool                                                         bHiddenInGame;                                     // 0xe8(0x1)
	bool                                                         bShouldUpdatePhysicsVolume;                        // 0xe8(0x1)
	bool                                                         bBoundsChangeTriggersStreamingDataRebuild;         // 0xe9(0x1)
	bool                                                         bUseAttachParentBound;                             // 0xe9(0x1)
	bool                                                         bComponentIsUnionOfChildren;                       // 0xe9(0x1)
	bool                                                         bJitterReduction;                                  // 0xe9(0x1)
	bool                                                         CacheRootVelocity;                                 // 0xe9(0x1)
	bool                                                         bWorldToComponentUpdated;                          // 0xe9(0x1)
	Struct Vector                                                RelativeScale3D;                                   // 0x11c(0xc)
	Struct Vector                                                RelativeLocation;                                  // 0x128(0xc)
	Struct Rotator                                               RelativeRotation;                                  // 0x134(0xc)
	byte                                                         Mobility;                                          // 0x220(0x1)
	byte                                                         DetailMode;                                        // 0x221(0x1)
	Struct Vector                                                ComponentVelocity;                                 // 0x22c(0xc)
	TArray<Struct FName>                                         SocketVelocitiesToCache;                           // 0x258(0x10)
	TArray<class MovedActors*>                                   MovedActors;                                       // 0x268(0x10)
};


// Size 0x78
class Pawn: public Actor
{
public:
	bool                                                         bUseControllerRotationPitch;                       // 0x3d8(0x1)
	bool                                                         bUseControllerRotationYaw;                         // 0x3d8(0x1)
	bool                                                         bUseControllerRotationRoll;                        // 0x3d8(0x1)
	bool                                                         bCanAffectNavigationGeneration;                    // 0x3d8(0x1)
	float                                                        BaseEyeHeight;                                     // 0x3dc(0x4)
	byte                                                         AutoPossessPlayer;                                 // 0x3e0(0x1)
	byte                                                         AutoPossessAI;                                     // 0x3e1(0x1)
	class                                                        AIControllerClass;                                 // 0x3e8(0x8)
	Class PlayerState*                                           PlayerState;                                       // 0x3f0(0x8)
	byte                                                         RemoteViewPitch;                                   // 0x3f8(0x1)
	Class Controller*                                            LastHitBy;                                         // 0x400(0x8)
	Class Controller*                                            Controller;                                        // 0x408(0x8)
	Struct Vector                                                ControlInputVector;                                // 0x428(0xc)
	Struct Vector                                                LastControlInputVector;                            // 0x434(0xc)
};


// Size 0x198
class Character: public Pawn
{
public:
	Class SkeletalMeshComponent*                                 Mesh;                                              // 0x448(0x8)
	Class CharacterMovementComponent*                            CharacterMovement;                                 // 0x450(0x8)
	Class CapsuleComponent*                                      CapsuleComponent;                                  // 0x458(0x8)
	Struct BasedMovementInfo                                     BasedMovement;                                     // 0x460(0x38)
	Struct BasedMovementInfo                                     ReplicatedBasedMovement;                           // 0x498(0x38)
	Struct Vector                                                BaseTranslationOffset;                             // 0x4d0(0xc)
	Struct Quat                                                  BaseRotationOffset;                                // 0x4e0(0x10)
	byte                                                         ReplicatedMovementMode;                            // 0x4f0(0x1)
	bool                                                         bInBaseReplication;                                // 0x4f1(0x1)
	float                                                        CrouchedEyeHeight;                                 // 0x4f4(0x4)
	bool                                                         bIsCrouched;                                       // 0x4f8(0x1)
	bool                                                         bPressedJump;                                      // 0x4f8(0x1)
	bool                                                         bClientUpdating;                                   // 0x4f8(0x1)
	bool                                                         bClientWasFalling;                                 // 0x4f8(0x1)
	bool                                                         bClientResimulateRootMotion;                       // 0x4f8(0x1)
	bool                                                         bSimGravityDisabled;                               // 0x4f8(0x1)
	bool                                                         bServerMoveIgnoreRootMotion;                       // 0x4f8(0x1)
	float                                                        JumpKeyHoldTime;                                   // 0x4fc(0x4)
	float                                                        JumpMaxHoldTime;                                   // 0x500(0x4)
	Struct RootMotionMovementParams                              ClientRootMotionParams;                            // 0x540(0x40)
	TArray<Struct SimulatedRootMotionReplicatedMove>             RootMotionRepMoves;                                // 0x580(0x10)
	Struct RepRootMotionMontage                                  RepRootMotion;                                     // 0x590(0x40)
};


// Size 0x88
class InputComponent: public ActorComponent
{
public:
};


// Size 0x418
class AnimInstance: public Object
{
public:
	Class Skeleton*                                              CurrentSkeleton;                                   // 0x28(0x8)
	TArray<Struct AnimTickRecord>                                UngroupedActivePlayers;                            // 0x30(0x10)
	TArray<Struct AnimGroupInstance>                             SyncGroups;                                        // 0x40(0x10)
	TArray<Struct ActiveVertexAnim>                              VertexAnims;                                       // 0x50(0x10)
	byte                                                         RootMotionMode;                                    // 0x60(0x1)
	bool                                                         bWarnAboutBlueprintUsage;                          // 0x61(0x1)
	bool                                                         bQueueMontageEvents;                               // 0x148(0x1)
	TArray<Struct AnimNotifyEvent>                               ActiveAnimNotifyState;                             // 0x240(0x10)
	bool                                                         bBoneCachesInvalidated;                            // 0x3a8(0x1)
	bool                                                         bBlueprintAnimUpdateEnabled;                       // 0x438(0x1)
};


// Size 0x10
class AnimNotify: public Object
{
public:
	bool                                                         PlayedWithSequencer;                               // 0x28(0x1)
};


// Size 0x0
class AnimNotifyState: public Object
{
public:
};


// Size 0x30
class AnimNotifyState_TimedParticleEffect: public AnimNotifyState
{
public:
	Class ParticleSystem*                                        PSTemplate;                                        // 0x28(0x8)
	struct FName                                                 SocketName;                                        // 0x30(0x8)
	Struct Vector                                                LocationOffset;                                    // 0x38(0xc)
	Struct Rotator                                               RotationOffset;                                    // 0x44(0xc)
	bool                                                         bOwnerOnlySee;                                     // 0x50(0x1)
	bool                                                         bOwnerNoSee;                                       // 0x51(0x1)
	bool                                                         bDestroyAtEnd;                                     // 0x52(0x1)
	bool                                                         bWorldOwnedEffect;                                 // 0x53(0x1)
};


// Size 0x570
class CameraComponent: public SceneComponent
{
public:
	float                                                        FieldOfView;                                       // 0x2d0(0x4)
	float                                                        OrthoWidth;                                        // 0x2d4(0x4)
	float                                                        OrthoNearClipPlane;                                // 0x2d8(0x4)
	float                                                        OrthoFarClipPlane;                                 // 0x2dc(0x4)
	float                                                        AspectRatio;                                       // 0x2e0(0x4)
	bool                                                         bConstrainAspectRatio;                             // 0x2e4(0x1)
	bool                                                         bUseFieldOfViewForLOD;                             // 0x2e4(0x1)
	bool                                                         bUsePawnControlRotation;                           // 0x2e4(0x1)
	byte                                                         ProjectionMode;                                    // 0x2e8(0x1)
	float                                                        PostProcessBlendWeight;                            // 0x2ec(0x4)
	Struct PostProcessSettings                                   PostProcessSettings;                               // 0x2f0(0x540)
	bool                                                         bUseControllerViewRotation;                        // 0x830(0x1)
};


// Size 0x48
class MovementComponent: public ActorComponent
{
public:
	Class SceneComponent*                                        UpdatedComponent;                                  // 0xc8(0x8)
	Class PrimitiveComponent*                                    UpdatedPrimitive;                                  // 0xd0(0x8)
	Struct Vector                                                Velocity;                                          // 0xdc(0xc)
	bool                                                         bConstrainToPlane;                                 // 0xe8(0x1)
	bool                                                         bSnapToPlaneAtStart;                               // 0xe8(0x1)
	byte                                                         PlaneConstraintAxisSetting;                        // 0xec(0x1)
	Struct Vector                                                PlaneConstraintNormal;                             // 0xf0(0xc)
	Struct Vector                                                PlaneConstraintOrigin;                             // 0xfc(0xc)
	bool                                                         bUpdateOnlyIfRendered;                             // 0x108(0x1)
	bool                                                         bAutoUpdateTickRegistration;                       // 0x108(0x1)
	bool                                                         bAutoRegisterUpdatedComponent;                     // 0x108(0x1)
};


// Size 0x48
class NavMovementComponent: public MovementComponent
{
public:
	Struct NavAgentProperties                                    NavAgentProps;                                     // 0x110(0x30)
	bool                                                         bUpdateNavAgentWithOwnersCollision;                // 0x140(0x1)
	Struct MovementProperties                                    MovementState;                                     // 0x144(0x4)
	bool                                                         UseDefaultNavWalkingSearchRadiusScale;             // 0x150(0x1)
	bool                                                         UseDefaultNavWalkingSearchHeightScale;             // 0x151(0x1)
};


// Size 0x8
class PawnMovementComponent: public NavMovementComponent
{
public:
	Class Pawn*                                                  PawnOwner;                                         // 0x158(0x8)
};


// Size 0x400
class CharacterMovementComponent: public PawnMovementComponent
{
public:
	Class Character*                                             CharacterOwner;                                    // 0x178(0x8)
	float                                                        GravityScale;                                      // 0x180(0x4)
	float                                                        MaxStepHeight;                                     // 0x184(0x4)
	float                                                        JumpZVelocity;                                     // 0x188(0x4)
	float                                                        JumpOffJumpZFactor;                                // 0x18c(0x4)
	float                                                        WalkableFloorAngle;                                // 0x190(0x4)
	float                                                        WalkableFloorZ;                                    // 0x194(0x4)
	byte                                                         MovementMode;                                      // 0x198(0x1)
	byte                                                         CustomMovementMode;                                // 0x199(0x1)
	float                                                        GroundFriction;                                    // 0x1c0(0x4)
	float                                                        MaxWalkSpeed;                                      // 0x1c4(0x4)
	float                                                        MaxWalkSpeedBackwards;                             // 0x1c8(0x4)
	float                                                        WalkBackwardsMinAngle;                             // 0x1cc(0x4)
	float                                                        WalkBackwardsMaxAngle;                             // 0x1d0(0x4)
	float                                                        MaxWalkSpeedCrouched;                              // 0x1d4(0x4)
	float                                                        MaxSwimSpeed;                                      // 0x1d8(0x4)
	float                                                        MaxFlySpeed;                                       // 0x1dc(0x4)
	float                                                        MaxCustomMovementSpeed;                            // 0x1e0(0x4)
	float                                                        MaxAcceleration;                                   // 0x1e4(0x4)
	float                                                        MaxChargeAcceleration;                             // 0x1e8(0x4)
	float                                                        BrakingFrictionFactor;                             // 0x1ec(0x4)
	float                                                        BrakingFriction;                                   // 0x1f0(0x4)
	bool                                                         bUseSeparateBrakingFriction;                       // 0x1f4(0x1)
	float                                                        BrakingDecelerationWalking;                        // 0x1f8(0x4)
	float                                                        BrakingDecelerationFalling;                        // 0x1fc(0x4)
	float                                                        BrakingDecelerationSwimming;                       // 0x200(0x4)
	float                                                        BrakingDecelerationFlying;                         // 0x204(0x4)
	float                                                        AirControl;                                        // 0x208(0x4)
	float                                                        AirControlBoostMultiplier;                         // 0x20c(0x4)
	float                                                        AirControlBoostVelocityThreshold;                  // 0x210(0x4)
	float                                                        FallingLateralFriction;                            // 0x214(0x4)
	float                                                        CrouchedHalfHeight;                                // 0x218(0x4)
	float                                                        Buoyancy;                                          // 0x21c(0x4)
	float                                                        PerchRadiusThreshold;                              // 0x220(0x4)
	float                                                        PerchAdditionalHeight;                             // 0x224(0x4)
	Struct Rotator                                               RotationRate;                                      // 0x228(0xc)
	bool                                                         bUseControllerDesiredRotation;                     // 0x234(0x1)
	bool                                                         bOrientRotationToMovement;                         // 0x234(0x1)
	bool                                                         bMovementInProgress;                               // 0x234(0x1)
	bool                                                         bEnableScopedMovementUpdates;                      // 0x234(0x1)
	bool                                                         bForceMaxAccel;                                    // 0x234(0x1)
	bool                                                         bRunPhysicsWithNoController;                       // 0x234(0x1)
	bool                                                         bForceNextFloorCheck;                              // 0x234(0x1)
	bool                                                         bShrinkProxyCapsule;                               // 0x234(0x1)
	bool                                                         bCanWalkOffLedges;                                 // 0x235(0x1)
	bool                                                         bCanWalkOffLedgesWhenCrouching;                    // 0x235(0x1)
	bool                                                         bDeferUpdateMoveComponent;                         // 0x235(0x1)
	Class SceneComponent*                                        DeferredUpdatedMoveComponent;                      // 0x238(0x8)
	float                                                        MaxOutOfWaterStepHeight;                           // 0x240(0x4)
	float                                                        OutofWaterZ;                                       // 0x244(0x4)
	float                                                        Mass;                                              // 0x248(0x4)
	bool                                                         bEnablePhysicsInteraction;                         // 0x24c(0x1)
	bool                                                         bTouchForceScaledToMass;                           // 0x24d(0x1)
	bool                                                         bPushForceScaledToMass;                            // 0x24e(0x1)
	bool                                                         bScalePushForceToVelocity;                         // 0x24f(0x1)
	float                                                        StandingDownwardForceScale;                        // 0x250(0x4)
	float                                                        InitialPushForceFactor;                            // 0x254(0x4)
	float                                                        PushForceFactor;                                   // 0x258(0x4)
	float                                                        PushForcePointZOffsetFactor;                       // 0x25c(0x4)
	float                                                        TouchForceFactor;                                  // 0x260(0x4)
	float                                                        MinTouchForce;                                     // 0x264(0x4)
	float                                                        MaxTouchForce;                                     // 0x268(0x4)
	float                                                        RepulsionForce;                                    // 0x26c(0x4)
	float                                                        NetMoveDelta;                                      // 0x270(0x4)
	bool                                                         bForceBraking;                                     // 0x274(0x1)
	float                                                        CrouchedSpeedMultiplier;                           // 0x278(0x4)
	float                                                        UpperImpactNormalScale;                            // 0x27c(0x4)
	Struct Vector                                                Acceleration;                                      // 0x280(0xc)
	Struct Vector                                                LastUpdateLocation;                                // 0x28c(0xc)
	Struct Vector                                                PendingImpulseToApply;                             // 0x298(0xc)
	Struct Vector                                                PendingForceToApply;                               // 0x2a4(0xc)
	float                                                        AnalogInputModifier;                               // 0x2b0(0x4)
	float                                                        MaxSimulationTimeStep;                             // 0x2c4(0x4)
	int                                                          MaxSimulationIterations;                           // 0x2c8(0x4)
	float                                                        MaxSmoothNetUpdateDist;                            // 0x2cc(0x4)
	float                                                        NoSmoothNetUpdateDist;                             // 0x2d0(0x4)
	float                                                        NetworkSimulatedSmoothLocationTime;                // 0x2d4(0x4)
	float                                                        NetworkSimulatedSmoothRotationTime;                // 0x2d8(0x4)
	float                                                        LedgeCheckThreshold;                               // 0x2dc(0x4)
	float                                                        JumpOutOfWaterPitch;                               // 0x2e0(0x4)
	Struct FindFloorResult                                       CurrentFloor;                                      // 0x2e4(0x8c)
	byte                                                         DefaultLandMovementMode;                           // 0x370(0x1)
	byte                                                         DefaultWaterMovementMode;                          // 0x371(0x1)
	byte                                                         GroundMovementMode;                                // 0x372(0x1)
	bool                                                         bMaintainHorizontalGroundVelocity;                 // 0x374(0x1)
	bool                                                         bImpartBaseVelocityX;                              // 0x374(0x1)
	bool                                                         bImpartBaseVelocityY;                              // 0x374(0x1)
	bool                                                         bImpartBaseVelocityZ;                              // 0x374(0x1)
	bool                                                         bImpartBaseAngularVelocity;                        // 0x374(0x1)
	bool                                                         bJustTeleported;                                   // 0x374(0x1)
	bool                                                         bNetworkUpdateReceived;                            // 0x374(0x1)
	bool                                                         bBasedMovementUpdateReceived;                      // 0x374(0x1)
	bool                                                         bMovementUpdateReceived;                           // 0x375(0x1)
	bool                                                         bNetworkMovementModeChanged;                       // 0x375(0x1)
	bool                                                         bNotifyApex;                                       // 0x375(0x1)
	bool                                                         bCheatFlying;                                      // 0x375(0x1)
	bool                                                         bWantsToCrouch;                                    // 0x375(0x1)
	bool                                                         bCrouchMaintainsBaseLocation;                      // 0x375(0x1)
	bool                                                         bIgnoreBaseRotation;                               // 0x375(0x1)
	bool                                                         bFastAttachedMove;                                 // 0x375(0x1)
	bool                                                         bAlwaysCheckFloor;                                 // 0x376(0x1)
	bool                                                         bUseFlatBaseForFloorChecks;                        // 0x376(0x1)
	bool                                                         bPerformingJumpOff;                                // 0x376(0x1)
	bool                                                         bWantsToLeaveNavWalking;                           // 0x376(0x1)
	bool                                                         bUseRVOAvoidance;                                  // 0x376(0x1)
	bool                                                         bRequestedMoveUseAcceleration;                     // 0x376(0x1)
	bool                                                         bPreventSimulatedFloorChecks;                      // 0x376(0x1)
	bool                                                         bPreventNavMeshFalling;                            // 0x376(0x1)
	bool                                                         bHasRequestedVelocity;                             // 0x377(0x1)
	bool                                                         bRequestedMoveWithMaxSpeed;                        // 0x377(0x1)
	bool                                                         bWasAvoidanceUpdated;                              // 0x377(0x1)
	bool                                                         bProjectNavMeshWalking;                            // 0x377(0x1)
	float                                                        SmoothingClientPositionTolerance;                  // 0x38c(0x4)
	float                                                        AvoidanceConsiderationRadius;                      // 0x390(0x4)
	Struct Vector                                                RequestedVelocity;                                 // 0x394(0xc)
	int                                                          AvoidanceUID;                                      // 0x3a0(0x4)
	Struct NavAvoidanceMask                                      AvoidanceGroup;                                    // 0x3a4(0x4)
	Struct NavAvoidanceMask                                      GroupsToAvoid;                                     // 0x3a8(0x4)
	Struct NavAvoidanceMask                                      GroupsToIgnore;                                    // 0x3ac(0x4)
	float                                                        AvoidanceWeight;                                   // 0x3b0(0x4)
	Struct Vector                                                PendingLaunchVelocity;                             // 0x3b4(0xc)
	float                                                        NavMeshProjectionInterval;                         // 0x458(0x4)
	float                                                        NavMeshProjectionTimer;                            // 0x45c(0x4)
	bool                                                         bUseNavMeshProjectionTimeModifier;                 // 0x460(0x1)
	float                                                        MaxNavMeshProjectionInterval;                      // 0x464(0x4)
	float                                                        NavMeshProjectionInterpSpeed;                      // 0x46c(0x4)
	bool                                                         bUsePlaneBasedNavMeshProjectionInterpSystem;       // 0x470(0x1)
	float                                                        MaxAllowedZOffsetFromCurrentPlane;                 // 0x474(0x4)
	float                                                        MaxZDiffFromPrevPlane;                             // 0x478(0x4)
	float                                                        NavMeshProjectionHeightScaleUp;                    // 0x498(0x4)
	float                                                        NavMeshProjectionHeightScaleDown;                  // 0x49c(0x4)
	bool                                                         UseControllerRotationInNavWalkingMoveComponent;    // 0x4a0(0x1)
	Struct CharacterMovementComponentPreClothTickFunction        PreClothComponentTick;                             // 0x4a8(0x50)
	float                                                        MinTimeBetweenTimeStampResets;                     // 0x50c(0x4)
	Struct RootMotionMovementParams                              RootMotionParams;                                  // 0x510(0x40)
	bool                                                         bWasSimulatingRootMotion;                          // 0x550(0x1)
};


// Size 0x10
class DeveloperSettings: public Object
{
public:
};


// Size 0x950
class Engine: public Object
{
public:
	Class Font*                                                  TinyFont;                                          // 0x30(0x8)
	Struct StringAssetReference                                  TinyFontName;                                      // 0x38(0x10)
	Class Font*                                                  SmallFont;                                         // 0x48(0x8)
	Struct StringAssetReference                                  SmallFontName;                                     // 0x50(0x10)
	Class Font*                                                  MediumFont;                                        // 0x60(0x8)
	Struct StringAssetReference                                  MediumFontName;                                    // 0x68(0x10)
	Class Font*                                                  LargeFont;                                         // 0x78(0x8)
	Struct StringAssetReference                                  LargeFontName;                                     // 0x80(0x10)
	Class Font*                                                  MonoFont;                                          // 0x90(0x8)
	Struct StringAssetReference                                  MonoFontName;                                      // 0x98(0x10)
	Class Font*                                                  SubtitleFont;                                      // 0xa8(0x8)
	Struct StringAssetReference                                  SubtitleFontName;                                  // 0xb0(0x10)
	Class Font*                                                  HugeFont;                                          // 0xc0(0x8)
	Struct StringAssetReference                                  HugeFontName;                                      // 0xc8(0x10)
	TArray<class AdditionalFonts*>                               AdditionalFonts;                                   // 0xd8(0x10)
	TArray<Str AdditionalFontNames>                              AdditionalFontNames;                               // 0xf0(0x10)
	class                                                        ConsoleClass;                                      // 0x100(0x8)
	Struct StringClassReference                                  ConsoleClassName;                                  // 0x108(0x10)
	class                                                        GameViewportClientClass;                           // 0x118(0x8)
	Struct StringClassReference                                  GameViewportClientClassName;                       // 0x120(0x10)
	class                                                        LocalPlayerClass;                                  // 0x130(0x8)
	Struct StringClassReference                                  LocalPlayerClassName;                              // 0x138(0x10)
	class                                                        WorldSettingsClass;                                // 0x148(0x8)
	Struct StringClassReference                                  WorldSettingsClassName;                            // 0x150(0x10)
	Struct StringClassReference                                  NavigationSystemClassName;                         // 0x160(0x10)
	class                                                        NavigationSystemClass;                             // 0x170(0x8)
	Struct StringClassReference                                  AvoidanceManagerClassName;                         // 0x178(0x10)
	class                                                        AvoidanceManagerClass;                             // 0x188(0x8)
	class                                                        PhysicsCollisionHandlerClass;                      // 0x190(0x8)
	Struct StringClassReference                                  PhysicsCollisionHandlerClassName;                  // 0x198(0x10)
	Struct StringClassReference                                  GameUserSettingsClassName;                         // 0x1a8(0x10)
	class                                                        GameUserSettingsClass;                             // 0x1b8(0x8)
	Struct StringClassReference                                  AIControllerClassName;                             // 0x1c0(0x10)
	Class GameUserSettings*                                      GameUserSettings;                                  // 0x1d0(0x8)
	class                                                        LevelScriptActorClass;                             // 0x1d8(0x8)
	Struct StringClassReference                                  LevelScriptActorClassName;                         // 0x1e0(0x10)
	Struct StringClassReference                                  DefaultBlueprintBaseClassName;                     // 0x1f0(0x10)
	Struct StringClassReference                                  GameSingletonClassName;                            // 0x200(0x10)
	Class Object*                                                GameSingleton;                                     // 0x210(0x8)
	class                                                        DefaultPreviewPawnClass;                           // 0x218(0x8)
	Struct StringClassReference                                  DefaultPreviewPawnClassName;                       // 0x220(0x10)
	Struct FString                                               PlayOnConsoleSaveDir;                              // 0x230(0x10)
	Class Texture2D*                                             DefaultTexture;                                    // 0x240(0x8)
	Struct StringAssetReference                                  DefaultTextureName;                                // 0x248(0x10)
	Class Texture*                                               DefaultDiffuseTexture;                             // 0x258(0x8)
	Struct StringAssetReference                                  DefaultDiffuseTextureName;                         // 0x260(0x10)
	Class Texture2D*                                             DefaultBSPVertexTexture;                           // 0x270(0x8)
	Struct StringAssetReference                                  DefaultBSPVertexTextureName;                       // 0x278(0x10)
	Class Texture2D*                                             HighFrequencyNoiseTexture;                         // 0x288(0x8)
	Struct StringAssetReference                                  HighFrequencyNoiseTextureName;                     // 0x290(0x10)
	Class Texture2D*                                             DefaultBokehTexture;                               // 0x2a0(0x8)
	Struct StringAssetReference                                  DefaultBokehTextureName;                           // 0x2a8(0x10)
	Class Texture2D*                                             HDRCalibrationTexture;                             // 0x2b8(0x8)
	Struct StringAssetReference                                  HDRCalibrationTextureName;                         // 0x2c0(0x10)
	Class Material*                                              WireframeMaterial;                                 // 0x2d0(0x8)
	Struct FString                                               WireframeMaterialName;                             // 0x2d8(0x10)
	Class Material*                                              DebugMeshMaterial;                                 // 0x2e8(0x8)
	Struct StringAssetReference                                  DebugMeshMaterialName;                             // 0x2f0(0x10)
	Class Material*                                              LevelColorationLitMaterial;                        // 0x300(0x8)
	Struct FString                                               LevelColorationLitMaterialName;                    // 0x308(0x10)
	Class Material*                                              LevelColorationUnlitMaterial;                      // 0x318(0x8)
	Struct FString                                               LevelColorationUnlitMaterialName;                  // 0x320(0x10)
	Class Material*                                              TriangleDensityScreenSpaceMaterial;                // 0x330(0x8)
	Struct FString                                               TriangleDensityScreenSpaceMaterialName;            // 0x338(0x10)
	Class Material*                                              TriangleDensityWorldSpaceMaterial;                 // 0x348(0x8)
	Struct FString                                               TriangleDensityWorldSpaceMaterialName;             // 0x350(0x10)
	Class Material*                                              LightingTexelDensityMaterial;                      // 0x360(0x8)
	Struct FString                                               LightingTexelDensityName;                          // 0x368(0x10)
	Class Material*                                              ShadedLevelColorationLitMaterial;                  // 0x378(0x8)
	Struct FString                                               ShadedLevelColorationLitMaterialName;              // 0x380(0x10)
	Class Material*                                              ShadedLevelColorationUnlitMaterial;                // 0x390(0x8)
	Struct FString                                               ShadedLevelColorationUnlitMaterialName;            // 0x398(0x10)
	Class Material*                                              RemoveSurfaceMaterial;                             // 0x3a8(0x8)
	Struct StringAssetReference                                  RemoveSurfaceMaterialName;                         // 0x3b0(0x10)
	Class Material*                                              VertexColorMaterial;                               // 0x3c0(0x8)
	Struct FString                                               VertexColorMaterialName;                           // 0x3c8(0x10)
	Class Material*                                              VertexColorViewModeMaterial_ColorOnly;             // 0x3d8(0x8)
	Struct FString                                               VertexColorViewModeMaterialName_ColorOnly;         // 0x3e0(0x10)
	Class Material*                                              VertexColorViewModeMaterial_AlphaAsColor;          // 0x3f0(0x8)
	Struct FString                                               VertexColorViewModeMaterialName_AlphaAsColor;      // 0x3f8(0x10)
	Class Material*                                              VertexColorViewModeMaterial_RedOnly;               // 0x408(0x8)
	Struct FString                                               VertexColorViewModeMaterialName_RedOnly;           // 0x410(0x10)
	Class Material*                                              VertexColorViewModeMaterial_GreenOnly;             // 0x420(0x8)
	Struct FString                                               VertexColorViewModeMaterialName_GreenOnly;         // 0x428(0x10)
	Class Material*                                              VertexColorViewModeMaterial_BlueOnly;              // 0x438(0x8)
	Struct FString                                               VertexColorViewModeMaterialName_BlueOnly;          // 0x440(0x10)
	Class Material*                                              ConstraintLimitMaterial;                           // 0x450(0x8)
	Class MaterialInstanceDynamic*                               ConstraintLimitMaterialX;                          // 0x458(0x8)
	Class MaterialInstanceDynamic*                               ConstraintLimitMaterialY;                          // 0x460(0x8)
	Class MaterialInstanceDynamic*                               ConstraintLimitMaterialZ;                          // 0x468(0x8)
	Struct StringAssetReference                                  ConstraintLimitMaterialName;                       // 0x470(0x10)
	Class Material*                                              InvalidLightmapSettingsMaterial;                   // 0x480(0x8)
	Struct StringAssetReference                                  InvalidLightmapSettingsMaterialName;               // 0x488(0x10)
	Class Material*                                              PreviewShadowsIndicatorMaterial;                   // 0x498(0x8)
	Struct StringAssetReference                                  PreviewShadowsIndicatorMaterialName;               // 0x4a0(0x10)
	Class Material*                                              ArrowMaterial;                                     // 0x4b0(0x8)
	Struct StringAssetReference                                  ArrowMaterialName;                                 // 0x4b8(0x10)
	Struct LinearColor                                           LightingOnlyBrightness;                            // 0x4c8(0x10)
	TArray<Struct Color>                                         LightComplexityColors;                             // 0x4d8(0x10)
	TArray<Struct LinearColor>                                   ShaderComplexityColors;                            // 0x4e8(0x10)
	TArray<Struct LinearColor>                                   StationaryLightOverlapColors;                      // 0x4f8(0x10)
	TArray<Struct LinearColor>                                   LODColorationColors;                               // 0x508(0x10)
	float                                                        MaxPixelShaderAdditiveComplexityCount;             // 0x518(0x4)
	float                                                        MaxES2PixelShaderAdditiveComplexityCount;          // 0x51c(0x4)
	float                                                        MinLightMapDensity;                                // 0x520(0x4)
	float                                                        IdealLightMapDensity;                              // 0x524(0x4)
	float                                                        MaxLightMapDensity;                                // 0x528(0x4)
	bool                                                         bRenderLightMapDensityGrayscale;                   // 0x52c(0x1)
	float                                                        RenderLightMapDensityGrayscaleScale;               // 0x530(0x4)
	float                                                        RenderLightMapDensityColorScale;                   // 0x534(0x4)
	Struct LinearColor                                           LightMapDensityVertexMappedColor;                  // 0x538(0x10)
	Struct LinearColor                                           LightMapDensitySelectedColor;                      // 0x548(0x10)
	TArray<Struct StatColorMapping>                              StatColorMappings;                                 // 0x558(0x10)
	Class PhysicalMaterial*                                      DefaultPhysMaterial;                               // 0x568(0x8)
	Struct StringAssetReference                                  DefaultPhysMaterialName;                           // 0x570(0x10)
	TArray<Struct GameNameRedirect>                              ActiveGameNameRedirects;                           // 0x580(0x10)
	TArray<Struct ClassRedirect>                                 ActiveClassRedirects;                              // 0x590(0x10)
	TArray<Struct PluginRedirect>                                ActivePluginRedirects;                             // 0x5a0(0x10)
	TArray<Struct StructRedirect>                                ActiveStructRedirects;                             // 0x5b0(0x10)
	Class Texture2D*                                             PreIntegratedSkinBRDFTexture;                      // 0x5c0(0x8)
	Struct StringAssetReference                                  PreIntegratedSkinBRDFTextureName;                  // 0x5c8(0x10)
	Class Texture2D*                                             MiniFontTexture;                                   // 0x5d8(0x8)
	Struct StringAssetReference                                  MiniFontTextureName;                               // 0x5e0(0x10)
	Class Texture*                                               WeightMapPlaceholderTexture;                       // 0x5f0(0x8)
	Struct StringAssetReference                                  WeightMapPlaceholderTextureName;                   // 0x5f8(0x10)
	Class Texture2D*                                             LightMapDensityTexture;                            // 0x608(0x8)
	Struct StringAssetReference                                  LightMapDensityTextureName;                        // 0x610(0x10)
	Class GameViewportClient*                                    GameViewport;                                      // 0x628(0x8)
	TArray<Str DeferredCommands>                                 DeferredCommands;                                  // 0x630(0x10)
	int                                                          TickCycles;                                        // 0x640(0x4)
	int                                                          GameCycles;                                        // 0x644(0x4)
	int                                                          ClientCycles;                                      // 0x648(0x4)
	float                                                        NearClipPlane;                                     // 0x64c(0x4)
	bool                                                         bHardwareSurveyEnabled;                            // 0x650(0x1)
	bool                                                         bSubtitlesEnabled;                                 // 0x650(0x1)
	bool                                                         bSubtitlesForcedOff;                               // 0x650(0x1)
	int                                                          MaximumLoopIterationCount;                         // 0x654(0x4)
	bool                                                         bCanBlueprintsTickByDefault;                       // 0x658(0x1)
	bool                                                         bOptimizeAnimBlueprintMemberVariableAccess;        // 0x658(0x1)
	bool                                                         bEnableEditorPSysRealtimeLOD;                      // 0x658(0x1)
	bool                                                         bSmoothFrameRate;                                  // 0x658(0x1)
	bool                                                         bUseFixedFrameRate;                                // 0x658(0x1)
	float                                                        FixedFrameRate;                                    // 0x65c(0x4)
	Struct FloatRange                                            SmoothedFrameRateRange;                            // 0x660(0x10)
	bool                                                         bCheckForMultiplePawnsSpawnedInAFrame;             // 0x670(0x1)
	int                                                          NumPawnsAllowedToBeSpawnedInAFrame;                // 0x674(0x4)
	bool                                                         bShouldGenerateLowQualityLightmaps;                // 0x678(0x1)
	Struct Color                                                 C_WorldBox;                                        // 0x67c(0x4)
	Struct Color                                                 C_BrushWire;                                       // 0x680(0x4)
	Struct Color                                                 C_AddWire;                                         // 0x684(0x4)
	Struct Color                                                 C_SubtractWire;                                    // 0x688(0x4)
	Struct Color                                                 C_SemiSolidWire;                                   // 0x68c(0x4)
	Struct Color                                                 C_NonSolidWire;                                    // 0x690(0x4)
	Struct Color                                                 C_WireBackground;                                  // 0x694(0x4)
	Struct Color                                                 C_ScaleBoxHi;                                      // 0x698(0x4)
	Struct Color                                                 C_VolumeCollision;                                 // 0x69c(0x4)
	Struct Color                                                 C_BSPCollision;                                    // 0x6a0(0x4)
	Struct Color                                                 C_OrthoBackground;                                 // 0x6a4(0x4)
	Struct Color                                                 C_Volume;                                          // 0x6a8(0x4)
	Struct Color                                                 C_BrushShape;                                      // 0x6ac(0x4)
	float                                                        StreamingDistanceFactor;                           // 0x6b0(0x4)
	byte                                                         TransitionType;                                    // 0x6b4(0x1)
	Struct FString                                               TransitionDescription;                             // 0x6b8(0x10)
	Struct FString                                               TransitionGameMode;                                // 0x6c8(0x10)
	float                                                        MeshLODRange;                                      // 0x6d8(0x4)
	bool                                                         bAllowMatureLanguage;                              // 0x6dc(0x1)
	float                                                        CameraRotationThreshold;                           // 0x6e0(0x4)
	float                                                        CameraTranslationThreshold;                        // 0x6e4(0x4)
	float                                                        PrimitiveProbablyVisibleTime;                      // 0x6e8(0x4)
	float                                                        MaxOcclusionPixelsFraction;                        // 0x6ec(0x4)
	bool                                                         bPauseOnLossOfFocus;                               // 0x6f0(0x1)
	int                                                          MaxParticleResize;                                 // 0x6f4(0x4)
	int                                                          MaxParticleResizeWarn;                             // 0x6f8(0x4)
	TArray<Struct DropNoteInfo>                                  PendingDroppedNotes;                               // 0x700(0x10)
	Struct RigidBodyErrorCorrection                              PhysicErrorCorrection;                             // 0x710(0x1c)
	float                                                        NetClientTicksPerSecond;                           // 0x72c(0x4)
	bool                                                         bHasPendingGlobalReregister;                       // 0x730(0x1)
	float                                                        DisplayGamma;                                      // 0x734(0x4)
	float                                                        MinDesiredFrameRate;                               // 0x738(0x4)
	Struct LinearColor                                           DefaultSelectedMaterialColor;                      // 0x73c(0x10)
	Struct LinearColor                                           SelectedMaterialColor;                             // 0x74c(0x10)
	Struct LinearColor                                           SelectionOutlineColor;                             // 0x75c(0x10)
	Struct LinearColor                                           SubduedSelectionOutlineColor;                      // 0x76c(0x10)
	Struct LinearColor                                           SelectedMaterialColorOverride;                     // 0x77c(0x10)
	bool                                                         bIsOverridingSelectedColor;                        // 0x78c(0x1)
	bool                                                         bEnableOnScreenDebugMessages;                      // 0x790(0x1)
	bool                                                         bEnableOnScreenDebugMessagesDisplay;               // 0x790(0x1)
	bool                                                         bSuppressMapWarnings;                              // 0x790(0x1)
	bool                                                         bCookSeparateSharedMPGameContent;                  // 0x790(0x1)
	bool                                                         bDisableAILogging;                                 // 0x790(0x1)
	int                                                          ScreenSaverInhibitorSemaphore;                     // 0x79c(0x4)
	bool                                                         bLockReadOnlyLevels;                               // 0x7a0(0x1)
	Struct FString                                               ParticleEventManagerClassPath;                     // 0x7a8(0x10)
	float                                                        SelectionHighlightIntensity;                       // 0x7c8(0x4)
	float                                                        BSPSelectionHighlightIntensity;                    // 0x7cc(0x4)
	float                                                        HoverHighlightIntensity;                           // 0x7d0(0x4)
	float                                                        SelectionHighlightIntensityBillboards;             // 0x7d4(0x4)
	TArray<Struct NetDriverDefinition>                           NetDriverDefinitions;                              // 0x908(0x10)
	TArray<Str ServerActors>                                     ServerActors;                                      // 0x918(0x10)
	TArray<Str RuntimeServerActors>                              RuntimeServerActors;                               // 0x928(0x10)
	bool                                                         bStartedLoadMapMovie;                              // 0x938(0x1)
	int                                                          NextWorldContextHandle;                            // 0x950(0x4)
};


// Size 0x70
class GameEngine: public Engine
{
public:
	float                                                        MaxDeltaTime;                                      // 0x978(0x4)
	float                                                        ServerFlushLogInterval;                            // 0x97c(0x4)
};


// Size 0x60
class GameInstance: public Object
{
public:
	TArray<class LocalPlayers*>                                  LocalPlayers;                                      // 0x38(0x10)
	Class OnlineSession*                                         OnlineSession;                                     // 0x50(0x8)
};


// Size 0x0
class Info: public Actor
{
public:
};


// Size 0xf8
class GameMode: public Info
{
public:
	bool                                                         bDisableAsyncOcclusionChecking;                    // 0x3d8(0x1)
	bool                                                         bUseSeamlessTravel;                                // 0x3d8(0x1)
	bool                                                         bPauseable;                                        // 0x3d8(0x1)
	bool                                                         bStartPlayersAsSpectators;                         // 0x3d8(0x1)
	bool                                                         bDelayedStart;                                     // 0x3d8(0x1)
	Struct FString                                               OptionsString;                                     // 0x3e0(0x10)
	class                                                        DefaultPawnClass;                                  // 0x3f0(0x8)
	class                                                        HUDClass;                                          // 0x3f8(0x8)
	int                                                          NumSpectators;                                     // 0x400(0x4)
	int                                                          NumPlayers;                                        // 0x404(0x4)
	int                                                          NumBots;                                           // 0x408(0x4)
	float                                                        MinRespawnDelay;                                   // 0x40c(0x4)
	Class GameSession*                                           GameSession;                                       // 0x410(0x8)
	int                                                          NumTravellingPlayers;                              // 0x418(0x4)
	Struct FText                                                 DefaultPlayerName;                                 // 0x420(0x38)
	class                                                        EngineMessageClass;                                // 0x458(0x8)
	class                                                        PlayerControllerClass;                             // 0x460(0x8)
	class                                                        SpectatorClass;                                    // 0x468(0x8)
	class                                                        ReplaySpectatorPlayerControllerClass;              // 0x470(0x8)
	class                                                        PlayerStateClass;                                  // 0x478(0x8)
	class                                                        GameStateClass;                                    // 0x480(0x8)
	Class GameState*                                             GameState;                                         // 0x488(0x8)
	TArray<class InactivePlayerArray*>                           InactivePlayerArray;                               // 0x490(0x10)
	TArray<Struct GameClassShortName>                            GameModeClassAliases;                              // 0x4b0(0x10)
	float                                                        InactivePlayerStateLifeSpan;                       // 0x4c0(0x4)
	bool                                                         bHandleDedicatedServerReplays;                     // 0x4c4(0x1)
};


// Size 0x2e0
class PrimitiveComponent: public SceneComponent
{
public:
	float                                                        MinDrawDistance;                                   // 0x2d8(0x4)
	float                                                        LDMaxDrawDistance;                                 // 0x2e0(0x4)
	float                                                        CachedMaxDrawDistance;                             // 0x2e4(0x4)
	byte                                                         DepthPriorityGroup;                                // 0x2e8(0x1)
	byte                                                         ViewOwnerDepthPriorityGroup;                       // 0x2e9(0x1)
	bool                                                         bAlwaysCreatePhysicsState;                         // 0x2ec(0x1)
	bool                                                         bGenerateOverlapEvents;                            // 0x2ec(0x1)
	bool                                                         bMultiBodyOverlap;                                 // 0x2ec(0x1)
	bool                                                         bCheckAsyncSceneOnMove;                            // 0x2ec(0x1)
	bool                                                         bTraceComplexOnMove;                               // 0x2ec(0x1)
	bool                                                         bReturnMaterialOnMove;                             // 0x2ec(0x1)
	bool                                                         bUseViewOwnerDepthPriorityGroup;                   // 0x2ec(0x1)
	bool                                                         bAllowCullDistanceVolume;                          // 0x2ec(0x1)
	bool                                                         bHasMotionBlurVelocityMeshes;                      // 0x2ed(0x1)
	bool                                                         bRenderInMainPass;                                 // 0x2ed(0x1)
	bool                                                         bRenderInCustomPrePass;                            // 0x2ed(0x1)
	bool                                                         bReflected;                                        // 0x2ed(0x1)
	bool                                                         bReflectedOnLowQuality;                            // 0x2ed(0x1)
	bool                                                         bFFTWaterMask;                                     // 0x2ed(0x1)
	bool                                                         bVolumeFogMask;                                    // 0x2ed(0x1)
	bool                                                         bAffectsFlatWater;                                 // 0x2ee(0x1)
	bool                                                         bGPUParticlesKillPlane;                            // 0x2ee(0x1)
	bool                                                         bDontCull;                                         // 0x2ee(0x1)
	bool                                                         bDontSizeOnScreenCull;                             // 0x2ee(0x1)
	float                                                        OverriddenShadowMinTexelSize;                      // 0x2f0(0x4)
	bool                                                         bOverrideShadowMinSizeCulling;                     // 0x2f4(0x1)
	bool                                                         bOverrideShadowCascadesExclusion;                  // 0x2f5(0x1)
	byte                                                         ExcludedShadowCascades;                            // 0x2f6(0x1)
	bool                                                         bReceivesDecals;                                   // 0x2f8(0x1)
	bool                                                         bOwnerNoSee;                                       // 0x2f8(0x1)
	bool                                                         bOnlyOwnerSee;                                     // 0x2f8(0x1)
	bool                                                         bTreatAsBackgroundForOcclusion;                    // 0x2f8(0x1)
	bool                                                         bIsACloud;                                         // 0x2f8(0x1)
	bool                                                         bUseAsOccluder;                                    // 0x2f8(0x1)
	bool                                                         bSelectable;                                       // 0x2f8(0x1)
	bool                                                         bForceMipStreaming;                                // 0x2f8(0x1)
	bool                                                         bHasPerInstanceHitProxies;                         // 0x2f9(0x1)
	bool                                                         CastShadow;                                        // 0x2f9(0x1)
	bool                                                         bAffectDynamicIndirectLighting;                    // 0x2f9(0x1)
	bool                                                         bUseFarCascadeLPVBiasMultiplier;                   // 0x2f9(0x1)
	bool                                                         bAffectDistanceFieldLighting;                      // 0x2f9(0x1)
	bool                                                         bCastDynamicShadow;                                // 0x2f9(0x1)
	bool                                                         bCastStaticShadow;                                 // 0x2f9(0x1)
	bool                                                         bCastVolumetricTranslucentShadow;                  // 0x2f9(0x1)
	bool                                                         bSelfShadowOnly;                                   // 0x2fa(0x1)
	bool                                                         bCastFarShadow;                                    // 0x2fa(0x1)
	bool                                                         bCastInsetShadow;                                  // 0x2fa(0x1)
	bool                                                         bCastCinematicShadow;                              // 0x2fa(0x1)
	bool                                                         bCastHiddenShadow;                                 // 0x2fa(0x1)
	bool                                                         bCastShadowAsTwoSided;                             // 0x2fa(0x1)
	bool                                                         bCastShadowOnLowQuality;                           // 0x2fa(0x1)
	bool                                                         bLightAsIfStatic;                                  // 0x2fa(0x1)
	bool                                                         bLightAttachmentsAsGroup;                          // 0x2fb(0x1)
	byte                                                         IndirectLightingCacheQuality;                      // 0x2fc(0x1)
	bool                                                         bHasCachedStaticLighting;                          // 0x2fd(0x1)
	bool                                                         bStaticLightingBuildEnqueued;                      // 0x2fe(0x1)
	bool                                                         bIgnoreRadialImpulse;                              // 0x300(0x1)
	bool                                                         bIgnoreRadialForce;                                // 0x300(0x1)
	bool                                                         AlwaysLoadOnClient;                                // 0x300(0x1)
	bool                                                         AlwaysLoadOnServer;                                // 0x300(0x1)
	bool                                                         bUseEditorCompositing;                             // 0x300(0x1)
	bool                                                         bRenderCustomDepth;                                // 0x300(0x1)
	bool                                                         bAllowVelocityInMaterial;                          // 0x300(0x1)
	int                                                          CustomDepthStencilValue;                           // 0x304(0x4)
	int                                                          TranslucencySortPriority;                          // 0x308(0x4)
	int                                                          VisibilityId;                                      // 0x30c(0x4)
	float                                                        LpvBiasMultiplier;                                 // 0x314(0x4)
	float                                                        FarCascadeLPVBiasMultiplier;                       // 0x318(0x4)
	float                                                        LpvIntensityMultiplier;                            // 0x31c(0x4)
	Struct CustomPrimitiveData                                   CustomPrimitiveData;                               // 0x320(0x10)
	Struct BodyInstance                                          BodyInstance;                                      // 0x330(0x180)
	bool                                                         bAffectRain;                                       // 0x4b0(0x1)
	bool                                                         bCanEverAffectNavigation;                          // 0x4b0(0x1)
	bool                                                         bSkipRenderingInOuterLPVCascades;                  // 0x4b0(0x1)
	bool                                                         bEnableMergeCollisionComponents;                   // 0x4b0(0x1)
	bool                                                         bVisibleWhenAboveWaterAndPlayerUnderwater;         // 0x4b0(0x1)
	bool                                                         bVisibleWhenAboveWaterAndPlayerAbove;              // 0x4b0(0x1)
	bool                                                         bVisibleWhenUnderwaterAndPlayerAbove;              // 0x4b0(0x1)
	bool                                                         bVisibleWhenUnderwaterAndPlayerUnderwater;         // 0x4b1(0x1)
	bool                                                         bCanRenderAboveAndBelowWaterAtSameTime;            // 0x4b1(0x1)
	float                                                        BoundsScale;                                       // 0x4b8(0x4)
	float                                                        OcclusionBoundsScale;                              // 0x4bc(0x4)
	float                                                        LastRenderTime;                                    // 0x4c0(0x4)
	bool                                                         bGPUVisibility;                                    // 0x4c4(0x1)
	byte                                                         bHasCustomNavigableGeometry;                       // 0x4c5(0x1)
	byte                                                         CanCharacterStepUpOn;                              // 0x4c6(0x1)
	Class PrimitiveComponent*                                    LODParentPrimitive;                                // 0x548(0x8)
	Struct PrimitiveComponentPostPhysicsTickFunction             PostPhysicsComponentTick;                          // 0x550(0x50)
	Class PrimitiveComponent*                                    MergedCollisionComponentParent;                    // 0x5a0(0x8)
};


// Size 0x58
class GameState: public Info
{
public:
	class                                                        GameModeClass;                                     // 0x3d0(0x8)
	Class GameMode*                                              AuthorityGameMode;                                 // 0x3d8(0x8)
	class                                                        SpectatorClass;                                    // 0x3e0(0x8)
	struct FName                                                 MatchState;                                        // 0x3e8(0x8)
	struct FName                                                 PreviousMatchState;                                // 0x3f0(0x8)
	int                                                          ElapsedTime;                                       // 0x3f8(0x4)
	TArray<class PlayerArray*>                                   PlayerArray;                                       // 0x400(0x10)
	float                                                        ReplicatedWorldTimeSeconds;                        // 0x410(0x4)
	float                                                        ServerWorldTimeSecondsDelta;                       // 0x414(0x4)
	float                                                        ServerWorldTimeSecondsUpdateFrequency;             // 0x418(0x4)
};


// Size 0x50
class GameUserSettings: public Object
{
public:
	bool                                                         bUseVSync;                                         // 0x28(0x1)
	int                                                          WindowPosX;                                        // 0x58(0x4)
	int                                                          WindowPosY;                                        // 0x5c(0x4)
	bool                                                         bUseDesktopResolutionForFullscreen;                // 0x60(0x1)
	int                                                          FullscreenMode;                                    // 0x64(0x4)
	int                                                          LastConfirmedFullscreenMode;                       // 0x68(0x4)
	int                                                          AudioQualityLevel;                                 // 0x70(0x4)
};


// Size 0x8
class ScriptViewportClient: public Object
{
public:
};


// Size 0x220
class GameViewportClient: public ScriptViewportClient
{
public:
	Class Console*                                               ViewportConsole;                                   // 0x38(0x8)
	TArray<Struct DebugDisplayProperty>                          DebugProperties;                                   // 0x40(0x10)
	Class World*                                                 World;                                             // 0x80(0x8)
	Class GameInstance*                                          GameInstance;                                      // 0x88(0x8)
};


// Size 0x88
class PlayerState: public Info
{
public:
	float                                                        Score;                                             // 0x3d0(0x4)
	byte                                                         Ping;                                              // 0x3d4(0x1)
	Struct FString                                               PlayerName;                                        // 0x3d8(0x10)
	int                                                          PlayerId;                                          // 0x3f8(0x4)
	bool                                                         bIsSpectator;                                      // 0x3fc(0x1)
	bool                                                         bOnlySpectator;                                    // 0x3fc(0x1)
	bool                                                         bIsABot;                                           // 0x3fc(0x1)
	bool                                                         bIsInactive;                                       // 0x3fc(0x1)
	bool                                                         bFromPreviousLevel;                                // 0x3fc(0x1)
	int                                                          StartTime;                                         // 0x400(0x4)
	class                                                        EngineMessageClass;                                // 0x408(0x8)
	Struct UniqueNetIdRepl                                       UniqueId;                                          // 0x428(0x18)
};


// Size 0x60
class Controller: public Actor
{
public:
	Class Pawn*                                                  Pawn;                                              // 0x3d8(0x8)
	Class Character*                                             Character;                                         // 0x3e8(0x8)
	Class PlayerState*                                           PlayerState;                                       // 0x3f0(0x8)
	Class SceneComponent*                                        TransformComponent;                                // 0x3f8(0x8)
	Struct Rotator                                               ControlRotation;                                   // 0x400(0xc)
	bool                                                         bAttachToPawn;                                     // 0x40c(0x1)
	struct FName                                                 StateName;                                         // 0x418(0x8)
};


// Size 0x2f8
class PlayerController: public Controller
{
public:
	Class Player*                                                Player;                                            // 0x430(0x8)
	Class Pawn*                                                  AcknowledgedPawn;                                  // 0x440(0x8)
	Class InterpTrackInstDirector*                               ControllingDirTrackInst;                           // 0x448(0x8)
	Class HUD*                                                   MyHUD;                                             // 0x458(0x8)
	Class PlayerCameraManager*                                   PlayerCameraManager;                               // 0x460(0x8)
	class                                                        PlayerCameraManagerClass;                          // 0x468(0x8)
	bool                                                         bAutoManageActiveCameraTarget;                     // 0x470(0x1)
	Struct Rotator                                               TargetViewRotation;                                // 0x474(0xc)
	TArray<class HiddenActors*>                                  HiddenActors;                                      // 0x490(0x10)
	float                                                        LastSpectatorStateSynchTime;                       // 0x4a0(0x4)
	Struct Vector                                                LastSpectatorSyncLocation;                         // 0x4a4(0xc)
	Struct Rotator                                               LastSpectatorSyncRotation;                         // 0x4b0(0xc)
	int                                                          ClientCap;                                         // 0x4bc(0x4)
	Class CheatManager*                                          CheatManager;                                      // 0x4c0(0x8)
	class                                                        CheatClass;                                        // 0x4c8(0x8)
	Class PlayerInput*                                           PlayerInput;                                       // 0x4d0(0x8)
	TArray<Struct ActiveForceFeedbackEffect>                     ActiveForceFeedbackEffects;                        // 0x4d8(0x10)
	bool                                                         bPlayerIsWaiting;                                  // 0x578(0x1)
	byte                                                         NetPlayerIndex;                                    // 0x57c(0x1)
	bool                                                         bHasVoiceHandshakeCompleted;                       // 0x57d(0x1)
	Class NetConnection*                                         PendingSwapConnection;                             // 0x580(0x8)
	Class NetConnection*                                         NetConnection;                                     // 0x588(0x8)
	float                                                        InputYawScale;                                     // 0x59c(0x4)
	float                                                        InputPitchScale;                                   // 0x5a0(0x4)
	float                                                        InputRollScale;                                    // 0x5a4(0x4)
	bool                                                         bShowMouseCursor;                                  // 0x5a8(0x1)
	bool                                                         bEnableClickEvents;                                // 0x5a8(0x1)
	bool                                                         bEnableTouchEvents;                                // 0x5a8(0x1)
	bool                                                         bEnableMouseOverEvents;                            // 0x5a8(0x1)
	bool                                                         bEnableTouchOverEvents;                            // 0x5a8(0x1)
	bool                                                         bForceFeedbackEnabled;                             // 0x5a8(0x1)
	byte                                                         DefaultMouseCursor;                                // 0x5ac(0x1)
	byte                                                         CurrentMouseCursor;                                // 0x5ad(0x1)
	byte                                                         DefaultClickTraceChannel;                          // 0x5ae(0x1)
	byte                                                         CurrentClickTraceChannel;                          // 0x5af(0x1)
	float                                                        HitResultTraceDistance;                            // 0x5b0(0x4)
	float                                                        ForceFeedbackIntensity;                            // 0x5b4(0x4)
	Class InputComponent*                                        InactiveStateInputComponent;                       // 0x640(0x8)
	Class TouchInterface*                                        CurrentTouchInterface;                             // 0x668(0x8)
	Class SpectatorPawn*                                         SpectatorPawn;                                     // 0x6a0(0x8)
	Struct Vector                                                SpawnLocation;                                     // 0x6a8(0xc)
	bool                                                         bIsLocalPlayerController;                          // 0x71c(0x1)
	bool                                                         bInCinematicMode;                                  // 0x722(0x1)
};


// Size 0x10
class StaticMeshActor: public Actor
{
public:
	Class StaticMeshComponent*                                   StaticMeshComponent;                               // 0x3d0(0x8)
	bool                                                         bStaticMeshReplicateMovement;                      // 0x3d8(0x1)
	byte                                                         NavigationGeometryGatheringMode;                   // 0x3d9(0x1)
};


// Size 0x38
class Brush: public Actor
{
public:
	byte                                                         BrushType;                                         // 0x3d0(0x1)
	Struct Color                                                 BrushColor;                                        // 0x3d4(0x4)
	int                                                          PolyFlags;                                         // 0x3d8(0x4)
	bool                                                         bColored;                                          // 0x3dc(0x1)
	bool                                                         bSolidWhenSelected;                                // 0x3dc(0x1)
	bool                                                         bPlaceableFromClassBrowser;                        // 0x3dc(0x1)
	bool                                                         bNotForClientOrServer;                             // 0x3dc(0x1)
	Class Model*                                                 Brush;                                             // 0x3e0(0x8)
	Class BrushComponent*                                        BrushComponent;                                    // 0x3e8(0x8)
	bool                                                         bInManipulation;                                   // 0x3f0(0x1)
	TArray<Struct GeomSelection>                                 SavedSelections;                                   // 0x3f8(0x10)
};


// Size 0x0
class Volume: public Brush
{
public:
};


// Size 0x0
class BlockingVolume: public Volume
{
public:
};


// Size 0x1b8
class WorldSettings: public Info
{
public:
	bool                                                         bEnableWorldBoundsChecks;                          // 0x3d8(0x1)
	bool                                                         bEnableNavigationSystem;                           // 0x3d8(0x1)
	byte                                                         WorldCompositionSetting;                           // 0x3dc(0x1)
	Struct StringAssetReference                                  InstancedNavMeshesDataAssetOveride;                // 0x3e0(0x10)
	bool                                                         bEnableWorldOriginRebasing;                        // 0x3f0(0x1)
	bool                                                         bWorldGravitySet;                                  // 0x3f0(0x1)
	bool                                                         bGlobalGravitySet;                                 // 0x3f0(0x1)
	float                                                        KillZ;                                             // 0x3f4(0x4)
	class                                                        KillZDamageType;                                   // 0x3f8(0x8)
	float                                                        GlobalGravityZ;                                    // 0x400(0x4)
	class                                                        DefaultPhysicsVolumeClass;                         // 0x408(0x8)
	class                                                        PhysicsCollisionHandlerClass;                      // 0x410(0x8)
	class                                                        DefaultGameMode;                                   // 0x418(0x8)
	TArray<Struct GameModePrefix>                                DefaultMapPrefixes;                                // 0x420(0x10)
	class                                                        GameNetworkManagerClass;                           // 0x430(0x8)
	int                                                          PackedLightAndShadowMapTextureSize;                // 0x438(0x4)
	bool                                                         bMinimizeBSPSections;                              // 0x43c(0x1)
	Struct Vector                                                DefaultColorScale;                                 // 0x440(0xc)
	bool                                                         bPrecomputeVisibility;                             // 0x44c(0x1)
	bool                                                         bPlaceCellsOnlyAlongCameraTracks;                  // 0x44c(0x1)
	int                                                          VisibilityCellSize;                                // 0x450(0x4)
	byte                                                         VisibilityAggressiveness;                          // 0x454(0x1)
	bool                                                         bForceNoPrecomputedLighting;                       // 0x458(0x1)
	Struct LightmassWorldInfoSettings                            LightmassSettings;                                 // 0x45c(0x44)
	byte                                                         LevelLightingQuality;                              // 0x4a0(0x1)
	Struct ReverbSettings                                        DefaultReverbSettings;                             // 0x4a8(0x18)
	Struct InteriorSettings                                      DefaultAmbientZoneSettings;                        // 0x4c0(0x24)
	Class SoundMix*                                              DefaultBaseSoundMix;                               // 0x4e8(0x8)
	float                                                        WorldToMeters;                                     // 0x4f0(0x4)
	Class BookMark*                                              BookMarks;                                         // 0x4f8(0x8)
	float                                                        TimeDilation;                                      // 0x548(0x4)
	float                                                        MatineeTimeDilation;                               // 0x54c(0x4)
	float                                                        DemoPlayTimeDilation;                              // 0x550(0x4)
	bool                                                         bHighPriorityLoading;                              // 0x554(0x1)
	bool                                                         bHighPriorityLoadingLocal;                         // 0x554(0x1)
	TArray<Struct NetViewer>                                     ReplicationViewers;                                // 0x558(0x10)
	TArray<class AssetUserData*>                                 AssetUserData;                                     // 0x568(0x10)
	float                                                        WorldGravityZ;                                     // 0x578(0x4)
	Class PlayerState*                                           Pauser;                                            // 0x580(0x8)
};


// Size 0x560
class PostProcessComponent: public SceneComponent
{
public:
	Struct PostProcessSettings                                   Settings;                                          // 0x2e0(0x540)
	float                                                        Priority;                                          // 0x820(0x4)
	float                                                        BlendRadius;                                       // 0x824(0x4)
	float                                                        BlendWeight;                                       // 0x828(0x4)
	bool                                                         bEnabled;                                          // 0x82c(0x1)
	bool                                                         bUnbound;                                          // 0x82c(0x1)
};


// Size 0x110
class Texture: public Object
{
public:
	int                                                          LODBias;                                           // 0x28(0x4)
	int                                                          NumCinematicMipLevels;                             // 0x2c(0x4)
	bool                                                         SRGB;                                              // 0x30(0x1)
	bool                                                         NeverStream;                                       // 0x30(0x1)
	bool                                                         bNoTiling;                                         // 0x30(0x1)
	bool                                                         bUseCinematicMipLevels;                            // 0x30(0x1)
	bool                                                         CompressionNone;                                   // 0x30(0x1)
	bool                                                         bUAV;                                              // 0x30(0x1)
	int                                                          CachedCombinedLODBias;                             // 0x38(0x4)
	bool                                                         bAsyncResourceReleaseHasBeenStarted;               // 0x3c(0x1)
	byte                                                         CompressionSettings;                               // 0x40(0x1)
	byte                                                         Filter;                                            // 0x41(0x1)
	byte                                                         LODGroup;                                          // 0x42(0x1)
	float                                                        StreamingPriorityBoost;                            // 0x44(0x4)
	TArray<Struct ExternalMip>                                   ExternalMips;                                      // 0xa0(0x10)
};


// Size 0x8
class TextureRenderTarget: public Texture
{
public:
	float                                                        TargetGamma;                                       // 0x138(0x4)
};


// Size 0x28
class TextureRenderTarget2D: public TextureRenderTarget
{
public:
	int                                                          SizeX;                                             // 0x140(0x4)
	int                                                          SizeY;                                             // 0x144(0x4)
	Struct LinearColor                                           ClearColor;                                        // 0x148(0x10)
	byte                                                         AddressX;                                          // 0x158(0x1)
	byte                                                         AddressY;                                          // 0x159(0x1)
	bool                                                         bForceLinearGamma;                                 // 0x15c(0x1)
	bool                                                         bHDR;                                              // 0x15c(0x1)
	bool                                                         bAutoGenerateMips;                                 // 0x15c(0x1)
	byte                                                         OverrideFormat;                                    // 0x160(0x1)
	bool                                                         bDontClearOnCreation;                              // 0x161(0x1)
};


// Size 0x50
class DebugCameraController: public PlayerController
{
public:
	bool                                                         bUseOriginalPlayerHUD;                             // 0x728(0x1)
	bool                                                         bShowSelectedInfo;                                 // 0x728(0x1)
	bool                                                         bIsFrozenRendering;                                // 0x728(0x1)
	Class DrawFrustumComponent*                                  DrawFrustum;                                       // 0x730(0x8)
	Class PlayerController*                                      OriginalControllerRef;                             // 0x748(0x8)
	Class Player*                                                OriginalPlayer;                                    // 0x750(0x8)
	float                                                        SpeedScale;                                        // 0x758(0x4)
	float                                                        InitialMaxSpeed;                                   // 0x75c(0x4)
	float                                                        InitialAccel;                                      // 0x760(0x4)
	float                                                        InitialDecel;                                      // 0x764(0x4)
	float                                                        SpeedScaleAdjustment;                              // 0x768(0x4)
	float                                                        FovScaleAdjustment;                                // 0x76c(0x4)
};


// Size 0xf8
class HUD: public Actor
{
public:
	Struct Color                                                 WhiteColor;                                        // 0x3d0(0x4)
	Struct Color                                                 GreenColor;                                        // 0x3d4(0x4)
	Struct Color                                                 RedColor;                                          // 0x3d8(0x4)
	Class PlayerController*                                      PlayerOwner;                                       // 0x3e0(0x8)
	bool                                                         bLostFocusPaused;                                  // 0x3e8(0x1)
	bool                                                         bShowHUD;                                          // 0x3e8(0x1)
	bool                                                         bShowDebugInfo;                                    // 0x3e8(0x1)
	bool                                                         bShowHitBoxDebugInfo;                              // 0x3e8(0x1)
	bool                                                         bShowOverlays;                                     // 0x3e8(0x1)
	bool                                                         bEnableDebugTextShadow;                            // 0x3e8(0x1)
	TArray<class PostRenderedActors*>                            PostRenderedActors;                                // 0x3f0(0x10)
	float                                                        LastHUDRenderTime;                                 // 0x400(0x4)
	float                                                        RenderDelta;                                       // 0x404(0x4)
	TArray<Struct FName>                                         DebugDisplay;                                      // 0x408(0x10)
	TArray<Struct FName>                                         ToggledDebugCategories;                            // 0x418(0x10)
	Class Canvas*                                                Canvas;                                            // 0x428(0x8)
	Class Canvas*                                                DebugCanvas;                                       // 0x430(0x8)
	TArray<Struct DebugTextInfo>                                 DebugTextList;                                     // 0x438(0x10)
	class                                                        ShowDebugTargetDesiredClass;                       // 0x448(0x8)
	Class Actor*                                                 ShowDebugTargetActor;                              // 0x450(0x8)
};


// Size 0x18
class FeatureToggledStringAssetReference: public DataAsset
{
public:
	TArray<Struct FeatureToggledStringAssetReferenceEntry>       Entries;                                           // 0x28(0x10)
	class                                                        ClassType;                                         // 0x38(0x8)
};


// Size 0x8
class LevelScriptActor: public Actor
{
public:
	bool                                                         bInputEnabled;                                     // 0x3d0(0x1)
};


// Size 0x10
class ArrowComponent: public PrimitiveComponent
{
public:
	Struct Color                                                 ArrowColor;                                        // 0x5a8(0x4)
	float                                                        ArrowSize;                                         // 0x5ac(0x4)
	bool                                                         bIsScreenSizeScaled;                               // 0x5b0(0x1)
	float                                                        ScreenSize;                                        // 0x5b4(0x4)
	bool                                                         bTreatAsASprite;                                   // 0x5b8(0x1)
};


// Size 0x10
class MeshComponent: public PrimitiveComponent
{
public:
	TArray<class OverrideMaterials*>                             OverrideMaterials;                                 // 0x5a8(0x10)
};


// Size 0x50
class StaticMeshComponent: public MeshComponent
{
public:
	int                                                          ForcedLodModel;                                    // 0x5b8(0x4)
	bool                                                         bOverrideMinLOD;                                   // 0x5bc(0x1)
	bool                                                         bOverrideNavigationToDefaultObstacle;              // 0x5bd(0x1)
	int                                                          MinLOD;                                            // 0x5c0(0x4)
	Class StaticMesh*                                            StaticMesh;                                        // 0x5c8(0x8)
	bool                                                         bOverrideWireframeColor;                           // 0x5d0(0x1)
	Struct Color                                                 WireframeColorOverride;                            // 0x5d4(0x4)
	bool                                                         bIgnoreInstanceForTextureStreaming;                // 0x5d8(0x1)
	bool                                                         bOverrideLightMapRes;                              // 0x5d8(0x1)
	int                                                          OverriddenLightMapRes;                             // 0x5dc(0x4)
	float                                                        StreamingDistanceMultiplier;                       // 0x5e0(0x4)
	TArray<Struct Guid>                                          IrrelevantLights;                                  // 0x5e8(0x10)
	TArray<Struct StaticMeshComponentLODInfo>                    LODData;                                           // 0x5f8(0x10)
	Class MaterialInterface*                                     CustomDepthMaterial;                               // 0x608(0x8)
};


// Size 0x10
class FogVolume: public Actor
{
public:
	Class SphereComponent*                                       SphereComponent;                                   // 0x3d0(0x8)
	Class FogVolumeComponent*                                    FogVolumeComponent;                                // 0x3d8(0x8)
};


// Size 0x0
class ThreadedActor: public Actor
{
public:
};


// Size 0x30
class MaterialInterface: public Object
{
public:
	Class SubsurfaceProfile*                                     SubsurfaceProfile;                                 // 0x30(0x8)
	Struct LightmassMaterialInterfaceSettings                    LightmassSettings;                                 // 0x3c(0x14)
};


// Size 0x9c0
class Material: public MaterialInterface
{
public:
	Class PhysicalMaterial*                                      PhysMaterial;                                      // 0x58(0x8)
	Struct ColorMaterialInput                                    DiffuseColor;                                      // 0x60(0x40)
	Struct ColorMaterialInput                                    SpecularColor;                                     // 0xa0(0x40)
	Struct ColorMaterialInput                                    BaseColor;                                         // 0xe0(0x40)
	Struct ScalarMaterialInput                                   Metallic;                                          // 0x120(0x40)
	Struct ScalarMaterialInput                                   Specular;                                          // 0x160(0x40)
	Struct ScalarMaterialInput                                   Roughness;                                         // 0x1a0(0x40)
	Struct VectorMaterialInput                                   Normal;                                            // 0x1e0(0x48)
	Struct ColorMaterialInput                                    EmissiveColor;                                     // 0x228(0x40)
	Struct ScalarMaterialInput                                   Opacity;                                           // 0x268(0x40)
	Struct ScalarMaterialInput                                   OpacityMask;                                       // 0x2a8(0x40)
	byte                                                         MaterialDomain;                                    // 0x2e8(0x1)
	byte                                                         BlendMode;                                         // 0x2e9(0x1)
	byte                                                         DecalBlendMode;                                    // 0x2ea(0x1)
	bool                                                         bDecalNoEmissiveOrRoughness;                       // 0x2eb(0x1)
	bool                                                         bDecalEnableStencil;                               // 0x2ec(0x1)
	byte                                                         MaterialDecalResponse;                             // 0x2ed(0x1)
	byte                                                         ShadingModel;                                      // 0x2ee(0x1)
	float                                                        OpacityMaskClipValue;                              // 0x2f0(0x4)
	float                                                        DepthWeightScale;                                  // 0x2f4(0x4)
	float                                                        DepthWeightExponent;                               // 0x2f8(0x4)
	float                                                        DepthWeightBase;                                   // 0x2fc(0x4)
	bool                                                         bBlendedOITAfterTranslucency;                      // 0x300(0x1)
	bool                                                         bForceResolution;                                  // 0x300(0x1)
	byte                                                         ForcedResolution;                                  // 0x304(0x1)
	float                                                        FirstSplitDistance;                                // 0x308(0x4)
	float                                                        SecondSplitDistance;                               // 0x30c(0x4)
	float                                                        FullResInFrontMaxDistance;                         // 0x310(0x4)
	bool                                                         FullResInFront;                                    // 0x314(0x1)
	bool                                                         PopPerParticle;                                    // 0x314(0x1)
	Struct VectorMaterialInput                                   WorldPositionOffset;                               // 0x318(0x48)
	Struct VectorMaterialInput                                   WorldDisplacement;                                 // 0x360(0x48)
	Struct ScalarMaterialInput                                   TessellationMultiplier;                            // 0x3a8(0x40)
	Struct ColorMaterialInput                                    SubsurfaceColor;                                   // 0x3e8(0x40)
	Struct ScalarMaterialInput                                   ClearCoat;                                         // 0x428(0x40)
	Struct ScalarMaterialInput                                   ClearCoatRoughness;                                // 0x468(0x40)
	Struct ScalarMaterialInput                                   AmbientOcclusion;                                  // 0x4a8(0x40)
	Struct ScalarMaterialInput                                   Refraction;                                        // 0x4e8(0x40)
	Struct ColorMaterialInput                                    BillboardColor;                                    // 0x528(0x40)
	Struct VectorMaterialInput                                   BillboardParams;                                   // 0x568(0x48)
	Struct Vector2MaterialInput                                  CustomizedUVs;                                     // 0x5b0(0x48)
	Struct MaterialAttributesInput                               MaterialAttributes;                                // 0x7f0(0x38)
	Struct ScalarMaterialInput                                   PixelDepthOffset;                                  // 0x838(0x40)
	bool                                                         bTranslucentBeforeTranslucency;                    // 0x878(0x1)
	bool                                                         bTranslucentBeforeVolumeFog;                       // 0x878(0x1)
	bool                                                         bTranslucentWithDepthWrite;                        // 0x878(0x1)
	bool                                                         bEnableSeparateTranslucency;                       // 0x878(0x1)
	bool                                                         bEnableResponsiveAA;                               // 0x878(0x1)
	bool                                                         bScreenSpaceReflections;                           // 0x878(0x1)
	bool                                                         TwoSided;                                          // 0x878(0x1)
	bool                                                         DitheredLODTransition;                             // 0x878(0x1)
	byte                                                         ConstantMaterial;                                  // 0x87c(0x1)
	float                                                        SkyLightWhenOccluded;                              // 0x880(0x4)
	float                                                        CloudShadowsInfluence;                             // 0x884(0x4)
	int                                                          NumCustomizedUVs;                                  // 0x888(0x4)
	byte                                                         TranslucencyLightingMode;                          // 0x88c(0x1)
	float                                                        TranslucencyDirectionalLightingIntensity;          // 0x890(0x4)
	float                                                        LightColorInfluence;                               // 0x894(0x4)
	float                                                        AmbientLightColorInfluence;                        // 0x898(0x4)
	float                                                        LightIntensityInfluence;                           // 0x89c(0x4)
	float                                                        AmbientLightIntensityInfluence;                    // 0x8a0(0x4)
	float                                                        AlternativeAmbientLightColorInfluence;             // 0x8a4(0x4)
	float                                                        AlternativeAmbientLightIntensityInfluence;         // 0x8a8(0x4)
	bool                                                         bEvaluateLightningAtParticleCenter;                // 0x8ac(0x1)
	float                                                        TranslucencyScaleForReflection;                    // 0x8b0(0x4)
	bool                                                         bObjectFadeEnabled;                                // 0x8b4(0x1)
	float                                                        ObjectFadeRate;                                    // 0x8b8(0x4)
	float                                                        ObjectFadeDistanceThreshold;                       // 0x8bc(0x4)
	float                                                        TranslucentShadowDensityScale;                     // 0x8c0(0x4)
	float                                                        TranslucentSelfShadowDensityScale;                 // 0x8c4(0x4)
	float                                                        TranslucentSelfShadowSecondDensityScale;           // 0x8c8(0x4)
	float                                                        TranslucentSelfShadowSecondOpacity;                // 0x8cc(0x4)
	float                                                        TranslucentBackscatteringExponent;                 // 0x8d0(0x4)
	Struct LinearColor                                           TranslucentMultipleScatteringExtinction;           // 0x8d4(0x10)
	float                                                        TranslucentShadowStartOffset;                      // 0x8e4(0x4)
	float                                                        VolumeFogScale;                                    // 0x8e8(0x4)
	bool                                                         DistanceFog;                                       // 0x8ec(0x1)
	bool                                                         bDisableDepthTest;                                 // 0x8ec(0x1)
	bool                                                         bGenerateSphericalParticleNormals;                 // 0x8ec(0x1)
	bool                                                         bDontRenderWhenPlayerInsideShip;                   // 0x8ec(0x1)
	bool                                                         bTangentSpaceNormal;                               // 0x8ec(0x1)
	bool                                                         bUseEmissiveForDynamicAreaLighting;                // 0x8ec(0x1)
	bool                                                         bBlockGI;                                          // 0x8ec(0x1)
	bool                                                         bUsedAsSpecialEngineMaterial;                      // 0x8ec(0x1)
	bool                                                         bUsedWithSkeletalMesh;                             // 0x8ed(0x1)
	bool                                                         bUsedWithEditorCompositing;                        // 0x8ed(0x1)
	bool                                                         bUsedWithLandscape;                                // 0x8ed(0x1)
	bool                                                         bUsedWithParticleSprites;                          // 0x8ed(0x1)
	bool                                                         bUsedWithCPUParticleSprites;                       // 0x8ed(0x1)
	bool                                                         bUsedWithStaticMesh;                               // 0x8ed(0x1)
	bool                                                         bUsedWithCoverage;                                 // 0x8ed(0x1)
	bool                                                         bUsedWithGPUInstanceCulling;                       // 0x8ed(0x1)
	bool                                                         bUsedWithBeamTrails;                               // 0x8ee(0x1)
	bool                                                         bUsedWithMeshParticles;                            // 0x8ee(0x1)
	bool                                                         bUsedWithStaticLighting;                           // 0x8ee(0x1)
	bool                                                         bUsedWithFluidSurfaces;                            // 0x8ee(0x1)
	bool                                                         bUsedWithMorphTargets;                             // 0x8ee(0x1)
	bool                                                         bUsedWithSplineMeshes;                             // 0x8ee(0x1)
	bool                                                         bUsedWithInstancedStaticMeshes;                    // 0x8ee(0x1)
	bool                                                         bUsesDistortion;                                   // 0x8ee(0x1)
	bool                                                         bUsedWithClothing;                                 // 0x8ef(0x1)
	bool                                                         bUsedWithDeformables;                              // 0x8ef(0x1)
	bool                                                         bUsedWithFFTWaterMask;                             // 0x8ef(0x1)
	bool                                                         bUsedWithVolumeFogMask;                            // 0x8ef(0x1)
	bool                                                         bUsedWithDynamicObjectFading;                      // 0x8ef(0x1)
	bool                                                         bUsedWithWaterBoundary;                            // 0x8ef(0x1)
	bool                                                         bUsedWithClouds;                                   // 0x8ef(0x1)
	bool                                                         bUsedWithInstancedRopes;                           // 0x8ef(0x1)
	bool                                                         bUsedWithPlanarReflection;                         // 0x8f0(0x1)
	bool                                                         bUsedWithPointLightShadows;                        // 0x8f0(0x1)
	bool                                                         bUsedWithMaskPass;                                 // 0x8f0(0x1)
	bool                                                         bUsedWithUI;                                       // 0x8f0(0x1)
	bool                                                         bAutomaticallySetUsageInEditor;                    // 0x8f0(0x1)
	bool                                                         bAllowEmissiveOnLandscape;                         // 0x8f0(0x1)
	bool                                                         bApplyWaterMask;                                   // 0x8f0(0x1)
	bool                                                         bUseReZ;                                           // 0x8f0(0x1)
	bool                                                         bFullyRough;                                       // 0x8f1(0x1)
	bool                                                         bUseLightmapDirectionality;                        // 0x8f1(0x1)
	byte                                                         GeometryMode;                                      // 0x8f4(0x1)
	byte                                                         D3D11TessellationMode;                             // 0x8f5(0x1)
	bool                                                         bEnableCrackFreeDisplacement;                      // 0x8f8(0x1)
	bool                                                         bEnableAdaptiveTessellation;                       // 0x8f8(0x1)
	float                                                        MaxDisplacement;                                   // 0x8fc(0x4)
	bool                                                         Wireframe;                                         // 0x900(0x1)
	bool                                                         bOutputVelocityOnBasePass;                         // 0x900(0x1)
	float                                                        NormalOffsetShadowBiasScale;                       // 0x904(0x4)
	int                                                          EditorX;                                           // 0x908(0x4)
	int                                                          EditorY;                                           // 0x90c(0x4)
	int                                                          EditorPitch;                                       // 0x910(0x4)
	int                                                          EditorYaw;                                         // 0x914(0x4)
	TArray<class Expressions*>                                   Expressions;                                       // 0x918(0x10)
	TArray<Struct MaterialFunctionInfo>                          MaterialFunctionInfos;                             // 0x928(0x10)
	TArray<Struct MaterialParameterCollectionInfo>               MaterialParameterCollectionInfos;                  // 0x938(0x10)
	bool                                                         bCanMaskedBeAssumedOpaque;                         // 0x948(0x1)
	bool                                                         bIsMasked;                                         // 0x948(0x1)
	bool                                                         bIsPreviewMaterial;                                // 0x948(0x1)
	bool                                                         bUseMaterialAttributes;                            // 0x948(0x1)
	bool                                                         bUseTranslucencyVertexFog;                         // 0x948(0x1)
	bool                                                         bUseDensityMapOnTranslucencyVertexFog;             // 0x948(0x1)
	bool                                                         bAllowDevelopmentShaderCompile;                    // 0x948(0x1)
	bool                                                         bIsMaterialEditorStatsMaterial;                    // 0x948(0x1)
	byte                                                         BlendableLocation;                                 // 0x950(0x1)
	int                                                          BlendablePriority;                                 // 0x954(0x4)
	bool                                                         bIsAlphaBlended;                                   // 0x958(0x1)
	float                                                        RefractionDepthBias;                               // 0x95c(0x4)
	Struct Guid                                                  StateId;                                           // 0x960(0x10)
	int                                                          UnwrappedUVSet;                                    // 0x970(0x4)
	TArray<class ExpressionTextureReferences*>                   ExpressionTextureReferences;                       // 0xa00(0x10)
};


// Size 0x20
class CameraModifier: public Object
{
public:
	bool                                                         bDebug;                                            // 0x28(0x1)
	bool                                                         bExclusive;                                        // 0x28(0x1)
	byte                                                         Priority;                                          // 0x2c(0x1)
	Class PlayerCameraManager*                                   CameraOwner;                                       // 0x30(0x8)
	float                                                        AlphaInTime;                                       // 0x38(0x4)
	float                                                        AlphaOutTime;                                      // 0x3c(0x4)
	float                                                        Alpha;                                             // 0x40(0x4)
	bool                                                         bAutoDestroyOnCompletion;                          // 0x44(0x1)
};


// Size 0x10
class PhysicsVolume: public Volume
{
public:
	float                                                        TerminalVelocity;                                  // 0x408(0x4)
	int                                                          Priority;                                          // 0x40c(0x4)
	float                                                        FluidFriction;                                     // 0x410(0x4)
	bool                                                         bWaterVolume;                                      // 0x414(0x1)
	bool                                                         bPhysicsOnContact;                                 // 0x414(0x1)
};


// Size 0x2e0
class ParticleSystemComponent: public PrimitiveComponent
{
public:
	Class ParticleSystem*                                        Template;                                          // 0x5a8(0x8)
	TArray<class EmitterMaterials*>                              EmitterMaterials;                                  // 0x5b0(0x10)
	TArray<class SkelMeshComponents*>                            SkelMeshComponents;                                // 0x5c0(0x10)
	bool                                                         bResetOnDetach;                                    // 0x5d0(0x1)
	bool                                                         bUpdateOnDedicatedServer;                          // 0x5d0(0x1)
	TArray<Struct ParticleSysParam>                              InstanceParameters;                                // 0x5d8(0x10)
	Struct ParticleSysParam                                      EmitterPointParameter;                             // 0x5e8(0x50)
	Struct Vector                                                OldPosition;                                       // 0x678(0xc)
	Struct Vector                                                PartSysVelocity;                                   // 0x684(0xc)
	Struct Vector                                                CustomInheritedVelocity;                           // 0x6a8(0xc)
	float                                                        CustomParameterDrivingCurves;                      // 0x6c0(0x4)
	Struct LinearColor                                           ColourTint;                                        // 0x6c4(0x10)
	float                                                        WarmUpTime;                                        // 0x6d4(0x4)
	float                                                        WarmupTickRate;                                    // 0x6d8(0x4)
	bool                                                         bWarmingUp;                                        // 0x6dc(0x1)
	float                                                        SecondsBeforeInactive;                             // 0x6f8(0x4)
	float                                                        MaxTimeBeforeForceUpdateTransform;                 // 0x704(0x4)
	bool                                                         bOverrideLODMethod;                                // 0x70c(0x1)
	byte                                                         LODMethod;                                         // 0x710(0x1)
	bool                                                         bSkipUpdateDynamicDataDuringTick;                  // 0x714(0x1)
	TArray<Struct MaterialRelevance>                             CachedViewRelevanceFlags;                          // 0x718(0x10)
	TArray<class ReplayClips*>                                   ReplayClips;                                       // 0x730(0x10)
	float                                                        CustomTimeDilation;                                // 0x7a0(0x4)
	bool                                                         bUnbound;                                          // 0x7b8(0x1)
};


// Size 0x80
class SplineComponent: public PrimitiveComponent
{
public:
	Struct InterpCurveVector                                     SplineInfo;                                        // 0x5a8(0x18)
	Struct InterpCurveQuat                                       SplineRotInfo;                                     // 0x5c0(0x18)
	Struct InterpCurveVector                                     SplineScaleInfo;                                   // 0x5d8(0x18)
	Struct InterpCurveFloat                                      SplineReparamTable;                                // 0x5f0(0x18)
	bool                                                         bAllowSplineEditingPerInstance;                    // 0x608(0x1)
	int                                                          ReparamStepsPerSegment;                            // 0x60c(0x4)
	float                                                        Duration;                                          // 0x610(0x4)
	bool                                                         bStationaryEndpoints;                              // 0x614(0x1)
	bool                                                         bSplineHasBeenEdited;                              // 0x615(0x1)
	bool                                                         bClosedLoop;                                       // 0x616(0x1)
	Struct Vector                                                DefaultUpVector;                                   // 0x618(0xc)
};


// Size 0x20
class ShapeComponent: public PrimitiveComponent
{
public:
	Struct Color                                                 ShapeColor;                                        // 0x5a8(0x4)
	Class BodySetup*                                             ShapeBodySetup;                                    // 0x5b0(0x8)
	bool                                                         bDrawOnlyIfSelected;                               // 0x5b8(0x1)
	bool                                                         bShouldCollideWhenPlacing;                         // 0x5b8(0x1)
	bool                                                         bDynamicObstacle;                                  // 0x5b8(0x1)
	class                                                        AreaClass;                                         // 0x5c0(0x8)
};


// Size 0x0
class CapsuleComponent: public ShapeComponent
{
public:
	float                                                        CapsuleHalfHeight;                                 // 0x5c8(0x4)
	float                                                        CapsuleRadius;                                     // 0x5cc(0x4)
};


// Size 0x8
class TextureProxy: public Texture
{
public:
	Class Texture*                                               Texture;                                           // 0x138(0x8)
};


// Size 0x58
class Commandlet: public Object
{
public:
	Struct FString                                               HelpDescription;                                   // 0x28(0x10)
	Struct FString                                               HelpUsage;                                         // 0x38(0x10)
	Struct FString                                               HelpWebLink;                                       // 0x48(0x10)
	TArray<Str HelpParamNames>                                   HelpParamNames;                                    // 0x58(0x10)
	TArray<Str HelpParamDescriptions>                            HelpParamDescriptions;                             // 0x68(0x10)
	bool                                                         IsServer;                                          // 0x78(0x1)
	bool                                                         IsClient;                                          // 0x78(0x1)
	bool                                                         IsEditor;                                          // 0x78(0x1)
	bool                                                         LogToConsole;                                      // 0x78(0x1)
	bool                                                         ShowErrorCount;                                    // 0x78(0x1)
};


// Size 0xb0
class InstancedStaticMeshComponent: public StaticMeshComponent
{
public:
	TArray<Struct InstancedStaticMeshInstanceData>               PerInstanceSMData;                                 // 0x610(0x10)
	int                                                          InstancingRandomSeed;                              // 0x620(0x4)
	int                                                          InstanceStartCullDistance;                         // 0x624(0x4)
	int                                                          InstanceEndCullDistance;                           // 0x628(0x4)
	TArray<Int InstanceReorderTable>                             InstanceReorderTable;                              // 0x630(0x10)
	TArray<Int RemovedInstances>                                 RemovedInstances;                                  // 0x640(0x10)
	Class PhysicsSerializer*                                     PhysicsSerializer;                                 // 0x698(0x8)
	int                                                          NumPendingLightmaps;                               // 0x6a0(0x4)
	TArray<Struct InstancedStaticMeshMappingInfo>                CachedMappings;                                    // 0x6a8(0x10)
};


// Size 0xd0
class HierarchicalInstancedStaticMeshComponent: public InstancedStaticMeshComponent
{
public:
	TArray<Int SortedInstances>                                  SortedInstances;                                   // 0x700(0x10)
	int                                                          NumBuiltInstances;                                 // 0x710(0x4)
	Struct Box                                                   BuiltInstanceBounds;                               // 0x714(0x1c)
	Struct Box                                                   UnbuiltInstanceBounds;                             // 0x730(0x1c)
	TArray<Struct Box>                                           UnbuiltInstanceBoundsList;                         // 0x750(0x10)
	int                                                          OcclusionLayerNumNodes;                            // 0x760(0x4)
	bool                                                         bDisableCollision;                                 // 0x766(0x1)
};


// Size 0x160
class MaterialInstance: public MaterialInterface
{
public:
	Class PhysicalMaterial*                                      PhysMaterial;                                      // 0x58(0x8)
	Class MaterialInterface*                                     Parent;                                            // 0x60(0x8)
	bool                                                         bHasStaticPermutationResource;                     // 0x68(0x1)
	bool                                                         bOverrideSubsurfaceProfile;                        // 0x68(0x1)
	Struct Guid                                                  ParentLightingGuid;                                // 0x70(0x10)
	TArray<Struct FontParameterValue>                            FontParameterValues;                               // 0x80(0x10)
	TArray<Struct ScalarParameterValue>                          ScalarParameterValues;                             // 0x90(0x10)
	TArray<Struct TextureParameterValue>                         TextureParameterValues;                            // 0xa0(0x10)
	TArray<Struct VectorParameterValue>                          VectorParameterValues;                             // 0xb0(0x10)
	Struct MaterialInstanceBasePropertyOverrides                 BasePropertyOverrides;                             // 0xc0(0x84)
};


// Size 0x0
class MaterialInstanceConstant: public MaterialInstance
{
public:
};


// Size 0x48
class MaterialExpression: public Object
{
public:
	Class Material*                                              Material;                                          // 0x28(0x8)
	Class MaterialFunction*                                      Function;                                          // 0x30(0x8)
	Struct FString                                               Desc;                                              // 0x38(0x10)
	Struct Color                                                 BorderColor;                                       // 0x48(0x4)
	bool                                                         bRealtimePreview;                                  // 0x4c(0x1)
	bool                                                         bNeedToUpdatePreview;                              // 0x4c(0x1)
	bool                                                         bIsParameterExpression;                            // 0x4c(0x1)
	bool                                                         bCommentBubbleVisible;                             // 0x4c(0x1)
	bool                                                         bShowOutputNameOnPin;                              // 0x4c(0x1)
	bool                                                         bHidePreviewWindow;                                // 0x4c(0x1)
	bool                                                         bCollapsed;                                        // 0x4c(0x1)
	bool                                                         bShaderInputData;                                  // 0x4c(0x1)
	bool                                                         bShowInputs;                                       // 0x4d(0x1)
	bool                                                         bShowOutputs;                                      // 0x4d(0x1)
	TArray<Struct FText>                                         MenuCategories;                                    // 0x50(0x10)
	TArray<Struct ExpressionOutput>                              Outputs;                                           // 0x60(0x10)
};


// Size 0x0
class MaterialExpressionCustomOutput: public MaterialExpression
{
public:
};


// Size 0x0
class BlueprintAsyncActionBase: public Object
{
public:
};


// Size 0x68
class BlueprintGeneratedClass: public Class
{
public:
	int                                                          NumReplicatedProperties;                           // 0x1c0(0x4)
	TArray<class DynamicBindingObjects*>                         DynamicBindingObjects;                             // 0x1c8(0x10)
	TArray<class ComponentTemplates*>                            ComponentTemplates;                                // 0x1d8(0x10)
	TArray<class Timelines*>                                     Timelines;                                         // 0x1e8(0x10)
	Class SimpleConstructionScript*                              SimpleConstructionScript;                          // 0x1f8(0x8)
	Class InheritableComponentHandler*                           InheritableComponentHandler;                       // 0x200(0x8)
	Class StructProperty*                                        UberGraphFramePointerProperty;                     // 0x208(0x8)
	Class Function*                                              UberGraphFunction;                                 // 0x210(0x8)
	TArray<Struct EventGraphFastCallPair>                        FastCallPairs;                                     // 0x218(0x10)
};


// Size 0x18
class AISystemBase: public Object
{
public:
	Struct StringClassReference                                  AISystemClassName;                                 // 0x28(0x10)
	struct FName                                                 AISystemModuleName;                                // 0x38(0x8)
};


// Size 0x10
class UserDefinedStruct: public ScriptStruct
{
public:
	Struct Guid                                                  Guid;                                              // 0x98(0x10)
};


// Size 0x20
class Player: public Object
{
public:
	Class PlayerController*                                      PlayerController;                                  // 0x30(0x8)
	int                                                          CurrentNetSpeed;                                   // 0x38(0x4)
	int                                                          ConfiguredInternetSpeed;                           // 0x3c(0x4)
	int                                                          ConfiguredLanSpeed;                                // 0x40(0x4)
};


// Size 0x34540
class NetConnection: public Player
{
public:
	TArray<class Actor*>                                         Children;                                          // 0x50(0x10)
	Class NetDriver*                                             Driver;                                            // 0x60(0x8)
	Class PackageMap*                                            PackageMap;                                        // 0x68(0x8)
	TArray<class OpenChannels*>                                  OpenChannels;                                      // 0x70(0x10)
	TArray<class SentTemporaries*>                               SentTemporaries;                                   // 0x80(0x10)
	Class Actor*                                                 ViewTarget;                                        // 0x90(0x8)
	Class Actor*                                                 OwningActor;                                       // 0x98(0x8)
	int                                                          MaxPacket;                                         // 0xa0(0x4)
	bool                                                         InternalAck;                                       // 0xa4(0x1)
	double                                                       LastReceiveTime;                                   // 0x3a0(0x8)
	int                                                          MaxDormantActorsCheckedFromRelevancy;              // 0x34468(0x4)
	TArray<class DeferredCloseChannels*>                         DeferredCloseChannels;                             // 0x344c0(0x10)
};


// Size 0x450
class NetDriver: public Object
{
public:
	Struct FString                                               NetConnectionClassName;                            // 0x38(0x10)
	int                                                          MaxDownloadSize;                                   // 0x48(0x4)
	bool                                                         bClampListenServerTickRate;                        // 0x4c(0x1)
	int                                                          NetServerMaxTickRate;                              // 0x50(0x4)
	int                                                          MaxInternetClientRate;                             // 0x54(0x4)
	int                                                          MaxClientRate;                                     // 0x58(0x4)
	float                                                        ServerTravelPause;                                 // 0x5c(0x4)
	float                                                        SpawnPrioritySeconds;                              // 0x60(0x4)
	float                                                        RelevantTimeout;                                   // 0x64(0x4)
	float                                                        KeepAliveTime;                                     // 0x68(0x4)
	float                                                        InitialConnectTimeout;                             // 0x6c(0x4)
	float                                                        ConnectionTimeout;                                 // 0x70(0x4)
	Class NetConnection*                                         ServerConnection;                                  // 0x78(0x8)
	TArray<class ClientConnections*>                             ClientConnections;                                 // 0x80(0x10)
	Class World*                                                 World;                                             // 0x90(0x8)
	class                                                        NetConnectionClass;                                // 0xc8(0x8)
	Class Property*                                              RoleProperty;                                      // 0xd0(0x8)
	Class Property*                                              RemoteRoleProperty;                                // 0xd8(0x8)
	struct FName                                                 NetDriverName;                                     // 0xe0(0x8)
};


// Size 0x0
class OnlineSession: public Object
{
public:
};


// Size 0x550
class Model: public Object
{
public:
};


// Size 0x68
class EdGraphNode: public Object
{
public:
	TArray<class Pins*>                                          Pins;                                              // 0x28(0x10)
	int                                                          NodePosX;                                          // 0x38(0x4)
	int                                                          NodePosY;                                          // 0x3c(0x4)
	int                                                          NodeWidth;                                         // 0x40(0x4)
	int                                                          NodeHeight;                                        // 0x44(0x4)
	bool                                                         bHasCompilerMessage;                               // 0x48(0x1)
	Struct FString                                               NodeComment;                                       // 0x50(0x10)
	bool                                                         bCommentBubblePinned;                              // 0x60(0x1)
	bool                                                         bCommentBubbleVisible;                             // 0x61(0x1)
	int                                                          ErrorType;                                         // 0x64(0x4)
	Struct FString                                               ErrorMsg;                                          // 0x68(0x10)
	Struct Guid                                                  NodeGuid;                                          // 0x78(0x10)
	byte                                                         AdvancedPinDisplay;                                // 0x88(0x1)
	bool                                                         bIsNodeEnabled;                                    // 0x89(0x1)
	bool                                                         bIsDebugFunction;                                  // 0x8a(0x1)
};


// Size 0x100
class EdGraphPin: public Object
{
public:
	Struct FString                                               PinName;                                           // 0x28(0x10)
	Struct FString                                               PinToolTip;                                        // 0x38(0x10)
	byte                                                         Direction;                                         // 0x48(0x1)
	Struct EdGraphPinType                                        PinType;                                           // 0x50(0x50)
	Struct FString                                               DefaultValue;                                      // 0xa0(0x10)
	Struct FString                                               AutogeneratedDefaultValue;                         // 0xb0(0x10)
	Class Object*                                                DefaultObject;                                     // 0xc0(0x8)
	Struct FText                                                 DefaultTextValue;                                  // 0xc8(0x38)
	TArray<class LinkedTo*>                                      LinkedTo;                                          // 0x100(0x10)
	TArray<class SubPins*>                                       SubPins;                                           // 0x110(0x10)
	Class EdGraphPin*                                            ParentPin;                                         // 0x120(0x8)
};


// Size 0x0
class EngineBaseTypes: public Object
{
public:
};


// Size 0x18
class DamageType: public Object
{
public:
	bool                                                         bCausedByWorld;                                    // 0x28(0x1)
	bool                                                         bScaleMomentumByMass;                              // 0x28(0x1)
	float                                                        DamageImpulse;                                     // 0x2c(0x4)
	bool                                                         bRadialDamageVelChange;                            // 0x30(0x1)
	float                                                        DestructibleImpulse;                               // 0x34(0x4)
	float                                                        DestructibleDamageSpreadScale;                     // 0x38(0x4)
	float                                                        DamageFalloff;                                     // 0x3c(0x4)
};


// Size 0x0
class EngineTypes: public Object
{
public:
};


// Size 0x28
class BlueprintCore: public Object
{
public:
	class                                                        SkeletonGeneratedClass;                            // 0x28(0x8)
	class                                                        GeneratedClass;                                    // 0x30(0x8)
	bool                                                         bLegacyNeedToPurgeSkelRefs;                        // 0x38(0x1)
	bool                                                         bLegacyGeneratedClassIsAuthoritative;              // 0x39(0x1)
	Struct Guid                                                  BlueprintGuid;                                     // 0x3c(0x10)
};


// Size 0x88
class Blueprint: public BlueprintCore
{
public:
	bool                                                         bRecompileOnLoad;                                  // 0x50(0x1)
	class                                                        ParentClass;                                       // 0x58(0x8)
	Class Object*                                                PRIVATE_InnermostPreviousCDO;                      // 0x60(0x8)
	bool                                                         bHasBeenRegenerated;                               // 0x68(0x1)
	bool                                                         bIsRegeneratingOnLoad;                             // 0x68(0x1)
	Class SimpleConstructionScript*                              SimpleConstructionScript;                          // 0x70(0x8)
	TArray<class ComponentTemplates*>                            ComponentTemplates;                                // 0x78(0x10)
	TArray<class Timelines*>                                     Timelines;                                         // 0x88(0x10)
	Class InheritableComponentHandler*                           InheritableComponentHandler;                       // 0x98(0x8)
	byte                                                         BlueprintType;                                     // 0xa0(0x1)
	int                                                          BlueprintSystemVersion;                            // 0xa4(0x4)
};


// Size 0x0
class Interface_AssetUserData: public Interface
{
public:
};


// Size 0x0
class TestInterface: public Interface
{
public:
};


// Size 0x0
class DerivedTestInterface: public TestInterface
{
public:
};


// Size 0x8
class ComponentWithDerivedTestInterface: public ActorComponent
{
public:
};


// Size 0x8
class ActorWithComponentWithDerivedTestInterface: public Actor
{
public:
	Class ComponentWithDerivedTestInterface*                     ComponentWithDerivedTestInterface;                 // 0x3d0(0x8)
};


// Size 0x8
class ActorWithTestInterface: public Actor
{
public:
};


// Size 0x8
class AmbientSound: public Actor
{
public:
	Class AudioComponent*                                        AudioComponent;                                    // 0x3d0(0x8)
};


// Size 0x58
class AutomaticInstancingActor: public Actor
{
public:
	Class SceneComponent*                                        DummyRoot;                                         // 0x3d0(0x8)
};


// Size 0xd8
class PendingNetGame: public Object
{
public:
	Class NetDriver*                                             NetDriver;                                         // 0x30(0x8)
	Class Package*                                               PreLoadedMapPackage;                               // 0xe8(0x8)
	Class World*                                                 PreLoadedWorld;                                    // 0xf0(0x8)
};


// Size 0x840
class World: public Object
{
public:
	Class Level*                                                 PersistentLevel;                                   // 0x30(0x8)
	Class NetDriver*                                             NetDriver;                                         // 0x38(0x8)
	Class LineBatchComponent*                                    LineBatcher;                                       // 0x40(0x8)
	Class LineBatchComponent*                                    PersistentLineBatcher;                             // 0x48(0x8)
	Class LineBatchComponent*                                    ForegroundLineBatcher;                             // 0x50(0x8)
	Class GameState*                                             GameState;                                         // 0x58(0x8)
	Class GameNetworkManager*                                    NetworkManager;                                    // 0x60(0x8)
	Class PhysicsCollisionHandler*                               PhysicsCollisionHandler;                           // 0x68(0x8)
	TArray<class ExtraReferencedObjects*>                        ExtraReferencedObjects;                            // 0x70(0x10)
	TArray<class PerModuleDataObjects*>                          PerModuleDataObjects;                              // 0x80(0x10)
	TArray<class StreamingLevels*>                               StreamingLevels;                                   // 0x90(0x10)
	Struct FString                                               StreamingLevelsPrefix;                             // 0xa0(0x10)
	Class Level*                                                 CurrentLevelPendingVisibility;                     // 0xb0(0x8)
	Class ParticleEventManager*                                  MyParticleEventManager;                            // 0xb8(0x8)
	Class PhysicsVolume*                                         DefaultPhysicsVolume;                              // 0xc0(0x8)
	TArray<class DirtyStreamingLevels*>                          DirtyStreamingLevels;                              // 0xc8(0x10)
	struct FName                                                 Feature;                                           // 0xf4(0x8)
	TArray<Struct FName>                                         FeatureReferences;                                 // 0x100(0x10)
	bool                                                         ParticleLOD_bUseGameThread;                        // 0x110(0x1)
	bool                                                         ParticleLOD_bUseMultipleViewportCase;              // 0x111(0x1)
	Struct Vector                                                ParticleLOD_PlayerViewpointLocation;               // 0x114(0xc)
	Struct FString                                               TestMetadata;                                      // 0x120(0x10)
	Class NavigationSystem*                                      NavigationSystem;                                  // 0x130(0x8)
	Class GameMode*                                              AuthorityGameMode;                                 // 0x138(0x8)
	Class AISystemBase*                                          AISystem;                                          // 0x140(0x8)
	Class AvoidanceManager*                                      AvoidanceManager;                                  // 0x148(0x8)
	TArray<class Levels*>                                        Levels;                                            // 0x150(0x10)
	Class Level*                                                 CurrentLevel;                                      // 0x1b0(0x8)
	Class GameInstance*                                          OwningGameInstance;                                // 0x1c0(0x8)
	TArray<class ParameterCollectionInstances*>                  ParameterCollectionInstances;                      // 0x1c8(0x10)
	Class WorldComposition*                                      WorldComposition;                                  // 0x798(0x8)
	bool                                                         bAreConstraintsDirty;                              // 0x7dd(0x1)
};


// Size 0x2d8
class Level: public Object
{
public:
	Class LevelActorContainer*                                   ActorCluster;                                      // 0xc8(0x8)
	Class World*                                                 OwningWorld;                                       // 0xd0(0x8)
	Class Model*                                                 Model;                                             // 0xd8(0x8)
	TArray<class ModelComponents*>                               ModelComponents;                                   // 0xe0(0x10)
	Class LevelScriptActor*                                      LevelScriptActor;                                  // 0xf0(0x8)
	Class NavigationObjectBase*                                  NavListStart;                                      // 0xf8(0x8)
	Class NavigationObjectBase*                                  NavListEnd;                                        // 0x100(0x8)
	TArray<class NavDataChunks*>                                 NavDataChunks;                                     // 0x108(0x10)
	float                                                        LightmapTotalSize;                                 // 0x118(0x4)
	float                                                        ShadowmapTotalSize;                                // 0x11c(0x4)
	TArray<Struct Vector>                                        StaticNavigableGeometry;                           // 0x120(0x10)
	bool                                                         LevelVisibility;                                   // 0x260(0x1)
	bool                                                         Blocked;                                           // 0x270(0x1)
	TArray<class AssetUserData*>                                 AssetUserData;                                     // 0x2d8(0x10)
};


// Size 0x0
class BrushShape: public Brush
{
public:
};


// Size 0x50
class AudioVolume: public Volume
{
public:
	float                                                        Priority;                                          // 0x408(0x4)
	bool                                                         bEnabled;                                          // 0x40c(0x1)
	Struct ReverbSettings                                        Settings;                                          // 0x410(0x18)
	Struct InteriorSettings                                      AmbientZoneSettings;                               // 0x428(0x24)
	Class AudioVolume*                                           NextLowerPriorityVolume;                           // 0x450(0x8)
};


// Size 0x0
class CameraBlockingVolume: public Volume
{
public:
};


// Size 0x18
class CullDistanceVolume: public Volume
{
public:
	TArray<Struct CullDistanceSizePair>                          CullDistances;                                     // 0x408(0x10)
	bool                                                         bEnabled;                                          // 0x418(0x1)
};


// Size 0x10
class FFTWater: public Volume
{
public:
	Class FFTWaterComponent*                                     FFTWaterComponent;                                 // 0x408(0x8)
	Class FFTWaterExtendedPlaneComponent*                        ExtendedPlaneComponent;                            // 0x410(0x8)
};


// Size 0x18
class LevelStreamingVolume: public Volume
{
public:
	TArray<Struct FName>                                         StreamingLevelNames;                               // 0x408(0x10)
	bool                                                         bEditorPreVisOnly;                                 // 0x418(0x1)
	bool                                                         bDisabled;                                         // 0x418(0x1)
	byte                                                         StreamingUsage;                                    // 0x41c(0x1)
};


// Size 0x0
class LightmassCharacterIndirectDetailVolume: public Volume
{
public:
};


// Size 0x0
class LightmassImportanceVolume: public Volume
{
public:
};


// Size 0x0
class NavigationTypes: public Object
{
public:
};


// Size 0x10
class NavMeshBoundsVolume: public Volume
{
public:
	Struct NavAgentSelector                                      SupportedAgents;                                   // 0x408(0x4)
	struct FName                                                 OriginatingLevelName;                              // 0x40c(0x8)
};


// Size 0x0
class InstancedNavMeshBoundsVolume: public NavMeshBoundsVolume
{
public:
};


// Size 0x18
class NavArea: public Object
{
public:
	float                                                        DefaultCost;                                       // 0x28(0x4)
	float                                                        FixedAreaEnteringCost;                             // 0x2c(0x4)
	Struct Color                                                 DrawColor;                                         // 0x30(0x4)
	Struct NavAgentSelector                                      SupportedAgents;                                   // 0x34(0x4)
	bool                                                         bSupportsAgent0;                                   // 0x38(0x1)
	bool                                                         bSupportsAgent1;                                   // 0x38(0x1)
	bool                                                         bSupportsAgent2;                                   // 0x38(0x1)
	bool                                                         bSupportsAgent3;                                   // 0x38(0x1)
	bool                                                         bSupportsAgent4;                                   // 0x38(0x1)
	bool                                                         bSupportsAgent5;                                   // 0x38(0x1)
	bool                                                         bSupportsAgent6;                                   // 0x38(0x1)
	bool                                                         bSupportsAgent7;                                   // 0x38(0x1)
	bool                                                         bSupportsAgent8;                                   // 0x39(0x1)
	bool                                                         bSupportsAgent9;                                   // 0x39(0x1)
	bool                                                         bSupportsAgent10;                                  // 0x39(0x1)
	bool                                                         bSupportsAgent11;                                  // 0x39(0x1)
	bool                                                         bSupportsAgent12;                                  // 0x39(0x1)
	bool                                                         bSupportsAgent13;                                  // 0x39(0x1)
	bool                                                         bSupportsAgent14;                                  // 0x39(0x1)
	bool                                                         bSupportsAgent15;                                  // 0x39(0x1)
};


// Size 0x0
class NavRelevantInterface: public Interface
{
public:
};


// Size 0x10
class NavModifierVolume: public Volume
{
public:
	class                                                        AreaClass;                                         // 0x410(0x8)
};


// Size 0x0
class DefaultPhysicsVolume: public PhysicsVolume
{
public:
};


// Size 0x0
class KillZVolume: public PhysicsVolume
{
public:
};


// Size 0x28
class PainCausingVolume: public PhysicsVolume
{
public:
	bool                                                         bPainCausing;                                      // 0x418(0x1)
	float                                                        DamagePerSec;                                      // 0x41c(0x4)
	class                                                        DamageType;                                        // 0x420(0x8)
	float                                                        PainInterval;                                      // 0x428(0x4)
	bool                                                         bEntryPain;                                        // 0x42c(0x1)
	bool                                                         BACKUP_bPainCausing;                               // 0x42c(0x1)
	Class Controller*                                            DamageInstigator;                                  // 0x430(0x8)
};


// Size 0x0
class BlendableInterface: public Interface
{
public:
};


// Size 0x0
class Scene: public Object
{
public:
};


// Size 0x0
class Interface_PostProcessVolume: public Interface
{
public:
};


// Size 0x558
class PostProcessVolume: public Volume
{
public:
	Struct PostProcessSettings                                   Settings;                                          // 0x410(0x540)
	float                                                        Priority;                                          // 0x950(0x4)
	float                                                        BlendRadius;                                       // 0x954(0x4)
	float                                                        BlendWeight;                                       // 0x958(0x4)
	bool                                                         bEnabled;                                          // 0x95c(0x1)
	bool                                                         bUnbound;                                          // 0x95c(0x1)
};


// Size 0x30
class PrecomputedVisibilityOverrideVolume: public Volume
{
public:
	TArray<class OverrideVisibleActors*>                         OverrideVisibleActors;                             // 0x408(0x10)
	TArray<class OverrideInvisibleActors*>                       OverrideInvisibleActors;                           // 0x418(0x10)
	TArray<Struct FName>                                         OverrideInvisibleLevels;                           // 0x428(0x10)
};


// Size 0x0
class PrecomputedVisibilityVolume: public Volume
{
public:
};


// Size 0x0
class TriggerVolume: public Volume
{
public:
};


// Size 0x8
class CalmWaterZone: public Actor
{
public:
	Class CalmWaterComponent*                                    CalmWaterComponent;                                // 0x3d0(0x8)
};


// Size 0x570
class CameraActor: public Actor
{
public:
	byte                                                         AutoActivateForPlayer;                             // 0x3d0(0x1)
	Class CameraComponent*                                       CameraComponent;                                   // 0x3d8(0x8)
	bool                                                         bConstrainAspectRatio;                             // 0x3e8(0x1)
	float                                                        AspectRatio;                                       // 0x3ec(0x4)
	float                                                        FOVAngle;                                          // 0x3f0(0x4)
	float                                                        PostProcessBlendWeight;                            // 0x3f4(0x4)
	Struct PostProcessSettings                                   PostProcessSettings;                               // 0x400(0x540)
};


// Size 0x0
class ClientOnlyTestActor: public Actor
{
public:
};


// Size 0x0
class NavAgentInterface: public Interface
{
public:
};


// Size 0x118
class CameraShake: public Object
{
public:
	bool                                                         bSingleInstance;                                   // 0x28(0x1)
	float                                                        OscillationDuration;                               // 0x2c(0x4)
	float                                                        OscillationBlendInTime;                            // 0x30(0x4)
	float                                                        OscillationBlendOutTime;                           // 0x34(0x4)
	Struct ROscillator                                           RotOscillation;                                    // 0x38(0x24)
	Struct VOscillator                                           LocOscillation;                                    // 0x5c(0x24)
	Struct FOscillator                                           FOVOscillation;                                    // 0x80(0xc)
	float                                                        AnimPlayRate;                                      // 0x8c(0x4)
	float                                                        AnimScale;                                         // 0x90(0x4)
	float                                                        AnimBlendInTime;                                   // 0x94(0x4)
	float                                                        AnimBlendOutTime;                                  // 0x98(0x4)
	float                                                        RandomAnimSegmentDuration;                         // 0x9c(0x4)
	Class CameraAnim*                                            Anim;                                              // 0xa0(0x8)
	bool                                                         bRandomAnimSegment;                                // 0xa8(0x1)
	Class PlayerCameraManager*                                   CameraOwner;                                       // 0xc0(0x8)
	float                                                        ShakeScale;                                        // 0x130(0x4)
	float                                                        OscillatorTimeRemaining;                           // 0x134(0x4)
	Class CameraAnimInst*                                        AnimInst;                                          // 0x138(0x8)
};


// Size 0x1880
class PlayerCameraManager: public Actor
{
public:
	Class PlayerController*                                      PCOwner;                                           // 0x3d0(0x8)
	Class SceneComponent*                                        TransformComponent;                                // 0x3d8(0x8)
	float                                                        DefaultFOV;                                        // 0x3e8(0x4)
	float                                                        DefaultOrthoWidth;                                 // 0x3f0(0x4)
	float                                                        DefaultAspectRatio;                                // 0x3f8(0x4)
	Struct CameraCacheEntry                                      CameraCache;                                       // 0x440(0x5b0)
	Struct CameraCacheEntry                                      LastFrameCameraCache;                              // 0x9f0(0x5b0)
	Struct TViewTarget                                           ViewTarget;                                        // 0xfa0(0x5c0)
	Struct TViewTarget                                           PendingViewTarget;                                 // 0x1560(0x5c0)
	TArray<class ModifierList*>                                  ModifierList;                                      // 0x1b38(0x10)
	TArray<Class DefaultModifiers>                               DefaultModifiers;                                  // 0x1b48(0x10)
	float                                                        FreeCamDistance;                                   // 0x1b58(0x4)
	Struct Vector                                                FreeCamOffset;                                     // 0x1b5c(0xc)
	Struct Vector                                                ViewTargetOffset;                                  // 0x1b68(0xc)
	TArray<class CameraLensEffects*>                             CameraLensEffects;                                 // 0x1b88(0x10)
	Class CameraModifier_CameraShake*                            CachedCameraShakeMod;                              // 0x1b98(0x8)
	Class CameraAnimInst*                                        AnimInstPool;                                      // 0x1ba0(0x8)
	TArray<Struct PostProcessSettings>                           PostProcessBlendCache;                             // 0x1be0(0x10)
	TArray<class ActiveAnims*>                                   ActiveAnims;                                       // 0x1c00(0x10)
	TArray<class FreeAnims*>                                     FreeAnims;                                         // 0x1c10(0x10)
	Class CameraActor*                                           AnimCameraActor;                                   // 0x1c20(0x8)
	bool                                                         bIsOrthographic;                                   // 0x1c28(0x1)
	bool                                                         bUseClientSideCameraUpdates;                       // 0x1c28(0x1)
	bool                                                         bFollowHmdOrientation;                             // 0x1c29(0x1)
	float                                                        ViewPitchMin;                                      // 0x1c2c(0x4)
	float                                                        ViewPitchMax;                                      // 0x1c30(0x4)
	float                                                        ViewYawMin;                                        // 0x1c34(0x4)
	float                                                        ViewYawMax;                                        // 0x1c38(0x4)
	float                                                        ViewRollMin;                                       // 0x1c3c(0x4)
	float                                                        ViewRollMax;                                       // 0x1c40(0x4)
};


// Size 0x8
class CurveBase: public Object
{
public:
};


// Size 0x80
class CurveFloat: public CurveBase
{
public:
	Struct RichCurve                                             FloatCurve;                                        // 0x30(0x78)
	bool                                                         bIsEventCurve;                                     // 0xa8(0x1)
};


// Size 0x18
class ForceFeedbackEffect: public Object
{
public:
	TArray<Struct ForceFeedbackChannelDetails>                   ChannelDetails;                                    // 0x28(0x10)
	float                                                        Duration;                                          // 0x38(0x4)
};


// Size 0x18
class LogVisualizerCameraController: public DebugCameraController
{
public:
	Class Actor*                                                 PickedActor;                                       // 0x778(0x8)
};


// Size 0x8
class DecalActor: public Actor
{
public:
	Class DecalComponent*                                        Decal;                                             // 0x3d0(0x8)
};


// Size 0x20
class DestructibleActor: public Actor
{
public:
	Class DestructibleComponent*                                 DestructibleComponent;                             // 0x3d0(0x8)
	bool                                                         bAffectNavigation;                                 // 0x3d8(0x1)
};


// Size 0x8
class DocumentationActor: public Actor
{
public:
};


// Size 0x50
class Emitter: public Actor
{
public:
	Class ParticleSystemComponent*                               ParticleSystemComponent;                           // 0x3d0(0x8)
	bool                                                         bDestroyOnSystemFinish;                            // 0x3d8(0x1)
	bool                                                         bPostUpdateTickGroup;                              // 0x3d8(0x1)
	bool                                                         bCurrentlyActive;                                  // 0x3d8(0x1)
};


// Size 0x38
class EmitterCameraLensEffectBase: public Emitter
{
public:
	Class ParticleSystem*                                        PS_CameraEffect;                                   // 0x420(0x8)
	Class ParticleSystem*                                        PS_CameraEffectNonExtremeContent;                  // 0x428(0x8)
	float                                                        BaseFOV;                                           // 0x430(0x4)
	float                                                        DistFromCamera;                                    // 0x434(0x4)
	bool                                                         bAllowMultipleInstances;                           // 0x438(0x1)
	TArray<Class EmittersToTreatAsSame>                          EmittersToTreatAsSame;                             // 0x440(0x10)
	Class PlayerCameraManager*                                   BaseCamera;                                        // 0x450(0x8)
};


// Size 0x0
class DebugCameraHUD: public HUD
{
public:
};


// Size 0x28
class LogVisualizerHUD: public DebugCameraHUD
{
public:
};


// Size 0x8
class AtmosphericFog: public Info
{
public:
	Class AtmosphericFogComponent*                               AtmosphericFogComponent;                           // 0x3d0(0x8)
};


// Size 0x10
class ExponentialHeightFog: public Info
{
public:
	Class ExponentialHeightFogComponent*                         Component;                                         // 0x3d0(0x8)
	bool                                                         bEnabled;                                          // 0x3d8(0x1)
};


// Size 0x28
class NavigationObjectBase: public Actor
{
public:
	Class CapsuleComponent*                                      CapsuleComponent;                                  // 0x3d8(0x8)
	Class BillboardComponent*                                    GoodSprite;                                        // 0x3e0(0x8)
	Class BillboardComponent*                                    BadSprite;                                         // 0x3e8(0x8)
	bool                                                         bIsPIEPlayerStart;                                 // 0x3f0(0x1)
};


// Size 0x8
class PlayerStart: public NavigationObjectBase
{
public:
	struct FName                                                 PlayerStartTag;                                    // 0x3f8(0x8)
};


// Size 0x70
class GameNetworkManager: public Info
{
public:
	int                                                          AdjustedNetSpeed;                                  // 0x3d0(0x4)
	float                                                        LastNetSpeedUpdateTime;                            // 0x3d4(0x4)
	int                                                          TotalNetBandwidth;                                 // 0x3d8(0x4)
	int                                                          MinDynamicBandwidth;                               // 0x3dc(0x4)
	int                                                          MaxDynamicBandwidth;                               // 0x3e0(0x4)
	bool                                                         bIsStandbyCheckingEnabled;                         // 0x3e4(0x1)
	bool                                                         bHasStandbyCheatTriggered;                         // 0x3e4(0x1)
	float                                                        StandbyRxCheatTime;                                // 0x3e8(0x4)
	float                                                        StandbyTxCheatTime;                                // 0x3ec(0x4)
	int                                                          BadPingThreshold;                                  // 0x3f0(0x4)
	float                                                        PercentMissingForRxStandby;                        // 0x3f4(0x4)
	float                                                        PercentMissingForTxStandby;                        // 0x3f8(0x4)
	float                                                        PercentForBadPing;                                 // 0x3fc(0x4)
	float                                                        JoinInProgressStandbyWaitTime;                     // 0x400(0x4)
	float                                                        MoveRepSize;                                       // 0x404(0x4)
	float                                                        MAXPOSITIONERRORSQUARED;                           // 0x408(0x4)
	float                                                        MAXNEARZEROVELOCITYSQUARED;                        // 0x40c(0x4)
	float                                                        CLIENTADJUSTUPDATECOST;                            // 0x410(0x4)
	float                                                        MAXCLIENTUPDATEINTERVAL;                           // 0x414(0x4)
	float                                                        MaxMoveDeltaTime;                                  // 0x418(0x4)
	bool                                                         ClientAuthorativePosition;                         // 0x41c(0x1)
	float                                                        ClientErrorUpdateRateLimit;                        // 0x420(0x4)
	bool                                                         bMovementTimeDiscrepancyDetection;                 // 0x424(0x1)
	bool                                                         bMovementTimeDiscrepancyResolution;                // 0x425(0x1)
	float                                                        MovementTimeDiscrepancyMaxTimeMargin;              // 0x428(0x4)
	float                                                        MovementTimeDiscrepancyMinTimeMargin;              // 0x42c(0x4)
	float                                                        MovementTimeDiscrepancyResolutionRate;             // 0x430(0x4)
	float                                                        MovementTimeDiscrepancyDriftAllowance;             // 0x434(0x4)
	bool                                                         bMovementTimeDiscrepancyForceCorrectionsDuringResolution; // 0x438(0x1)
	bool                                                         bUseDistanceBasedRelevancy;                        // 0x439(0x1)
};


// Size 0x30
class GameSession: public Info
{
public:
	int                                                          MaxSpectators;                                     // 0x3d0(0x4)
	int                                                          MaxPlayers;                                        // 0x3d4(0x4)
	byte                                                         MaxSplitscreensPerConnection;                      // 0x3d8(0x1)
	bool                                                         bRequiresPushToTalk;                               // 0x3d9(0x1)
	struct FName                                                 SessionName;                                       // 0x3dc(0x8)
};


// Size 0x10
class SkyLight: public Info
{
public:
	Class SkyLightComponent*                                     LightComponent;                                    // 0x3d0(0x8)
	bool                                                         bEnabled;                                          // 0x3d8(0x1)
};


// Size 0x8
class WindDirectionalSource: public Info
{
public:
	Class WindDirectionalSourceComponent*                        Component;                                         // 0x3d0(0x8)
};


// Size 0x8
class LevelBounds: public Actor
{
public:
	bool                                                         bAutoUpdateBounds;                                 // 0x3d0(0x1)
};


// Size 0x30
class LightComponentBase: public SceneComponent
{
public:
	Struct Guid                                                  LightGuid;                                         // 0x2d0(0x10)
	float                                                        Brightness;                                        // 0x2e0(0x4)
	float                                                        Intensity;                                         // 0x2e4(0x4)
	Struct Color                                                 LightColor;                                        // 0x2e8(0x4)
	bool                                                         bAffectsWorld;                                     // 0x2ec(0x1)
	bool                                                         CastShadows;                                       // 0x2ec(0x1)
	bool                                                         CastStaticShadows;                                 // 0x2ec(0x1)
	bool                                                         CastDynamicShadows;                                // 0x2ec(0x1)
	bool                                                         bAffectTranslucentLighting;                        // 0x2ec(0x1)
	bool                                                         bPrecomputedLightingIsValid;                       // 0x2ec(0x1)
	bool                                                         RainOcclusion;                                     // 0x2ec(0x1)
	float                                                        IndirectLightingIntensity;                         // 0x2f0(0x4)
	float                                                        ScaleForTranslucency;                              // 0x2f4(0x4)
	float                                                        CapForTranslucency;                                // 0x2f8(0x4)
};


// Size 0x160
class LightComponent: public LightComponentBase
{
public:
	float                                                        Temperature;                                       // 0x300(0x4)
	bool                                                         bUseTemperature;                                   // 0x304(0x1)
	int                                                          ShadowMapChannel;                                  // 0x308(0x4)
	float                                                        SourceRadius;                                      // 0x310(0x4)
	float                                                        MinRoughness;                                      // 0x314(0x4)
	float                                                        ShadowBias;                                        // 0x318(0x4)
	float                                                        ShadowSharpen;                                     // 0x31c(0x4)
	float                                                        ShadowResMaxDynamicDegradation;                    // 0x320(0x4)
	bool                                                         InverseSquaredFalloff;                             // 0x324(0x1)
	bool                                                         CastTranslucentShadows;                            // 0x324(0x1)
	bool                                                         bCastShadowsFromCinematicObjectsOnly;              // 0x324(0x1)
	bool                                                         bAffectDynamicIndirectLighting;                    // 0x324(0x1)
	Class MaterialInterface*                                     LightFunctionMaterial;                             // 0x328(0x8)
	Struct Vector                                                LightFunctionScale;                                // 0x330(0xc)
	Class TextureLightProfile*                                   IESTexture;                                        // 0x340(0x8)
	bool                                                         bUseIESBrightness;                                 // 0x348(0x1)
	float                                                        IESBrightnessScale;                                // 0x34c(0x4)
	float                                                        LightFunctionFadeDistance;                         // 0x350(0x4)
	float                                                        DisabledBrightness;                                // 0x354(0x4)
	bool                                                         bEnableLightShaftBloom;                            // 0x358(0x1)
	float                                                        BloomScale;                                        // 0x35c(0x4)
	float                                                        BloomThreshold;                                    // 0x360(0x4)
	Struct Color                                                 BloomTint;                                         // 0x364(0x4)
	bool                                                         bUseRayTracedDistanceFieldShadows;                 // 0x368(0x1)
	float                                                        RayStartOffsetDepthScale;                          // 0x36c(0x4)
};


// Size 0x8
class Light: public Actor
{
public:
	Class LightComponent*                                        LightComponent;                                    // 0x3d0(0x8)
};


// Size 0x8
class AmbientLightSource: public Light
{
public:
	Class AmbientLightSourceComponent*                           AmbientLightSourceComponent;                       // 0x3d8(0x8)
};


// Size 0x0
class DirectionalLight: public Light
{
public:
};


// Size 0x8
class PointLight: public Light
{
public:
	Class PointLightComponent*                                   PointLightComponent;                               // 0x3d8(0x8)
};


// Size 0x8
class SpotLight: public Light
{
public:
	Class SpotLightComponent*                                    SpotLightComponent;                                // 0x3d8(0x8)
};


// Size 0x0
class GeneratedMeshAreaLight: public SpotLight
{
public:
};


// Size 0x38
class LODActor: public Actor
{
public:
	Class StaticMeshComponent*                                   StaticMeshComponent;                               // 0x3d0(0x8)
	TArray<class SubActors*>                                     SubActors;                                         // 0x3d8(0x10)
	float                                                        LODDrawDistance;                                   // 0x3e8(0x4)
	int                                                          LodLevel;                                          // 0x3ec(0x4)
	TArray<class SubObjects*>                                    SubObjects;                                        // 0x3f0(0x10)
};


// Size 0x10
class MaterialInstanceActor: public Actor
{
public:
	TArray<class TargetActors*>                                  TargetActors;                                      // 0x3d0(0x10)
};


// Size 0x78
class MatineeActor: public Actor
{
public:
	Class InterpData*                                            MatineeData;                                       // 0x3d0(0x8)
	struct FName                                                 MatineeControllerName;                             // 0x3d8(0x8)
	float                                                        PlayRate;                                          // 0x3e0(0x4)
	bool                                                         bPlayOnLevelLoad;                                  // 0x3e4(0x1)
	bool                                                         bForceStartPos;                                    // 0x3e4(0x1)
	float                                                        ForceStartPosition;                                // 0x3e8(0x4)
	bool                                                         bLooping;                                          // 0x3ec(0x1)
	bool                                                         bRewindOnPlay;                                     // 0x3ec(0x1)
	bool                                                         bNoResetOnRewind;                                  // 0x3ec(0x1)
	bool                                                         bRewindIfAlreadyPlaying;                           // 0x3ec(0x1)
	bool                                                         bDisableRadioFilter;                               // 0x3ec(0x1)
	bool                                                         bClientSideOnly;                                   // 0x3ec(0x1)
	bool                                                         bSkipUpdateIfNotVisible;                           // 0x3ec(0x1)
	bool                                                         bIsSkippable;                                      // 0x3ec(0x1)
	int                                                          PreferredSplitScreenNum;                           // 0x3f0(0x4)
	bool                                                         bDisableMovementInput;                             // 0x3f4(0x1)
	bool                                                         bDisableLookAtInput;                               // 0x3f4(0x1)
	bool                                                         bHidePlayer;                                       // 0x3f4(0x1)
	bool                                                         bHideHud;                                          // 0x3f4(0x1)
	TArray<Struct InterpGroupActorInfo>                          GroupActorInfos;                                   // 0x3f8(0x10)
	bool                                                         bShouldShowGore;                                   // 0x408(0x1)
	TArray<class GroupInst*>                                     GroupInst;                                         // 0x410(0x10)
	TArray<Struct CameraCutInfo>                                 CameraCuts;                                        // 0x420(0x10)
	bool                                                         bIsPlaying;                                        // 0x430(0x1)
	bool                                                         bReversePlayback;                                  // 0x430(0x1)
	bool                                                         bPaused;                                           // 0x430(0x1)
	bool                                                         bPendingStop;                                      // 0x430(0x1)
	float                                                        InterpPosition;                                    // 0x434(0x4)
	byte                                                         ReplicationForceIsPlaying;                         // 0x43c(0x1)
	bool                                                         bServerInitialLevelStreamingComplete;              // 0x444(0x1)
};


// Size 0x8
class MatineeActorCameraAnim: public MatineeActor
{
public:
	Class CameraAnim*                                            CameraAnim;                                        // 0x448(0x8)
};


// Size 0x8
class MergedCollisionActor: public Actor
{
public:
	Class MergedCollisionComponent*                              MergedCollisionComponent;                          // 0x3d0(0x8)
};


// Size 0x18
class NavigationQueryFilter: public Object
{
public:
	TArray<Struct NavigationFilterArea>                          Areas;                                             // 0x28(0x10)
	Struct NavigationFilterFlags                                 IncludeFlags;                                      // 0x38(0x4)
	Struct NavigationFilterFlags                                 ExcludeFlags;                                      // 0x3c(0x4)
};


// Size 0x1c0
class NavigationData: public Actor
{
public:
	Class PrimitiveComponent*                                    RenderingComp;                                     // 0x3d0(0x8)
	Struct NavDataConfig                                         NavDataConfig;                                     // 0x3d8(0x58)
	bool                                                         bEnableDrawing;                                    // 0x430(0x1)
	bool                                                         bRebuildAtRuntime;                                 // 0x430(0x1)
	byte                                                         RuntimeGeneration;                                 // 0x434(0x1)
	bool                                                         bForceRebuildOnLoad;                               // 0x438(0x1)
	float                                                        ObservedPathsTickInterval;                         // 0x43c(0x4)
	TArray<Struct SupportedAreaData>                             SupportedAreas;                                    // 0x528(0x10)
};


// Size 0x0
class AbstractNavData: public NavigationData
{
public:
};


// Size 0x0
class NavigationGraph: public NavigationData
{
public:
};


// Size 0xb0
class RecastNavMesh: public NavigationData
{
public:
	bool                                                         bDrawTriangleEdges;                                // 0x590(0x1)
	bool                                                         bDrawPolyEdges;                                    // 0x590(0x1)
	bool                                                         bDrawFilledPolys;                                  // 0x590(0x1)
	bool                                                         bDrawNavMeshEdges;                                 // 0x590(0x1)
	bool                                                         bDrawTileBounds;                                   // 0x590(0x1)
	bool                                                         bDrawPathCollidingGeometry;                        // 0x590(0x1)
	bool                                                         bDrawTileLabels;                                   // 0x590(0x1)
	bool                                                         bDrawPolygonLabels;                                // 0x590(0x1)
	bool                                                         bDrawDefaultPolygonCost;                           // 0x591(0x1)
	bool                                                         bDrawLabelsOnPathNodes;                            // 0x591(0x1)
	bool                                                         bDrawNavLinks;                                     // 0x591(0x1)
	bool                                                         bDrawFailedNavLinks;                               // 0x591(0x1)
	bool                                                         bDrawClusters;                                     // 0x591(0x1)
	bool                                                         bDrawOctree;                                       // 0x591(0x1)
	bool                                                         bDistinctlyDrawTilesBeingBuilt;                    // 0x591(0x1)
	bool                                                         bDrawNavMesh;                                      // 0x591(0x1)
	float                                                        DrawOffset;                                        // 0x594(0x4)
	float                                                        BuiltTileSizeUU;                                   // 0x598(0x4)
	float                                                        BuiltCellSize;                                     // 0x59c(0x4)
	bool                                                         bFixedTilePoolSize;                                // 0x5a0(0x1)
	int                                                          TilePoolSize;                                      // 0x5a4(0x4)
	float                                                        TileSizeUU;                                        // 0x5a8(0x4)
	float                                                        CellSize;                                          // 0x5ac(0x4)
	float                                                        CellHeight;                                        // 0x5b0(0x4)
	float                                                        AgentRadius;                                       // 0x5b4(0x4)
	float                                                        AgentHeight;                                       // 0x5b8(0x4)
	float                                                        AgentMaxHeight;                                    // 0x5bc(0x4)
	float                                                        AgentMaxSlope;                                     // 0x5c0(0x4)
	float                                                        AgentMaxStepHeight;                                // 0x5c4(0x4)
	float                                                        MinRegionArea;                                     // 0x5c8(0x4)
	float                                                        MergeRegionSize;                                   // 0x5cc(0x4)
	float                                                        MaxSimplificationError;                            // 0x5d0(0x4)
	int                                                          MaxSimultaneousTileGenerationJobsCount;            // 0x5d4(0x4)
	int                                                          TileNumberHardLimit;                               // 0x5d8(0x4)
	int                                                          PolyRefTileBits;                                   // 0x5dc(0x4)
	int                                                          PolyRefNavPolyBits;                                // 0x5e0(0x4)
	int                                                          PolyRefSaltBits;                                   // 0x5e4(0x4)
	float                                                        DefaultDrawDistance;                               // 0x5e8(0x4)
	float                                                        DefaultMaxSearchNodes;                             // 0x5ec(0x4)
	float                                                        DefaultMaxHierarchicalSearchNodes;                 // 0x5f0(0x4)
	byte                                                         RegionPartitioning;                                // 0x5f4(0x1)
	byte                                                         LayerPartitioning;                                 // 0x5f5(0x1)
	int                                                          RegionChunkSplits;                                 // 0x5f8(0x4)
	int                                                          LayerChunkSplits;                                  // 0x5fc(0x4)
	bool                                                         bSortNavigationAreasByCost;                        // 0x600(0x1)
	bool                                                         bPerformVoxelFiltering;                            // 0x600(0x1)
	bool                                                         bMarkLowHeightAreas;                               // 0x600(0x1)
	bool                                                         bDoFullyAsyncNavDataGathering;                     // 0x600(0x1)
	bool                                                         bUseBetterOffsetsFromCorners;                      // 0x600(0x1)
	bool                                                         bUseVirtualFilters;                                // 0x600(0x1)
	bool                                                         bUseVoxelCache;                                    // 0x600(0x1)
	float                                                        TileSetUpdateInterval;                             // 0x604(0x4)
	float                                                        HeuristicScale;                                    // 0x608(0x4)
	float                                                        VerticalDeviationFromGroundCompensation;           // 0x60c(0x4)
};


// Size 0x0
class NavigationGraphNode: public Actor
{
public:
};


// Size 0x0
class PlayerStartPIE: public PlayerStart
{
public:
};


// Size 0x0
class NavPathObserverInterface: public Interface
{
public:
};


// Size 0xd0
class NavigationTestingActor: public Actor
{
public:
	Class CapsuleComponent*                                      CapsuleComponent;                                  // 0x3e0(0x8)
	Class NavigationInvokerComponent*                            InvokerComponent;                                  // 0x3e8(0x8)
	bool                                                         bActAsNavigationInvoker;                           // 0x3f0(0x1)
	Struct NavAgentProperties                                    NavAgentProps;                                     // 0x3f4(0x30)
	Struct Vector                                                QueryingExtent;                                    // 0x424(0xc)
	Class NavigationData*                                        MyNavData;                                         // 0x430(0x8)
	Struct Vector                                                ProjectedLocation;                                 // 0x438(0xc)
	bool                                                         bProjectedLocationValid;                           // 0x444(0x1)
	bool                                                         bSearchStart;                                      // 0x444(0x1)
	bool                                                         bUseHierarchicalPathfinding;                       // 0x444(0x1)
	bool                                                         bGatherDetailedInfo;                               // 0x444(0x1)
	bool                                                         bShowNodePool;                                     // 0x444(0x1)
	bool                                                         bShowBestPath;                                     // 0x444(0x1)
	bool                                                         bShowDiffWithPreviousStep;                         // 0x444(0x1)
	bool                                                         bShouldBeVisibleInGame;                            // 0x444(0x1)
	byte                                                         CostDisplayMode;                                   // 0x448(0x1)
	Struct Vector2D                                              TextCanvasOffset;                                  // 0x44c(0x8)
	bool                                                         bPathExist;                                        // 0x454(0x1)
	bool                                                         bPathIsPartial;                                    // 0x454(0x1)
	bool                                                         bPathSearchOutOfNodes;                             // 0x454(0x1)
	float                                                        PathfindingTime;                                   // 0x458(0x4)
	float                                                        PathCost;                                          // 0x45c(0x4)
	int                                                          PathfindingSteps;                                  // 0x460(0x4)
	Class NavigationTestingActor*                                OtherActor;                                        // 0x468(0x8)
	class                                                        FilterClass;                                       // 0x470(0x8)
	int                                                          ShowStepIndex;                                     // 0x478(0x4)
	float                                                        OffsetFromCornersDistance;                         // 0x47c(0x4)
};


// Size 0x28
class NavLinkDefinition: public Object
{
public:
	TArray<Struct NavigationLink>                                Links;                                             // 0x28(0x10)
	TArray<Struct NavigationSegmentLink>                         SegmentLinks;                                      // 0x38(0x10)
};


// Size 0x0
class NavLinkHostInterface: public Interface
{
public:
};


// Size 0x50
class NavLinkProxy: public Actor
{
public:
	TArray<Struct NavigationLink>                                PointLinks;                                        // 0x3e0(0x10)
	TArray<Struct NavigationSegmentLink>                         SegmentLinks;                                      // 0x3f0(0x10)
	Class NavLinkCustomComponent*                                SmartLinkComp;                                     // 0x400(0x8)
	bool                                                         bSmartLinkIsRelevant;                              // 0x408(0x1)
};


// Size 0x0
class Note: public Actor
{
public:
};


// Size 0x118
class ParticleSystem: public Object
{
public:
	byte                                                         SystemUpdateMode;                                  // 0x28(0x1)
	float                                                        UpdateTime_FPS;                                    // 0x2c(0x4)
	float                                                        UpdateTime_Delta;                                  // 0x30(0x4)
	float                                                        WarmUpTime;                                        // 0x34(0x4)
	float                                                        WarmupTickRate;                                    // 0x38(0x4)
	TArray<class Emitters*>                                      Emitters;                                          // 0x40(0x10)
	Class ParticleSystemComponent*                               PreviewComponent;                                  // 0x50(0x8)
	Class InterpCurveEdSetup*                                    CurveEdSetup;                                      // 0x58(0x8)
	bool                                                         bOrientZAxisTowardCamera;                          // 0x60(0x1)
	float                                                        LODDistanceCheckTime;                              // 0x64(0x4)
	byte                                                         LODMethod;                                         // 0x68(0x1)
	TArray<Float LODDistances>                                   LODDistances;                                      // 0x70(0x10)
	bool                                                         bRegenerateLODDuplicate;                           // 0x80(0x1)
	TArray<Struct ParticleSystemLOD>                             LODSettings;                                       // 0x88(0x10)
	bool                                                         bIgnoreBoundsRotation;                             // 0x98(0x1)
	bool                                                         bBoostParticleAggregationPriority;                 // 0x98(0x1)
	bool                                                         bUseFixedRelativeBoundingBox;                      // 0x98(0x1)
	Struct Box                                                   FixedRelativeBoundingBox;                          // 0x9c(0x1c)
	bool                                                         bUseLowResTranslucencyBoundingBox;                 // 0xb8(0x1)
	Struct Box                                                   LowResTranslucencyBoundingBox;                     // 0xbc(0x1c)
	float                                                        SecondsBeforeInactive;                             // 0xd8(0x4)
	bool                                                         bShouldResetPeakCounts;                            // 0xdc(0x1)
	bool                                                         bHasPhysics;                                       // 0xdc(0x1)
	bool                                                         bPostPhysicsTick;                                  // 0xdc(0x1)
	bool                                                         bUseRealtimeThumbnail;                             // 0xdc(0x1)
	bool                                                         ThumbnailImageOutOfDate;                           // 0xdc(0x1)
	float                                                        Delay;                                             // 0xe0(0x4)
	float                                                        DelayLow;                                          // 0xe4(0x4)
	bool                                                         bUseDelayRange;                                    // 0xe8(0x1)
	Struct Vector                                                MacroUVPosition;                                   // 0xec(0xc)
	float                                                        MacroUVRadius;                                     // 0xf8(0x4)
	byte                                                         OcclusionBoundsMethod;                             // 0xfc(0x1)
	Struct Box                                                   CustomOcclusionBounds;                             // 0x100(0x1c)
	TArray<Struct LODSoloTrack>                                  SoloTracking;                                      // 0x120(0x10)
	TArray<Struct NamedEmitterMaterial>                          NamedMaterialSlots;                                // 0x130(0x10)
};


// Size 0x10
class ParticleSystemAggregateTickSettings: public Object
{
public:
	int                                                          FramesTickScaledOver;                              // 0x28(0x4)
	int                                                          MaxTicksPerFrame;                                  // 0x2c(0x4)
	float                                                        PriorityInflationPower;                            // 0x30(0x4)
};


// Size 0x0
class ParticleEventManager: public Actor
{
public:
};


// Size 0x0
class Interface_CollisionDataProvider: public Interface
{
public:
};


// Size 0x10
class MeshPatchAsset: public Object
{
public:
};


// Size 0x210
class SkeletalMesh: public Object
{
public:
	Class Skeleton*                                              Skeleton;                                          // 0x50(0x8)
	Struct BoxSphereBounds                                       Bounds;                                            // 0x58(0x1c)
	TArray<Struct SkeletalMaterial>                              Materials;                                         // 0x78(0x10)
	TArray<Struct BoneMirrorInfo>                                SkelMirrorTable;                                   // 0x88(0x10)
	byte                                                         SkelMirrorAxis;                                    // 0x98(0x1)
	byte                                                         SkelMirrorFlipAxis;                                // 0x99(0x1)
	TArray<Struct SkeletalMeshLODInfo>                           LODInfo;                                           // 0xa0(0x10)
	bool                                                         bUseFullPrecisionUVs;                              // 0xb0(0x1)
	bool                                                         bHasBeenSimplified;                                // 0xb0(0x1)
	bool                                                         bHasVertexColors;                                  // 0xb0(0x1)
	TArray<Struct DeformablesSettings>                           DeformablesSettings;                               // 0xb8(0x10)
	bool                                                         bKeepTessellationAdjacency;                        // 0xc8(0x1)
	bool                                                         bKeepSkeletalMeshBuffersInMemory;                  // 0xc8(0x1)
	bool                                                         bEnablePerPolyCollision;                           // 0xc8(0x1)
	Class BodySetup*                                             BodySetup;                                         // 0xd0(0x8)
	Class PhysicsAsset*                                          PhysicsAsset;                                      // 0xd8(0x8)
	Class HIKCharacterization*                                   Characterization;                                  // 0xe0(0x8)
	Class PhysicsAsset*                                          DeformablesPhysicsAsset;                           // 0xe8(0x8)
	float                                                        StreamingDistanceMultiplier;                       // 0xf0(0x4)
	float                                                        StreamingDiscardedTexelRatios;                     // 0xf4(0x4)
	TArray<class MorphTargets*>                                  MorphTargets;                                      // 0xf8(0x10)
	TArray<class MeshPatchAssets*>                               MeshPatchAssets;                                   // 0x108(0x10)
	TArray<Struct ClothingAssetData>                             ClothingAssets;                                    // 0x1f0(0x10)
	TArray<class AssetUserData*>                                 AssetUserData;                                     // 0x210(0x10)
	TArray<class Sockets*>                                       Sockets;                                           // 0x228(0x10)
};


// Size 0x28
class AnimationAsset: public Object
{
public:
	Class Skeleton*                                              Skeleton;                                          // 0x28(0x8)
	TArray<class MetaData*>                                      MetaData;                                          // 0x40(0x10)
};


// Size 0x28
class DefaultPawn: public Pawn
{
public:
	float                                                        BaseTurnRate;                                      // 0x448(0x4)
	float                                                        BaseLookUpRate;                                    // 0x44c(0x4)
	Class PawnMovementComponent*                                 MovementComponent;                                 // 0x450(0x8)
	Class SphereComponent*                                       CollisionComponent;                                // 0x458(0x8)
	Class StaticMeshComponent*                                   MeshComponent;                                     // 0x460(0x8)
	bool                                                         bAddDefaultMovementBindings;                       // 0x468(0x1)
};


// Size 0x0
class SpectatorPawn: public DefaultPawn
{
public:
};


// Size 0x8
class ReflectionCapture: public Actor
{
public:
	Class ReflectionCaptureComponent*                            CaptureComponent;                                  // 0x3d0(0x8)
};


// Size 0x0
class BoxReflectionCapture: public ReflectionCapture
{
public:
};


// Size 0x0
class PlaneReflectionCapture: public ReflectionCapture
{
public:
};


// Size 0x8
class SphereReflectionCapture: public ReflectionCapture
{
public:
	Class DrawSphereComponent*                                   DrawCaptureRadius;                                 // 0x3d8(0x8)
};


// Size 0x0
class RigidBodyBase: public Actor
{
public:
};


// Size 0x20
class PhysicsConstraintActor: public RigidBodyBase
{
public:
	Class PhysicsConstraintComponent*                            ConstraintComp;                                    // 0x3d0(0x8)
	Class Actor*                                                 ConstraintActor1;                                  // 0x3d8(0x8)
	Class Actor*                                                 ConstraintActor2;                                  // 0x3e0(0x8)
	bool                                                         bDisableCollision;                                 // 0x3e8(0x1)
};


// Size 0x8
class PhysicsThruster: public RigidBodyBase
{
public:
	Class PhysicsThrusterComponent*                              ThrusterComponent;                                 // 0x3d0(0x8)
};


// Size 0x8
class RadialForceActor: public RigidBodyBase
{
public:
	Class RadialForceComponent*                                  ForceComponent;                                    // 0x3d0(0x8)
};


// Size 0x8
class SceneCapture: public Actor
{
public:
	Class StaticMeshComponent*                                   MeshComp;                                          // 0x3d0(0x8)
};


// Size 0x10
class SceneCapture2D: public SceneCapture
{
public:
	Class SceneCaptureComponent2D*                               CaptureComponent2D;                                // 0x3d8(0x8)
	Class DrawFrustumComponent*                                  DrawFrustum;                                       // 0x3e0(0x8)
};


// Size 0x10
class SceneCaptureCube: public SceneCapture
{
public:
	Class SceneCaptureComponentCube*                             CaptureComponentCube;                              // 0x3d8(0x8)
	Class DrawFrustumComponent*                                  DrawFrustum;                                       // 0x3e0(0x8)
};


// Size 0x0
class ServerOnlyTestActor: public Actor
{
public:
};


// Size 0x120
class SkinnedMeshComponent: public MeshComponent
{
public:
	Class SkeletalMesh*                                          SkeletalMesh;                                      // 0x5b8(0x8)
	Class MaterialInterface*                                     CustomDepthMaterial;                               // 0x608(0x8)
	bool                                                         bUseBoundsFromMasterPoseComponent;                 // 0x620(0x1)
	TArray<Struct ActiveVertexAnim>                              ActiveVertexAnims;                                 // 0x628(0x10)
	Class PhysicsAsset*                                          PhysicsAssetOverride;                              // 0x638(0x8)
	int                                                          ForcedLodModel;                                    // 0x640(0x4)
	int                                                          MinLodModel;                                       // 0x644(0x4)
	int                                                          PredictedLODLevel;                                 // 0x648(0x4)
	int                                                          OldPredictedLODLevel;                              // 0x64c(0x4)
	float                                                        MaxDistanceFactor;                                 // 0x650(0x4)
	TArray<Struct SkelMeshComponentLODInfo>                      LODInfo;                                           // 0x658(0x10)
	float                                                        StreamingDistanceMultiplier;                       // 0x668(0x4)
	Struct Color                                                 WireframeColor;                                    // 0x66c(0x4)
	bool                                                         bForceWireframe;                                   // 0x670(0x1)
	bool                                                         bDisplayBones;                                     // 0x670(0x1)
	bool                                                         bDisplayBoneCollisions;                            // 0x670(0x1)
	bool                                                         bDisableMorphTarget;                               // 0x670(0x1)
	bool                                                         bHideSkin;                                         // 0x670(0x1)
	bool                                                         bPerBoneMotionBlur;                                // 0x688(0x1)
	bool                                                         bComponentUseFixedSkelBounds;                      // 0x688(0x1)
	bool                                                         bConsiderAllBodiesForBounds;                       // 0x688(0x1)
	byte                                                         MeshComponentUpdateFlag;                           // 0x68c(0x1)
	bool                                                         bForceMeshObjectUpdate;                            // 0x690(0x1)
	bool                                                         bChartDistanceFactor;                              // 0x690(0x1)
	bool                                                         bCanHighlightSelectedSections;                     // 0x690(0x1)
	bool                                                         bRecentlyRendered;                                 // 0x690(0x1)
	float                                                        ProgressiveDrawingFraction;                        // 0x694(0x4)
	byte                                                         CustomSortAlternateIndexMode;                      // 0x698(0x1)
	Struct BoxSphereBounds                                       CachedLocalBounds;                                 // 0x6ac(0x1c)
	bool                                                         bCachedLocalBoundsUpToDate;                        // 0x6c8(0x1)
	bool                                                         bEnableUpdateRateOptimizations;                    // 0x6c9(0x1)
	bool                                                         bDisplayDebugUpdateRateOptimizations;              // 0x6ca(0x1)
};


// Size 0x1b0
class PhysicsConstraintComponent: public SceneComponent
{
public:
	Class Actor*                                                 ConstraintActor1;                                  // 0x2d0(0x8)
	Struct ConstrainComponentPropName                            ComponentName1;                                    // 0x2d8(0x8)
	Class Actor*                                                 ConstraintActor2;                                  // 0x2e0(0x8)
	Struct ConstrainComponentPropName                            ComponentName2;                                    // 0x2e8(0x8)
	Class PhysicsConstraintTemplate*                             ConstraintSetup;                                   // 0x300(0x8)
	Struct ConstraintInstance                                    ConstraintInstance;                                // 0x320(0x160)
};


// Size 0x240
class Skeleton: public Object
{
public:
	TArray<Struct BoneNode>                                      BoneTree;                                          // 0x28(0x10)
	TArray<Struct SkeletonToMeshLinkup>                          LinkupCache;                                       // 0xb8(0x10)
	TArray<class Sockets*>                                       Sockets;                                           // 0xc8(0x10)
	Struct SmartNameContainer                                    SmartNames;                                        // 0x128(0x50)
	TArray<Struct AnimSlotGroup>                                 SlotGroups;                                        // 0x178(0x10)
};


// Size 0x0
class Interface_Animatable: public Interface
{
public:
};


// Size 0x2d0
class SkeletalMeshComponent: public SkinnedMeshComponent
{
public:
	byte                                                         AnimationMode;                                     // 0x6f0(0x1)
	class                                                        AnimBlueprintGeneratedClass;                       // 0x6f8(0x8)
	Class AnimInstance*                                          AnimScriptInstance;                                // 0x700(0x8)
	Struct SingleAnimationPlayData                               AnimationData;                                     // 0x708(0x20)
	TArray<Struct Transform>                                     CachedLocalAtoms;                                  // 0x738(0x10)
	TArray<Struct Transform>                                     CachedSpaceBases;                                  // 0x748(0x10)
	float                                                        GlobalAnimRateScale;                               // 0x780(0x4)
	bool                                                         bHasValidBodies;                                   // 0x784(0x1)
	byte                                                         KinematicBonesUpdateType;                          // 0x788(0x1)
	bool                                                         bBlendPhysics;                                     // 0x78c(0x1)
	bool                                                         bEnablePhysicsOnDedicatedServer;                   // 0x78c(0x1)
	bool                                                         bUpdateJointsFromAnimation;                        // 0x78c(0x1)
	bool                                                         bDisableClothSimulation;                           // 0x78c(0x1)
	bool                                                         bCollideWithEnvironment;                           // 0x78c(0x1)
	bool                                                         bCollideWithAttachedChildren;                      // 0x78c(0x1)
	bool                                                         bLocalSpaceSimulation;                             // 0x78c(0x1)
	bool                                                         bClothMorphTarget;                                 // 0x78c(0x1)
	bool                                                         bResetAfterTeleport;                               // 0x78d(0x1)
	float                                                        TeleportDistanceThreshold;                         // 0x790(0x4)
	float                                                        TeleportRotationThreshold;                         // 0x794(0x4)
	float                                                        ClothBlendWeight;                                  // 0x798(0x4)
	Struct Vector                                                RootBoneTranslation;                               // 0x7a0(0xc)
	bool                                                         bNoSkeletonUpdate;                                 // 0x7ac(0x1)
	bool                                                         bPauseAnims;                                       // 0x7ac(0x1)
	bool                                                         bEnablePerPolyCollision;                           // 0x7ac(0x1)
	Class BodySetup*                                             BodySetup;                                         // 0x7b0(0x8)
	bool                                                         bAutonomousTickPose;                               // 0x7b8(0x1)
	bool                                                         bForceRefpose;                                     // 0x7b8(0x1)
	bool                                                         bOldForceRefPose;                                  // 0x7b8(0x1)
	bool                                                         bShowPrePhysBones;                                 // 0x7b8(0x1)
	bool                                                         bRequiredBonesUpToDate;                            // 0x7b8(0x1)
	bool                                                         bAnimTreeInitialised;                              // 0x7b8(0x1)
	bool                                                         bEnableLineCheckWithBounds;                        // 0x7b8(0x1)
	Struct Vector                                                LineCheckBoundsScale;                              // 0x7bc(0xc)
	int                                                          RagdollAggregateThreshold;                         // 0x7c8(0x4)
	bool                                                         UseRefPoseToInitialise;                            // 0x7e0(0x1)
	float                                                        LastPoseTickTime;                                  // 0x9a8(0x4)
};


// Size 0x0
class MatineeAnimInterface: public Interface
{
public:
};


// Size 0x40
class SkeletalMeshActor: public Actor
{
public:
	bool                                                         bShouldDoAnimNotifies;                             // 0x3d8(0x1)
	bool                                                         bWakeOnLevelStart;                                 // 0x3d8(0x1)
	Class SkeletalMeshComponent*                                 SkeletalMeshComponent;                             // 0x3e0(0x8)
	Class SkeletalMesh*                                          ReplicatedMesh;                                    // 0x3e8(0x8)
	Class PhysicsAsset*                                          ReplicatedPhysAsset;                               // 0x3f0(0x8)
	Class MaterialInterface*                                     ReplicatedMaterial0;                               // 0x3f8(0x8)
	Class MaterialInterface*                                     ReplicatedMaterial1;                               // 0x400(0x8)
};


// Size 0x8
class SplineMeshActor: public Actor
{
public:
	Class SplineMeshComponent*                                   SplineMeshComponent;                               // 0x3d0(0x8)
};


// Size 0x8
class CoveredMeshActor: public StaticMeshActor
{
public:
	Class InstancedCoverageMeshComponent*                        InstancedCoverageMeshComponent;                    // 0x3e0(0x8)
};


// Size 0x0
class StreamingProbe: public Actor
{
public:
};


// Size 0x0
class TargetPoint: public Actor
{
public:
};


// Size 0x8
class TextRenderActor: public Actor
{
public:
	Class TextRenderComponent*                                   TextRender;                                        // 0x3d0(0x8)
};


// Size 0x10
class TriggerBase: public Actor
{
public:
	Class ShapeComponent*                                        CollisionComponent;                                // 0x3d0(0x8)
	Class BillboardComponent*                                    SpriteComponent;                                   // 0x3d8(0x8)
};


// Size 0x0
class TriggerBox: public TriggerBase
{
public:
};


// Size 0x0
class TriggerCapsule: public TriggerBase
{
public:
};


// Size 0x0
class TriggerSphere: public TriggerBase
{
public:
};


// Size 0x8
class VectorFieldVolume: public Actor
{
public:
	Class VectorFieldComponent*                                  VectorFieldComponent;                              // 0x3d0(0x8)
};


// Size 0x8
class WaterEmissionVolume: public Actor
{
public:
	Class WaterEmissionVolumeComponent*                          WaterEmissionVolumeComponent;                      // 0x3d0(0x8)
};


// Size 0x8
class ComponentWithTestInterface: public ActorComponent
{
public:
};


// Size 0x8
class AnotherComponentWithTestInterface: public ActorComponent
{
public:
};


// Size 0x50
class ApplicationLifecycleComponent: public ActorComponent
{
public:
};


// Size 0x0
class AggregatorInterface: public Interface
{
public:
};


// Size 0x18
class ComponentAggregatorComponent: public ActorComponent
{
public:
	TArray<class Aggregatables*>                                 Aggregatables;                                     // 0xd0(0x10)
};


// Size 0x98
class InterpToMovementComponent: public MovementComponent
{
public:
	float                                                        Duration;                                          // 0x110(0x4)
	bool                                                         bPauseOnImpact;                                    // 0x114(0x1)
	byte                                                         BehaviourType;                                     // 0x118(0x1)
	bool                                                         bForceSubStepping;                                 // 0x11c(0x1)
	float                                                        MaxSimulationTimeStep;                             // 0x170(0x4)
	int                                                          MaxSimulationIterations;                           // 0x174(0x4)
	TArray<Struct InterpControlPoint>                            ControlPoints;                                     // 0x178(0x10)
};


// Size 0x3b0
class NavigationSystem: public BlueprintFunctionLibrary
{
public:
	Class NavigationData*                                        MainNavData;                                       // 0x28(0x8)
	Class NavigationData*                                        AbstractNavData;                                   // 0x30(0x8)
	bool                                                         bAutoCreateNavigationData;                         // 0x38(0x1)
	bool                                                         bAllowClientSideNavigation;                        // 0x38(0x1)
	bool                                                         bSupportRebuilding;                                // 0x38(0x1)
	bool                                                         bInitialBuildingLocked;                            // 0x38(0x1)
	bool                                                         bSkipAgentHeightCheckWhenPickingNavData;           // 0x38(0x1)
	byte                                                         DataGatheringMode;                                 // 0x3c(0x1)
	bool                                                         bGenerateNavigationOnlyAroundNavigationInvokers;   // 0x40(0x1)
	float                                                        ActiveTilesUpdateInterval;                         // 0x44(0x4)
	TArray<Struct NavDataConfig>                                 SupportedAgents;                                   // 0x48(0x10)
	float                                                        DirtyAreasUpdateFreq;                              // 0x58(0x4)
	TArray<class NavDataSet*>                                    NavDataSet;                                        // 0x60(0x10)
	TArray<class NavDataRegistrationQueue*>                      NavDataRegistrationQueue;                          // 0x70(0x10)
	byte                                                         OperationMode;                                     // 0x1cc(0x1)
	Struct StringAssetReference                                  InstancedNavMeshesDataAsset;                       // 0x3c0(0x10)
	Class InstancedNavMeshesDataAsset*                           InstancedNavMeshesData;                            // 0x3d0(0x8)
};


// Size 0x28
class AnimSequenceBase: public AnimationAsset
{
public:
	TArray<Struct AnimNotifyEvent>                               Notifies;                                          // 0x50(0x10)
	float                                                        SequenceLength;                                    // 0x60(0x4)
	float                                                        RateScale;                                         // 0x64(0x4)
	Struct RawCurveTracks                                        RawCurveData;                                      // 0x68(0x10)
};


// Size 0x0
class AnimCompositeBase: public AnimSequenceBase
{
public:
};


// Size 0x0
class AnimStateMachineTypes: public Object
{
public:
};


// Size 0x70
class AnimMontage: public AnimCompositeBase
{
public:
	float                                                        BlendInTime;                                       // 0x78(0x4)
	float                                                        BlendOutTime;                                      // 0x7c(0x4)
	float                                                        BlendOutTriggerTime;                               // 0x80(0x4)
	TArray<Struct CompositeSection>                              CompositeSections;                                 // 0x88(0x10)
	TArray<Struct SlotAnimationTrack>                            SlotAnimTracks;                                    // 0x98(0x10)
	TArray<Struct BranchingPoint>                                BranchingPoints;                                   // 0xa8(0x10)
	bool                                                         bEnableRootMotionTranslation;                      // 0xb8(0x1)
	bool                                                         bEnableRootMotionRotation;                         // 0xb9(0x1)
	byte                                                         RootMotionRootLock;                                // 0xba(0x1)
	TArray<Struct BranchingPointMarker>                          BranchingPointMarkers;                             // 0xc0(0x10)
	bool                                                         bAnimBranchingPointNeedsSort;                      // 0xd0(0x1)
	TArray<Int BranchingPointStateNotifyIndices>                 BranchingPointStateNotifyIndices;                  // 0xd8(0x10)
};


// Size 0x0
class RVOAvoidanceInterface: public Interface
{
public:
};


// Size 0x0
class NetworkPredictionInterface: public Interface
{
public:
};


// Size 0x18
class FloatingPawnMovement: public PawnMovementComponent
{
public:
	float                                                        MaxSpeed;                                          // 0x160(0x4)
	float                                                        Acceleration;                                      // 0x164(0x4)
	float                                                        Deceleration;                                      // 0x168(0x4)
	float                                                        TurningBoost;                                      // 0x16c(0x4)
	bool                                                         bPositionCorrected;                                // 0x170(0x1)
};


// Size 0x8
class SpectatorPawnMovement: public FloatingPawnMovement
{
public:
	bool                                                         bIgnoreTimeDilation;                               // 0x178(0x1)
};


// Size 0x68
class ProjectileMovementComponent: public MovementComponent
{
public:
	float                                                        InitialSpeed;                                      // 0x110(0x4)
	float                                                        MaxSpeed;                                          // 0x114(0x4)
	bool                                                         bRotationFollowsVelocity;                          // 0x118(0x1)
	bool                                                         bShouldBounce;                                     // 0x118(0x1)
	bool                                                         bInitialVelocityInLocalSpace;                      // 0x118(0x1)
	bool                                                         bForceSubStepping;                                 // 0x118(0x1)
	bool                                                         bIsHomingProjectile;                               // 0x118(0x1)
	bool                                                         bBounceAngleAffectsFriction;                       // 0x118(0x1)
	bool                                                         bIsSliding;                                        // 0x118(0x1)
	float                                                        PreviousHitTime;                                   // 0x11c(0x4)
	Struct Vector                                                PreviousHitNormal;                                 // 0x120(0xc)
	float                                                        ProjectileGravityScale;                            // 0x12c(0x4)
	float                                                        Buoyancy;                                          // 0x130(0x4)
	float                                                        Bounciness;                                        // 0x134(0x4)
	float                                                        Friction;                                          // 0x138(0x4)
	float                                                        BounceVelocityStopSimulatingThreshold;             // 0x13c(0x4)
	float                                                        HomingAccelerationMagnitude;                       // 0x160(0x4)
	float                                                        MaxSimulationTimeStep;                             // 0x16c(0x4)
	int                                                          MaxSimulationIterations;                           // 0x170(0x4)
};


// Size 0x20
class RotatingMovementComponent: public MovementComponent
{
public:
	Struct Rotator                                               RotationRate;                                      // 0x110(0xc)
	Struct Vector                                                PivotTranslation;                                  // 0x11c(0xc)
	bool                                                         bRotationInLocalSpace;                             // 0x128(0x1)
};


// Size 0x8
class NavigationInvokerComponent: public ActorComponent
{
public:
	float                                                        TileGenerationRadius;                              // 0xc8(0x4)
	float                                                        TileRemovalRadius;                                 // 0xcc(0x4)
};


// Size 0x30
class NavRelevantComponent: public ActorComponent
{
public:
	bool                                                         bNavigationRelevant;                               // 0xec(0x1)
	bool                                                         bAttachToOwnersRoot;                               // 0xec(0x1)
	Class Object*                                                CachedNavParent;                                   // 0xf0(0x8)
};


// Size 0x0
class NavLinkCustomInterface: public Interface
{
public:
};


// Size 0x98
class NavLinkCustomComponent: public NavRelevantComponent
{
public:
	class                                                        EnabledAreaClass;                                  // 0x108(0x8)
	class                                                        DisabledAreaClass;                                 // 0x110(0x8)
	Struct Vector                                                LinkRelativeStart;                                 // 0x118(0xc)
	Struct Vector                                                LinkRelativeEnd;                                   // 0x124(0xc)
	byte                                                         LinkDirection;                                     // 0x130(0x1)
	bool                                                         bLinkEnabled;                                      // 0x134(0x1)
	bool                                                         bNotifyWhenEnabled;                                // 0x134(0x1)
	bool                                                         bNotifyWhenDisabled;                               // 0x134(0x1)
	bool                                                         bCreateBoxObstacle;                                // 0x134(0x1)
	Struct Vector                                                ObstacleOffset;                                    // 0x138(0xc)
	Struct Vector                                                ObstacleExtent;                                    // 0x144(0xc)
	class                                                        ObstacleAreaClass;                                 // 0x150(0x8)
	float                                                        BroadcastRadius;                                   // 0x158(0x4)
	float                                                        BroadcastInterval;                                 // 0x15c(0x4)
	byte                                                         BroadcastChannel;                                  // 0x160(0x1)
};


// Size 0x20
class NavModifierComponent: public NavRelevantComponent
{
public:
	class                                                        AreaClass;                                         // 0xf8(0x8)
	Struct Vector                                                FailsafeExtent;                                    // 0x100(0xc)
};


// Size 0x28
class PawnNoiseEmitterComponent: public ActorComponent
{
public:
	bool                                                         bAIPerceptionSystemCompatibilityMode;              // 0xc8(0x1)
	Struct Vector                                                LastRemoteNoisePosition;                           // 0xcc(0xc)
	float                                                        NoiseLifetime;                                     // 0xd8(0x4)
	float                                                        LastRemoteNoiseVolume;                             // 0xdc(0x4)
	float                                                        LastRemoteNoiseTime;                               // 0xe0(0x4)
	float                                                        LastLocalNoiseVolume;                              // 0xe4(0x4)
	float                                                        LastLocalNoiseTime;                                // 0xe8(0x4)
};


// Size 0xa8
class PhysicsHandleComponent: public ActorComponent
{
public:
	Class PrimitiveComponent*                                    GrabbedComponent;                                  // 0xc8(0x8)
	float                                                        LinearDamping;                                     // 0xe0(0x4)
	float                                                        LinearStiffness;                                   // 0xe4(0x4)
	float                                                        AngularDamping;                                    // 0xe8(0x4)
	float                                                        AngularStiffness;                                  // 0xec(0x4)
	float                                                        InterpolationSpeed;                                // 0x150(0x4)
};


// Size 0x20
class PlatformEventsComponent: public ActorComponent
{
public:
};


// Size 0x1e0
class AtmosphericFogComponent: public SceneComponent
{
public:
	float                                                        SunMultiplier;                                     // 0x2d0(0x4)
	float                                                        FogMultiplier;                                     // 0x2d4(0x4)
	float                                                        DensityMultiplier;                                 // 0x2d8(0x4)
	float                                                        DensityOffset;                                     // 0x2dc(0x4)
	float                                                        DistanceScale;                                     // 0x2e0(0x4)
	float                                                        AltitudeScale;                                     // 0x2e4(0x4)
	float                                                        DistanceOffset;                                    // 0x2e8(0x4)
	float                                                        GroundOffset;                                      // 0x2ec(0x4)
	float                                                        StartDistance;                                     // 0x2f0(0x4)
	float                                                        SunDiscScale;                                      // 0x2f4(0x4)
	float                                                        DefaultBrightness;                                 // 0x2f8(0x4)
	Struct Color                                                 DefaultLightColor;                                 // 0x2fc(0x4)
	bool                                                         bDisableSunDisk;                                   // 0x300(0x1)
	bool                                                         bDisableGroundScattering;                          // 0x300(0x1)
	Struct AtmospherePrecomputeParameters                        PrecomputeParams;                                  // 0x304(0x2c)
	Class Texture2D*                                             TransmittanceTexture;                              // 0x330(0x8)
	Class Texture2D*                                             IrradianceTexture;                                 // 0x338(0x8)
};


// Size 0xc0
class SoundAttenuation: public Object
{
public:
	Struct AttenuationSettings                                   Attenuation;                                       // 0x28(0xc0)
};


// Size 0x150
class AudioComponent: public SceneComponent
{
public:
	Class SoundBase*                                             Sound;                                             // 0x2d0(0x8)
	TArray<Struct AudioComponentParam>                           InstanceParameters;                                // 0x2d8(0x10)
	Class SoundClass*                                            SoundClassOverride;                                // 0x2e8(0x8)
	bool                                                         bAutoDestroy;                                      // 0x2f0(0x1)
	bool                                                         bStopWhenOwnerDestroyed;                           // 0x2f0(0x1)
	bool                                                         bShouldRemainActiveIfDropped;                      // 0x2f0(0x1)
	bool                                                         bAllowSpatialization;                              // 0x2f0(0x1)
	bool                                                         bOverrideAttenuation;                              // 0x2f0(0x1)
	bool                                                         bIsUISound;                                        // 0x2f0(0x1)
	float                                                        PitchModulationMin;                                // 0x2f4(0x4)
	float                                                        PitchModulationMax;                                // 0x2f8(0x4)
	float                                                        VolumeModulationMin;                               // 0x2fc(0x4)
	float                                                        VolumeModulationMax;                               // 0x300(0x4)
	float                                                        VolumeMultiplier;                                  // 0x304(0x4)
	float                                                        PitchMultiplier;                                   // 0x308(0x4)
	float                                                        HighFrequencyGainMultiplier;                       // 0x30c(0x4)
	Class SoundAttenuation*                                      AttenuationSettings;                               // 0x310(0x8)
	Struct AttenuationSettings                                   AttenuationOverrides;                              // 0x318(0xc0)
};


// Size 0x10
class BasisComponent: public SceneComponent
{
public:
};


// Size 0x10
class CalmWaterComponent: public SceneComponent
{
public:
	float                                                        Radius;                                            // 0x2d0(0x4)
	float                                                        RadiusPercentageToStartLerp;                       // 0x2d4(0x4)
	float                                                        DampeningFactor;                                   // 0x2d8(0x4)
};


// Size 0x20
class ChildActorComponent: public SceneComponent
{
public:
	class                                                        ChildActorClass;                                   // 0x2d0(0x8)
	Class Actor*                                                 ChildActor;                                        // 0x2d8(0x8)
};


// Size 0x10
class EditorOnlyChildActorComponent: public ChildActorComponent
{
public:
	class                                                        CachedChildActorClass;                             // 0x2f0(0x8)
};


// Size 0x30
class DecalComponent: public SceneComponent
{
public:
	Class MaterialInterface*                                     DecalMaterial;                                     // 0x2d0(0x8)
	int                                                          SortOrder;                                         // 0x2d8(0x4)
	float                                                        FadeScreenSize;                                    // 0x2dc(0x4)
	Class MaterialInstanceDynamic*                               MaterialInstanceDynamic;                           // 0x2e0(0x8)
};


// Size 0x60
class ExponentialHeightFogComponent: public SceneComponent
{
public:
	float                                                        FogDensity;                                        // 0x2d0(0x4)
	Struct LinearColor                                           FogInscatteringColor;                              // 0x2d4(0x10)
	Struct LinearColor                                           FarFogInscatteringColor;                           // 0x2e4(0x10)
	float                                                        DirectionalInscatteringExponent;                   // 0x2f4(0x4)
	float                                                        DirectionalInscatteringStartDistance;              // 0x2f8(0x4)
	float                                                        StartScaleDirectionalInscattering;                 // 0x2fc(0x4)
	float                                                        FarScaleDirectionalInscattering;                   // 0x300(0x4)
	Struct LinearColor                                           DirectionalInscatteringColor;                      // 0x304(0x10)
	float                                                        FogHeightFalloff;                                  // 0x314(0x4)
	float                                                        FogMaxOpacity;                                     // 0x318(0x4)
	float                                                        StartDistance;                                     // 0x31c(0x4)
	float                                                        FarDistance;                                       // 0x320(0x4)
	float                                                        StartScale;                                        // 0x324(0x4)
	float                                                        FarScale;                                          // 0x328(0x4)
	bool                                                         bIsUnderwater;                                     // 0x32c(0x1)
};


// Size 0x100
class FogVolumeComponent: public SceneComponent
{
public:
	Struct LinearColor                                           Color;                                             // 0x2d0(0x10)
	float                                                        SceneFogSaturation;                                // 0x2e0(0x4)
	float                                                        Density;                                           // 0x2e4(0x4)
	float                                                        HeightFogFalloff;                                  // 0x2e8(0x4)
	float                                                        DistanceFalloffPower;                              // 0x2ec(0x4)
	float                                                        ShadowIntensity;                                   // 0x2f0(0x4)
	float                                                        ScaleOnTranslucency;                               // 0x2f4(0x4)
	Struct Vector                                                FogVelocity;                                       // 0x2f8(0xc)
	Struct Vector                                                NoisePrimaryScale;                                 // 0x304(0xc)
	Struct Vector                                                NoiseSecondaryScale;                               // 0x310(0xc)
	float                                                        NoiseBlend;                                        // 0x31c(0x4)
	Class Texture*                                               VolumeTexture;                                     // 0x320(0x8)
	float                                                        InscatteringIntensity;                             // 0x328(0x4)
	float                                                        InscatteringPower;                                 // 0x32c(0x4)
	float                                                        ShadowDistance;                                    // 0x330(0x4)
	float                                                        ActiveBelowDepth;                                  // 0x334(0x4)
	bool                                                         bUseSceneInscattering;                             // 0x338(0x1)
	bool                                                         bUnderwater;                                       // 0x33c(0x1)
	bool                                                         bScaleWithLighting;                                // 0x33d(0x1)
	bool                                                         bAdvancedVolumeFog;                                // 0x33e(0x1)
	bool                                                         UseDensityMapOnTranslucency;                       // 0x33f(0x1)
	Class Texture*                                               DensityMap;                                        // 0x340(0x8)
	Struct Vector                                                DensityMapScale;                                   // 0x348(0xc)
	Struct Vector                                                DensityMapOffset;                                  // 0x354(0xc)
	Struct Vector                                                DensityMapActiveHemisphereOrigin;                  // 0x360(0xc)
	Struct Vector                                                DensityMapActiveHemisphereDirection;               // 0x36c(0xc)
	float                                                        DensityMapActiveHemisphereInnerRadius;             // 0x378(0x4)
	float                                                        DensityMapActiveHemisphereOuterRadius;             // 0x37c(0x4)
	float                                                        SelfShadowBrightness;                              // 0x380(0x4)
	float                                                        SelfShadowFogScale;                                // 0x384(0x4)
	bool                                                         bMeshFog;                                          // 0x388(0x1)
	float                                                        MeshFogDensity;                                    // 0x38c(0x4)
	float                                                        MeshFogShadowDensity;                              // 0x390(0x4)
	float                                                        MeshFogScatteringDensity;                          // 0x394(0x4)
	Struct Vector                                                MeshFogNoisePrimaryScale;                          // 0x398(0xc)
	Struct Vector                                                MeshFogNoiseSecondaryScale;                        // 0x3a4(0xc)
	float                                                        MeshFogNoiseBlend;                                 // 0x3b0(0x4)
	Struct Vector                                                MeshFogVelocity;                                   // 0x3b4(0xc)
	Class Texture*                                               MeshFogVolumeTexture;                              // 0x3c0(0x8)
};


// Size 0x0
class InstancedNavMeshInterface: public Interface
{
public:
};


// Size 0x20
class InstancedNavMeshComponent: public SceneComponent
{
public:
	struct FName                                                 NavMeshName;                                       // 0x2d8(0x8)
	bool                                                         UseAttachedParentAsPrimitiveBase;                  // 0x2e0(0x1)
};


// Size 0x30
class AmbientLightSourceComponent: public LightComponent
{
public:
	float                                                        Radius;                                            // 0x458(0x4)
	float                                                        AmbientIntensity;                                  // 0x45c(0x4)
	Struct LinearColor                                           Tint;                                              // 0x460(0x10)
	bool                                                         QuadraticFalloff;                                  // 0x470(0x1)
	byte                                                         Shape;                                             // 0x474(0x1)
	byte                                                         SimpleFunctionType;                                // 0x475(0x1)
	float                                                        ScaleOffset;                                       // 0x478(0x4)
	float                                                        PulsePhase;                                        // 0x47c(0x4)
	float                                                        FlickerFrequency;                                  // 0x480(0x4)
	int                                                          FlickerPerlinRow;                                  // 0x484(0x4)
	bool                                                         bShadowed;                                         // 0x488(0x1)
	byte                                                         GroupingPolicy;                                    // 0x489(0x1)
};


// Size 0x80
class DirectionalLightComponent: public LightComponent
{
public:
	bool                                                         bEnableLightShaftOcclusion;                        // 0x458(0x1)
	float                                                        OcclusionMaskDarkness;                             // 0x45c(0x4)
	float                                                        OcclusionDepthRange;                               // 0x460(0x4)
	Struct Vector                                                LightShaftOverrideDirection;                       // 0x464(0xc)
	float                                                        WholeSceneDynamicShadowRadius;                     // 0x470(0x4)
	float                                                        DynamicShadowDistanceMovableLight;                 // 0x474(0x4)
	float                                                        DynamicShadowDistanceStationaryLight;              // 0x478(0x4)
	int                                                          DynamicShadowCascades;                             // 0x47c(0x4)
	float                                                        CascadeDistributionExponent;                       // 0x480(0x4)
	float                                                        CascadeTransitionFraction;                         // 0x484(0x4)
	float                                                        ShadowDistanceFadeoutFraction;                     // 0x488(0x4)
	float                                                        LastTransitionSizeOverride;                        // 0x48c(0x4)
	float                                                        CloseCascadeUpdateRateInMs;                        // 0x490(0x4)
	float                                                        FarCascadesUpdateRateInMs;                         // 0x494(0x4)
	bool                                                         bUseInsetShadowsForMovableObjects;                 // 0x498(0x1)
	int                                                          FarShadowCascadeCount;                             // 0x49c(0x4)
	float                                                        FarShadowDistance;                                 // 0x4a0(0x4)
	float                                                        NormalOffsetScale;                                 // 0x4a4(0x4)
	float                                                        CloudsShadowsIntensity;                            // 0x4a8(0x4)
	float                                                        DistanceFieldShadowDistance;                       // 0x4ac(0x4)
	float                                                        LightSourceAngle;                                  // 0x4b0(0x4)
	float                                                        TraceDistance;                                     // 0x4b4(0x4)
	Struct LightmassDirectionalLightSettings                     LightmassSettings;                                 // 0x4b8(0x10)
	bool                                                         bCastModulatedShadows;                             // 0x4c8(0x1)
	Struct Color                                                 ModulatedShadowColor;                              // 0x4cc(0x4)
	bool                                                         bUsedAsAtmosphereSunLight;                         // 0x4d0(0x1)
};


// Size 0x40
class PointLightComponent: public LightComponent
{
public:
	float                                                        Radius;                                            // 0x458(0x4)
	float                                                        AttenuationRadius;                                 // 0x45c(0x4)
	bool                                                         bUseInverseSquaredFalloff;                         // 0x460(0x1)
	float                                                        LightFalloffExponent;                              // 0x464(0x4)
	float                                                        IntensityScaleForWater;                            // 0x468(0x4)
	float                                                        MinDistanceToLightAssumed;                         // 0x46c(0x4)
	float                                                        SourceRadius;                                      // 0x470(0x4)
	float                                                        SourceLength;                                      // 0x474(0x4)
	byte                                                         SimpleFunctionType;                                // 0x478(0x1)
	float                                                        ScaleOffset;                                       // 0x47c(0x4)
	float                                                        PulsePhase;                                        // 0x480(0x4)
	float                                                        FlickerFrequency;                                  // 0x484(0x4)
	int                                                          FlickerPerlinRow;                                  // 0x488(0x4)
	Struct LightmassPointLightSettings                           LightmassSettings;                                 // 0x48c(0xc)
};


// Size 0x10
class SpotLightComponent: public PointLightComponent
{
public:
	float                                                        InnerConeAngle;                                    // 0x498(0x4)
	float                                                        OuterConeAngle;                                    // 0x49c(0x4)
	float                                                        LightShaftConeAngle;                               // 0x4a0(0x4)
	float                                                        KickBackRatio;                                     // 0x4a4(0x4)
};


// Size 0x1a0
class SkyLightComponent: public LightComponentBase
{
public:
	byte                                                         SourceType;                                        // 0x300(0x1)
	Class TextureCube*                                           Cubemap;                                           // 0x308(0x8)
	float                                                        SkyDistanceThreshold;                              // 0x310(0x4)
	bool                                                         bLowerHemisphereIsBlack;                           // 0x314(0x1)
	float                                                        OcclusionMaxDistance;                              // 0x318(0x4)
	float                                                        Contrast;                                          // 0x31c(0x4)
	float                                                        MinOcclusion;                                      // 0x320(0x4)
	Struct Color                                                 OcclusionTint;                                     // 0x324(0x4)
	float                                                        ScaleForInteriors;                                 // 0x328(0x4)
	Class TextureCube*                                           BlendDestinationCubemap;                           // 0x3d8(0x8)
};


// Size 0x30
class NavigationGraphNodeComponent: public SceneComponent
{
public:
	Struct NavGraphNode                                          Node;                                              // 0x2d0(0x18)
	Class NavigationGraphNodeComponent*                          NextNodeComponent;                                 // 0x2e8(0x8)
	Class NavigationGraphNodeComponent*                          PrevNodeComponent;                                 // 0x2f0(0x8)
};


// Size 0x30
class PhysicsSpringComponent: public SceneComponent
{
public:
	float                                                        SpringStiffness;                                   // 0x2d0(0x4)
	float                                                        SpringDamping;                                     // 0x2d4(0x4)
	float                                                        SpringLengthAtRest;                                // 0x2d8(0x4)
	float                                                        SpringRadius;                                      // 0x2dc(0x4)
	byte                                                         SpringChannel;                                     // 0x2e0(0x1)
	bool                                                         bIgnoreSelf;                                       // 0x2e1(0x1)
	float                                                        SpringCompression;                                 // 0x2e4(0x4)
};


// Size 0x10
class PhysicsThrusterComponent: public SceneComponent
{
public:
	float                                                        ThrustStrength;                                    // 0x2d0(0x4)
};


// Size 0x0
class WaterId: public Object
{
public:
};


// Size 0x10
class BaseWaterComponent: public PrimitiveComponent
{
public:
	class                                                        WaterId;                                           // 0x5a8(0x8)
	bool                                                         ActiveInExclusionZone;                             // 0x5b0(0x1)
};


// Size 0x3e0
class FFTWaterComponent: public BaseWaterComponent
{
public:
	Struct FFTWaterComponentParams                               WaterParams;                                       // 0x5b8(0x310)
	Class Model*                                                 Brush;                                             // 0x8c8(0x8)
	Class BodySetup*                                             BrushBodySetup;                                    // 0x8d0(0x8)
	Struct Vector                                                PrePivot;                                          // 0x8d8(0xc)
	Class MaterialInterface*                                     LightFunctionMaterial;                             // 0x968(0x8)
	Class Material*                                              DefaultLightFunctionMaterial;                      // 0x970(0x8)
};


// Size 0x320
class FFTWaterExtendedPlaneComponent: public BaseWaterComponent
{
public:
	Struct FFTWaterComponentParams                               WaterParams;                                       // 0x5b8(0x310)
	Class Material*                                              Material;                                          // 0x8c8(0x8)
};


// Size 0x20
class BillboardComponent: public PrimitiveComponent
{
public:
	Class Texture2D*                                             Sprite;                                            // 0x5a8(0x8)
	bool                                                         bIsScreenSizeScaled;                               // 0x5b0(0x1)
	float                                                        ScreenSize;                                        // 0x5b4(0x4)
	float                                                        U;                                                 // 0x5b8(0x4)
	float                                                        UL;                                                // 0x5bc(0x4)
	float                                                        V;                                                 // 0x5c0(0x4)
	float                                                        VL;                                                // 0x5c4(0x4)
};


// Size 0x20
class BrushComponent: public PrimitiveComponent
{
public:
	Class Model*                                                 Brush;                                             // 0x5a8(0x8)
	Class BodySetup*                                             BrushBodySetup;                                    // 0x5b0(0x8)
	Struct Vector                                                PrePivot;                                          // 0x5b8(0xc)
};


// Size 0x20
class DrawFrustumComponent: public PrimitiveComponent
{
public:
	Struct Color                                                 FrustumColor;                                      // 0x5a8(0x4)
	float                                                        FrustumAngle;                                      // 0x5ac(0x4)
	float                                                        FrustumAspectRatio;                                // 0x5b0(0x4)
	float                                                        FrustumStartDist;                                  // 0x5b4(0x4)
	float                                                        FrustumEndDist;                                    // 0x5b8(0x4)
	Class Texture*                                               Texture;                                           // 0x5c0(0x8)
};


// Size 0x30
class LineBatchComponent: public PrimitiveComponent
{
public:
};


// Size 0x10
class MaterialBillboardComponent: public PrimitiveComponent
{
public:
	TArray<Struct MaterialSpriteElement>                         Elements;                                          // 0x5a8(0x10)
};


// Size 0x120
class CollisionProfile: public DeveloperSettings
{
public:
	TArray<Struct CollisionResponseTemplate>                     Profiles;                                          // 0x38(0x10)
	TArray<Struct CustomChannelSetup>                            DefaultChannelResponses;                           // 0x48(0x10)
	TArray<Struct CustomProfile>                                 EditProfiles;                                      // 0x58(0x10)
	TArray<Struct Redirector>                                    ProfileRedirects;                                  // 0x68(0x10)
	TArray<Struct Redirector>                                    CollisionChannelRedirects;                         // 0x78(0x10)
};


// Size 0x110
class StaticMesh: public Object
{
public:
	int                                                          MinLOD;                                            // 0x40(0x4)
	TArray<class Materials*>                                     Materials;                                         // 0x48(0x10)
	int                                                          LightMapResolution;                                // 0x58(0x4)
	int                                                          LightMapCoordinateIndex;                           // 0x5c(0x4)
	Class BodySetup*                                             BodySetup;                                         // 0x60(0x8)
	int                                                          LODForCollision;                                   // 0x68(0x4)
	bool                                                         bUseMaximumStreamingTexelRatio;                    // 0x6c(0x1)
	bool                                                         bStripComplexCollisionForConsole;                  // 0x6c(0x1)
	bool                                                         bHasNavigationData;                                // 0x6c(0x1)
	float                                                        StreamingDistanceMultiplier;                       // 0x70(0x4)
	float                                                        LpvBiasMultiplier;                                 // 0x74(0x4)
	TArray<class Sockets*>                                       Sockets;                                           // 0xa8(0x10)
	Struct Vector                                                PositiveBoundsExtension;                           // 0xd0(0xc)
	Struct Vector                                                NegativeBoundsExtension;                           // 0xdc(0xc)
	Struct BoxSphereBounds                                       ExtendedBounds;                                    // 0xe8(0x1c)
	TArray<Str SourceMaterials>                                  SourceMaterials;                                   // 0x108(0x10)
	int                                                          UVsForStreaming;                                   // 0x118(0x4)
	int                                                          ElementToIgnoreForTexFactor;                       // 0x11c(0x4)
	TArray<class AssetUserData*>                                 AssetUserData;                                     // 0x120(0x10)
	Class NavCollision*                                          NavCollision;                                      // 0x130(0x8)
};


// Size 0x20
class MergedCollisionComponent: public PrimitiveComponent
{
public:
	TArray<Struct MergedCollisionComponentStaticMeshInstanceData> PerInstanceData;                                   // 0x5a8(0x10)
};


// Size 0xc0
class DestructibleComponent: public SkinnedMeshComponent
{
public:
	bool                                                         bFractureEffectOverride;                           // 0x6e0(0x1)
	TArray<Struct FractureEffect>                                FractureEffects;                                   // 0x6e8(0x10)
	bool                                                         bEnableHardSleeping;                               // 0x6f8(0x1)
	float                                                        LargeChunkThreshold;                               // 0x6fc(0x4)
};


// Size 0xd0
class PoseableMeshComponent: public SkinnedMeshComponent
{
public:
};


// Size 0x10
class PoseableSkeletalMeshComponent: public SkeletalMeshComponent
{
public:
};


// Size 0xa0
class FlatWaterMeshComponent: public StaticMeshComponent
{
public:
	int                                                          RandomDropRate;                                    // 0x610(0x4)
	float                                                        RandomDropSize;                                    // 0x614(0x4)
	float                                                        RandomDropHeight;                                  // 0x618(0x4)
	float                                                        RestorationScale;                                  // 0x61c(0x4)
	float                                                        ForceScale;                                        // 0x620(0x4)
	float                                                        DampHeight;                                        // 0x624(0x4)
	float                                                        NormalMapScale;                                    // 0x628(0x4)
	int                                                          TextureWidth;                                      // 0x62c(0x4)
	int                                                          TextureHeight;                                     // 0x630(0x4)
	Class StaticMesh*                                            ClippingHull;                                      // 0x638(0x8)
	float                                                        MaxSimulationDistance;                             // 0x640(0x4)
	float                                                        InitialRandomHeight;                               // 0x644(0x4)
	float                                                        InitialRandomVelocity;                             // 0x648(0x4)
	Class Texture*                                               Texture;                                           // 0x650(0x8)
	Class Texture*                                               NormalTexture;                                     // 0x658(0x8)
	Class TextureRenderTarget2D*                                 WaterMaskTexture;                                  // 0x660(0x8)
	TArray<class OriginalMaterials*>                             OriginalMaterials;                                 // 0x680(0x10)
	TArray<Struct FlatWaterMeshTextureOverride>                  TextureOverrides;                                  // 0x690(0x10)
};


// Size 0x90
class InstancedCoverageMeshComponent: public StaticMeshComponent
{
public:
	int                                                          InstanceCount;                                     // 0x618(0x4)
	int                                                          InstancingRandomSeed;                              // 0x61c(0x4)
	float                                                        InstancePositionExtrusion;                         // 0x620(0x4)
	float                                                        InstanceScale;                                     // 0x624(0x4)
	float                                                        InstanceScaleVariance;                             // 0x628(0x4)
	Struct Rotator                                               InstanceRotation;                                  // 0x62c(0xc)
	Struct Rotator                                               InstanceRotationVariance;                          // 0x638(0xc)
	Struct Vector                                                InstanceAttractionDirection;                       // 0x644(0xc)
	float                                                        InstanceAttractionIntensity;                       // 0x650(0x4)
	int                                                          InstanceBaseMeshPlacementLOD;                      // 0x654(0x4)
	TArray<Struct InstancedCoverageMeshLOD>                      LODs;                                              // 0x658(0x10)
	float                                                        CompleteCullingDistance;                           // 0x668(0x4)
	bool                                                         InstanceLODPreserveSilhouette;                     // 0x66c(0x1)
	float                                                        BackFaceCullingAngle;                              // 0x670(0x4)
	float                                                        ShadowBackFaceCullingAngle;                        // 0x674(0x4)
	int                                                          MaxPlacementAttempts;                              // 0x678(0x4)
	bool                                                         bEvenlySpaced;                                     // 0x67c(0x1)
	bool                                                         bVertexColourDensity;                              // 0x67d(0x1)
	bool                                                         bUpdatePlacement;                                  // 0x67e(0x1)
	TArray<Float RandomNumbers>                                  RandomNumbers;                                     // 0x680(0x10)
	float                                                        BaseMeshSurfaceArea;                               // 0x690(0x4)
	Class StaticMesh*                                            CoveredMesh;                                       // 0x698(0x8)
};


// Size 0x20
class MergedStaticMeshComponent: public StaticMeshComponent
{
public:
	bool                                                         bDisplayMergedInEditor;                            // 0x610(0x1)
	TArray<Float LODScreenSizes>                                 LODScreenSizes;                                    // 0x618(0x10)
	int                                                          LODForCollision;                                   // 0x628(0x4)
	bool                                                         bMergeVertexColours;                               // 0x62c(0x1)
};


// Size 0x80
class MobileInstancedStaticMeshComponent: public StaticMeshComponent
{
public:
	int                                                          MaxInstances;                                      // 0x610(0x4)
	TArray<Struct Transform>                                     InstanceTransforms;                                // 0x620(0x10)
	TArray<Struct Matrix>                                        InstanceMatrices;                                  // 0x630(0x10)
	Struct BoxSphereBounds                                       LocalBounds;                                       // 0x640(0x1c)
	bool                                                         bBoundsBuilt;                                      // 0x65c(0x1)
	Class PhysicsSerializer*                                     PhysicsSerializer;                                 // 0x660(0x8)
};


// Size 0xa0
class SplineMeshComponent: public StaticMeshComponent
{
public:
	Struct SplineMeshParams                                      SplineParams;                                      // 0x618(0x58)
	Struct Vector                                                SplineUpDir;                                       // 0x670(0xc)
	bool                                                         bAllowSplineEditingPerInstance;                    // 0x67c(0x1)
	bool                                                         bSmoothInterpRollScale;                            // 0x67c(0x1)
	byte                                                         ForwardAxis;                                       // 0x680(0x1)
	float                                                        SplineBoundaryMin;                                 // 0x684(0x4)
	float                                                        SplineBoundaryMax;                                 // 0x688(0x4)
	Class BodySetup*                                             BodySetup;                                         // 0x690(0x8)
	Struct Guid                                                  CachedMeshBodySetupGuid;                           // 0x698(0x10)
	bool                                                         bMeshDirty;                                        // 0x6a8(0x1)
};


// Size 0x40
class ModelComponent: public PrimitiveComponent
{
public:
	Class BodySetup*                                             ModelBodySetup;                                    // 0x5c0(0x8)
};


