// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x180
class LostSandsRowboatGunpowderBarrel: public Actor
{
public:
	Class ActionRulesComponent*                                  ActionRulesComponent;                              // 0x480(0x8)
	Class InteractableComponent*                                 InteractableComponent;                             // 0x488(0x8)
	Class StaticMeshMemoryConstraintComponent*                   StaticMeshComponent;                               // 0x490(0x8)
	Class FlammableWieldableComponent*                           FlammableComponent;                                // 0x498(0x8)
	Class LightWeightStatusEffectManagerComponent*               StatusEffectComponent;                             // 0x4a0(0x8)
	Class ItemHealthComponent*                                   ItemHealthComponent;                               // 0x4a8(0x8)
	Class ExplosionComponent*                                    ExplosionComponent;                                // 0x4b0(0x8)
	Class RewindComponent*                                       RewindComponent;                                   // 0x4b8(0x8)
	class                                                        ToggleFuseInputId;                                 // 0x4c0(0x8)
	Struct FText                                                 LightFuseDescription;                              // 0x4c8(0x38)
	Struct FText                                                 ExtinguishFuseDescription;                         // 0x500(0x38)
};


}