// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x140
class SafeZoneComponent: public CapsuleComponent
{
public:
	float                                                        ExclusionRadius;                                   // 0x5f0(0x4)
	float                                                        ExclusionHeight;                                   // 0x5f8(0x4)
	struct FName                                                 SafeZoneEmptyCollisionProfile;                     // 0x5fc(0x8)
	bool                                                         AutoActivateSafeZone;                              // 0x604(0x1)
	bool                                                         DeactivateSafeZoneAfterExclusionRadiusIsEmpty;     // 0x605(0x1)
	bool                                                         UsePlayerTeleport;                                 // 0x606(0x1)
	float                                                        PlayerTeleportRadius;                              // 0x608(0x4)
	bool                                                         UseRepelForce;                                     // 0x610(0x1)
	float                                                        RepelForceRadius;                                  // 0x614(0x4)
	float                                                        RepelForceExtents;                                 // 0x61c(0x4)
	float                                                        RepelForceMin;                                     // 0x620(0x4)
	float                                                        RepelForceMax;                                     // 0x624(0x4)
	bool                                                         ApplyRepelForceAtCentreOfMass;                     // 0x628(0x1)
	Struct RuntimeFloatCurve                                     RepelForceGradientCurve;                           // 0x630(0x80)
	bool                                                         UseAngularImpulse;                                 // 0x6b0(0x1)
	float                                                        AngularImpulseRadius;                              // 0x6b4(0x4)
	float                                                        AngularImpulseForce;                               // 0x6bc(0x4)
	float                                                        TargetDeflectionAngle;                             // 0x6c0(0x4)
	bool                                                         IsSafeZoneEmpty;                                   // 0x6c4(0x1)
	bool                                                         StopAISpawning;                                    // 0x6c5(0x1)
	struct FName                                                 CurrentCollisionProfile;                           // 0x6c8(0x8)
	byte                                                         SafeZoneState;                                     // 0x6d0(0x1)
};


}