// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x18
class BP_SmallShipStorageBarrel_Wood_C: public StorageContainer
{
public:
	Class ReplenishableComponent*                                None;                                              // 0x4c0(0x8)
	Class ShipTelemetrySubjectComponent*                         None;                                              // 0x4c8(0x8)
	Class StorageContainerComponent*                             None;                                              // 0x4d0(0x8)
};


// Size 0x18
class BP_SmallShipStorageBarrel_Food_C: public StorageContainer
{
public:
	Class ReplenishableComponent*                                None;                                              // 0x4c0(0x8)
	Class ShipTelemetrySubjectComponent*                         None;                                              // 0x4c8(0x8)
	Class StorageContainerComponent*                             None;                                              // 0x4d0(0x8)
};


// Size 0x18
class BP_SmallShipStorageBarrel_Cannonball_C: public StorageContainer
{
public:
	Class ReplenishableComponent*                                None;                                              // 0x4c0(0x8)
	Class ShipTelemetrySubjectComponent*                         None;                                              // 0x4c8(0x8)
	Class StorageContainerComponent*                             None;                                              // 0x4d0(0x8)
};


}