// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x58
class sot_frontend_01_a_animation_C: public LevelScriptActor
{
public:
	Struct PointerToUberGraphFrame                               UberGraphFrame;                                    // 0x3d8(0x8)
	Class StaticMeshActor*                                       shipSelectUI_title_14_ExecuteUbergraph_sot_frontend_01_a_animat; // 0x3e0(0x8)
	Class StaticMeshActor*                                       shipSelectUI_gallion_10_ExecuteUbergraph_sot_frontend_01_a_anim; // 0x3e8(0x8)
	Class StaticMeshActor*                                       shipSelectUI_sloop_12_ExecuteUbergraph_sot_frontend_01_a_animat; // 0x3f0(0x8)
	Class SkeletalMeshActor*                                     shipSelect_CharMarker2_ExecuteUbergraph_sot_frontend_01_a_anima; // 0x3f8(0x8)
	BlueprintGeneratedClass BP_PirateGenerator_LineUp_C*         BP_PirateGenerator_LineUp_C_4_ExecuteUbergraph_sot_frontend_01_; // 0x400(0x8)
	Class MatineeActor*                                          MatineeActor_ShipSelect_ExecuteUbergraph_sot_frontend_01_a_anim; // 0x408(0x8)
	Class MatineeActor*                                          MatineeActor_ShipSelect_UniqueObjectNameForCooking_1530807069_R; // 0x410(0x8)
	Class CameraActor*                                           ShipSelectScreenCam_UniqueObjectNameForCooking_1530807069_RefPr; // 0x418(0x8)
	Class MatineeActor*                                          MatineeActor_ShipSelect_UniqueObjectNameForCooking_1530807072_R; // 0x420(0x8)
	BlueprintGeneratedClass BP_PirateGenerator_LineUp_C*         BP_PirateGenerator_LineUp_C_4_UniqueObjectNameForCooking_153080; // 0x428(0x8)
};


}