// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x8
class BP_TT_RitualBone_C: public Actor
{
public:
	Class StaticMeshComponent*                                   None;                                              // 0x3d0(0x8)
};


// Size 0x8
class BP_Skull_OoS_C: public Actor
{
public:
	Class StaticMeshComponent*                                   None;                                              // 0x3d0(0x8)
};


// Size 0x20
class BP_RitualBottleTop_C: public Actor
{
public:
	Class StaticMeshComponent*                                   None;                                              // 0x3d0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x3d8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x3e0(0x8)
	Class SceneComponent*                                        None;                                              // 0x3e8(0x8)
};


// Size 0x20
class BP_RitualBottle_C: public Actor
{
public:
	Class StaticMeshComponent*                                   None;                                              // 0x3d0(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x3d8(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x3e0(0x8)
	Class SceneComponent*                                        None;                                              // 0x3e8(0x8)
};


// Size 0x10
class BP_Ritual2_R_Pendant_C: public Actor
{
public:
	Class StaticMeshComponent*                                   None;                                              // 0x3d0(0x8)
	Class SceneComponent*                                        None;                                              // 0x3d8(0x8)
};


// Size 0x10
class BP_Ritual2_R_Effigy_C: public Actor
{
public:
	Class SkeletalMeshComponent*                                 None;                                              // 0x3d0(0x8)
	Class SceneComponent*                                        None;                                              // 0x3d8(0x8)
};


// Size 0x10
class BP_Ritual2_L_Pendant_C: public Actor
{
public:
	Class StaticMeshComponent*                                   None;                                              // 0x3d0(0x8)
	Class SceneComponent*                                        None;                                              // 0x3d8(0x8)
};


// Size 0x10
class BP_Ritual2_L_Effigy_C: public Actor
{
public:
	Class SkeletalMeshComponent*                                 None;                                              // 0x3d0(0x8)
	Class SceneComponent*                                        None;                                              // 0x3d8(0x8)
};


}