// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x60
class BP_ghost_ship_scene_C: public Actor
{
public:
	Struct PointerToUberGraphFrame                               None;                                              // 0x3d0(0x8)
	Class WwiseEmitterComponent*                                 None;                                              // 0x3d8(0x8)
	Class SceneComponent*                                        None;                                              // 0x3e0(0x8)
	TArray<class None*>                                          None;                                              // 0x3e8(0x10)
	struct FName                                                 None;                                              // 0x3f8(0x8)
	TArray<class None*>                                          None;                                              // 0x400(0x10)
	bool                                                         None;                                              // 0x410(0x1)
	TArray<class None*>                                          None;                                              // 0x418(0x10)
	float                                                        None;                                              // 0x428(0x4)
	float                                                        None;                                              // 0x42c(0x4)
};


}