// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x80
class wld_bush_cluster_02_b_C: public BP_Placement_HeightDrop_C
{
public:
	Class StaticMeshComponent*                                   wld_rock_large_01__b;                              // 0x410(0x8)
	Class StaticMeshComponent*                                   wld_rock_small_01__d;                              // 0x418(0x8)
	Class StaticMeshComponent*                                   wld_rock_small_01__c;                              // 0x420(0x8)
	Class StaticMeshComponent*                                   wld_rock_small_01__b;                              // 0x428(0x8)
	Class StaticMeshComponent*                                   wld_rock_xlarge_06_a;                              // 0x430(0x8)
	Class StaticMeshComponent*                                   wld_rock_large_01__e;                              // 0x438(0x8)
	Class StaticMeshComponent*                                   wld_rock_large_01__a;                              // 0x440(0x8)
	Class StaticMeshComponent*                                   wld_rock_large_01__c;                              // 0x448(0x8)
	Class StaticMeshComponent*                                   wsp_rock_pebbles_d_01;                             // 0x450(0x8)
	Class StaticMeshComponent*                                   wsp_rock_pebbles_h_01;                             // 0x458(0x8)
	Class StaticMeshComponent*                                   wsp_rock_pebbles_g_01;                             // 0x460(0x8)
	Class StaticMeshComponent*                                   wsp_rock_pebbles_b_01;                             // 0x468(0x8)
	Class StaticMeshComponent*                                   wsp_rock_pebbles_c_01;                             // 0x470(0x8)
	Class StaticMeshComponent*                                   wsp_rock_pebbles_a_01;                             // 0x478(0x8)
	Class StaticMeshComponent*                                   wsp_rock_pebbles_f_01;                             // 0x480(0x8)
	Class SceneComponent*                                        SharedRoot;                                        // 0x488(0x8)
};


}