// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x40
class wld_shp_rocks_cluster_02_C: public BP_Placement_HeightDrop_C
{
public:
	Class StaticMeshComponent*                                   wld_rock_xlarge_05_a;                              // 0x410(0x8)
	Class StaticMeshComponent*                                   wld_rock_large_01__c;                              // 0x418(0x8)
	Class StaticMeshComponent*                                   wld_rock_xlarge_04_a;                              // 0x420(0x8)
	Class StaticMeshComponent*                                   StaticMesh7;                                       // 0x428(0x8)
	Class StaticMeshComponent*                                   StaticMesh10;                                      // 0x430(0x8)
	Class StaticMeshComponent*                                   StaticMesh9;                                       // 0x438(0x8)
	Class StaticMeshComponent*                                   StaticMesh;                                        // 0x440(0x8)
	Class SceneComponent*                                        Scene;                                             // 0x448(0x8)
};


}