// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x38
class wld_palm_cluster_05_b_C: public None
{
public:
	Class StaticMeshComponent*                                   None;                                              // 0x410(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x418(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x420(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x428(0x8)
	Class NonVagueNonUniqueLandmarkComponent*                    None;                                              // 0x430(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x438(0x8)
	Class SceneComponent*                                        None;                                              // 0x440(0x8)
};


// Size 0x28
class wld_palm_cluster_05_a_C: public None
{
public:
	Class StaticMeshComponent*                                   None;                                              // 0x410(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x418(0x8)
	Class NonVagueNonUniqueLandmarkComponent*                    None;                                              // 0x420(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x428(0x8)
	Class SceneComponent*                                        None;                                              // 0x430(0x8)
};


// Size 0x28
class wld_palm_cluster_04_d_C: public None
{
public:
	Class StaticMeshComponent*                                   None;                                              // 0x410(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x418(0x8)
	Class NonVagueNonUniqueLandmarkComponent*                    None;                                              // 0x420(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x428(0x8)
	Class SceneComponent*                                        None;                                              // 0x430(0x8)
};


// Size 0x28
class wld_palm_cluster_04_c_C: public None
{
public:
	Class StaticMeshComponent*                                   None;                                              // 0x410(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x418(0x8)
	Class NonVagueNonUniqueLandmarkComponent*                    None;                                              // 0x420(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x428(0x8)
	Class SceneComponent*                                        None;                                              // 0x430(0x8)
};


// Size 0x38
class wld_palm_cluster_04_b_C: public None
{
public:
	Class StaticMeshComponent*                                   None;                                              // 0x410(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x418(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x420(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x428(0x8)
	Class NonVagueNonUniqueLandmarkComponent*                    None;                                              // 0x430(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x438(0x8)
	Class SceneComponent*                                        None;                                              // 0x440(0x8)
};


// Size 0x38
class wld_palm_cluster_04_a_C: public None
{
public:
	Class StaticMeshComponent*                                   None;                                              // 0x410(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x418(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x420(0x8)
	Class NonVagueNonUniqueLandmarkComponent*                    None;                                              // 0x428(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x430(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x438(0x8)
	Class SceneComponent*                                        None;                                              // 0x440(0x8)
};


}