// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x48
class wld_bush_cluster_02_a_C: public BP_Placement_HeightDrop_C
{
public:
	Class StaticMeshComponent*                                   wsp_rock_pebbles_d_01;                             // 0x410(0x8)
	Class StaticMeshComponent*                                   wsp_rock_pebbles_f_01;                             // 0x418(0x8)
	Class StaticMeshComponent*                                   wld_bush_01_a_01;                                  // 0x420(0x8)
	Class StaticMeshComponent*                                   wsp_cave_tunnel_wall_rock_01_a;                    // 0x428(0x8)
	Class StaticMeshComponent*                                   wsp_rock_xtra_small_b_01;                          // 0x430(0x8)
	Class StaticMeshComponent*                                   wsp_rock_xtra_small_d_01;                          // 0x438(0x8)
	Class StaticMeshComponent*                                   wsp_rock_pebbles_c_01;                             // 0x440(0x8)
	Class StaticMeshComponent*                                   wsp_rock_xtra_small_a_01;                          // 0x448(0x8)
	Class SceneComponent*                                        SharedRoot;                                        // 0x450(0x8)
};


}