// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x48
class wld_beach_rocks_05_C: public BP_Placement_HeightDrop_C
{
public:
	Class StaticMeshComponent*                                   wld_rock_xlarge_04_b;                              // 0x410(0x8)
	Class StaticMeshComponent*                                   wld_rock_large_01__e;                              // 0x418(0x8)
	Class StaticMeshComponent*                                   wld_rock_small_01__d;                              // 0x420(0x8)
	Class StaticMeshComponent*                                   wld_rock_small_01__a;                              // 0x428(0x8)
	Class StaticMeshComponent*                                   wld_rock_medium_01__b;                             // 0x430(0x8)
	Class StaticMeshComponent*                                   wld_rock_medium_01__a;                             // 0x438(0x8)
	Class StaticMeshComponent*                                   wld_rock_large_01__a;                              // 0x440(0x8)
	Class StaticMeshComponent*                                   wsp_cavern_roof_rock_02;                           // 0x448(0x8)
	Class SceneComponent*                                        Scene;                                             // 0x450(0x8)
};


}