// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x58
class wld_beach_rocks_02_C: public BP_Placement_HeightDrop_C
{
public:
	Class StaticMeshComponent*                                   wld_rock_large_01__c1;                             // 0x410(0x8)
	Class StaticMeshComponent*                                   wld_rock_small_01__b;                              // 0x418(0x8)
	Class StaticMeshComponent*                                   wld_rock_small_01__c1;                             // 0x420(0x8)
	Class StaticMeshComponent*                                   wld_rock_small_01__c;                              // 0x428(0x8)
	Class StaticMeshComponent*                                   wld_rock_large_01__c;                              // 0x430(0x8)
	Class StaticMeshComponent*                                   wld_rock_large_01__d;                              // 0x438(0x8)
	Class StaticMeshComponent*                                   wld_rock_large_01__b;                              // 0x440(0x8)
	Class StaticMeshComponent*                                   wld_rock_large_01__a;                              // 0x448(0x8)
	Class StaticMeshComponent*                                   wld_rock_xlarge_04_a;                              // 0x450(0x8)
	Class StaticMeshComponent*                                   wld_rock_medium_01__e;                             // 0x458(0x8)
	Class SceneComponent*                                        Scene;                                             // 0x460(0x8)
};


}