// Generated by DougTheDruid#2784 on Discord
// https://github.com/DougTheDruid
namespace DougsSDKDumper
{
//-----
// Classes
//-----

// Size 0x88
class wsp_palm_cluster_03_d_C: public None
{
public:
	bool                                                         None;                                              // 0x0(0x1)
};


// Size 0x38
class wsp_palm_cluster_03_c_C: public None
{
public:
	None FloatProperty*                                          None;                                              // 0x400(0x8)
};


// Size 0x10
class wsp_palm_cluster_02_b_C: public None
{
public:
	Class ParticleSystemComponent*                               None;                                              // 0x560(0x8)
	Class ParticleSystemComponent*                               None;                                              // 0x568(0x8)
	Class PointLightComponent*                                   None;                                              // 0x570(0x8)
	Class PointLightComponent*                                   None;                                              // 0x578(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x580(0x8)
	Class StaticMeshComponent*                                   None;                                              // 0x588(0x8)
	Class PlayerGeneratedMapsContainerComponent*                 None;                                              // 0x590(0x8)
};


// Size 0x18
class wsp_palm_cluster_02_a_C: public None
{
public:
};


// Size 0x10
class wsp_palm_cluster_01_b_C: public None
{
public:
};


}